{
  "dateUnix": 1320796307000,
  "dateFormatted": "Tuesday 8 Nov 2011",
  "pageHeading": "Hats",
  "pagePath": "/2011/11/08/hats/",
  "innerHTML": "<p>Some days I wear my perfectionist hat, other days I wear my pragmatist hat.</p>\n<p>I would much prefer to wear a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.flickr.com/photos/freddievonchimp/sets/72157626505122242/\">MailChimp chimp hat</a> but that’s neither here nor there. *</p>\n<p>Web standards are not perfect as this month’s hilariously geeky <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.netmagazine.com/news/w3c-restores-time-element-html5-111539\"><code>&lt;time&gt;</code> element debacle</a> has reminded us. The practice and adoption of standards from both browsers and developers is never going to be a utopian experience. Interweave that with something like design in all its volatile glory and you just about sum up <em>the web</em> as an industry.</p>\n<p>With that mix you’d think the best viewpoint would be a pragmatic one (see <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://futurefriend.ly/index.html\">Future Friendly</a>). Get the underlying basics right — i.e. just make sure it’s an actual website with semantic content and accessible URLs. Don’t segregate what you think are “mobile” users in an em-dot world of watered down content and functionality. Don’t assume user context where there is none implied. Simply understand that there is “one web” and the way we access it is <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.lukew.com/ff/entry.asp?1441\">forever changing</a>. Our job as web designers and developers is to present our sites with the most accessible and friendly experience possible for all users &amp; robots.</p>\n<p>For myself and most of my clients, a responsive web design is the perfect presentation solution right now (as oppose to a fixed-width design) and I would <em>strongly</em> argue in favour of this technique for the vast majority of content-based websites.</p>\n<p>Sometimes I play it safe and design what I know works from experience, other times I feel it’s right to push forward and optimise for the <a href=\"/2011/10/18/the-thoughtful-touches/\">cutting edge</a>. All the while I soak up what others are experimenting with.</p>\n<p>Whatever your choice, just get the basic <a href=\"/2011/10/01/building-for-future-design/\">foundations</a> right and presentation can be iterated upon as techniques, technologies and fashions change. I’d like to think my personal biographical URL will forever be <a href=\"/about/\">/about</a> right until the day my future descendants forget to renew my domain, regardless of how many times I will redesign before that point. It may even feature a hat some day.</p>\n<p>From a UX and aesthetic viewpoint what works best for users _today _may/will change tomorrow.</p>\n<p>Accessibility however, should remain timeless.</p>\n<p class=\"p--small u-dim\">* My life would feel complete with a chimp hat.</p>\n<p class=\"p--small u-dim\">*[UX]: user experience</p>\n",
  "pageExcerpt": "Some days I wear my perfectionist hat, other days I wear my pragmatist hat.\nI would much prefer to wear a MailChimp chimp hat but that’s neither here nor there. *\nWeb standards are not perfect as this month’s hilariously geeky &lt;time&gt; element debacle has reminded us. The practice and adoption of standards from both browsers and […]",
  "pageTitle": "Hats – David Bushell – Web Design (UK)"
}