{
  "dateUnix": 1251812644000,
  "dateFormatted": "Tuesday 1 Sep 2009",
  "pageHeading": "Creative Packaging",
  "pagePath": "/2009/09/01/creative-packaging/",
  "innerHTML": "<p>Creative Review unleashes some experimental packaging for their latest magazine. More exciting than a brown envelope.</p>\n<p class=\"quote\">“CR subscribers will notice something unusual about their CR package this month when it arrives on their doormats”</p>\n\n\n<p>I certainly did, it arrived in several pieces on my doormat.</p>\n<p>Apparently this is Creative Review’s attempt to provide a filing system for their Monograph booklets that come free with the CR mag every month.</p>\n<p><img src=\"/images/blog/cr-mono/m1.jpg\" alt=\"Packaging - Creative Review Monograph\"></p>\n<p>One could blame the Royal Mail for this but personally I think they’ve excelled themselves in managing to deliver something at all! Actually I am going to blame the Royal Mail because my Snow Leopard DVD arrived today and looks like it was also dropped under a bus.</p>\n<p>I can’t be too harsh on CR because this is a very creative idea and I had fun trying to build it. It’s succeeded in making me find all the Monograph booklets I left lying around the office.</p>\n<h3 id=\"putting-the-pieces-together\">Putting the Pieces Together</h3>\n<p><img src=\"/images/blog/cr-mono/m2.jpg\" alt=\"Building - Creative Review Monograph\"></p>\n<p>First attempt at building it didn’t go very well. I think there were too many tabs, and the instructions were IKEA-esque. But with respect to CR it did eventually stand up by itself!</p>\n<p><img src=\"/images/blog/cr-mono/m3.jpg\" alt=\"Built - Creative Review Monograph\"></p>\n<p>See what it should have looked like at <a href=\"http://creativereview.co.uk/cr-blog/2009/august1/subscribers-check-the-packaging\">Creative Review</a></p>\n",
  "pageExcerpt": "Creative Review unleashes some experimental packaging for their latest magazine. More exciting than a brown envelope.\n“CR subscribers will notice something unusual about their CR package this month when it arrives on their doormats”\n\n\nI certainly did, it arrived in several pieces on my doormat.\nApparently this is Creative Review’s attempt to provide a filing system for their […]",
  "pageTitle": "Creative Packaging – David Bushell – Web Design (UK)"
}