{
  "dateUnix": 1277929259000,
  "dateFormatted": "Wednesday 30 Jun 2010",
  "pageHeading": "Using SVG Logos",
  "pagePath": "/2010/06/30/using-svg-logos/",
  "innerHTML": "<p><em><strong><em>Update</em></strong> 1th November 2011: <a href=\"/2011/11/11/the-good-the-bad-and-the-logo/\">The Good, the Bad, and the Logo</a></em></p>\n<p>If you visited this website recently you may have noticed the new logo/emblem that adorns the top centre of the design. For the last few days that logo was simply a <em>PNG</em> image. Well this evening <strong>I asked myself why?</strong> It’s obviously been designed as a vector graphic.</p>\n<p>So that is what I made. I saved the logo as an <em>SVG</em> file from Adobe Illustrator and embedded that instead of a raster image. The file is around 20kb at its smallest (see problem below) which I can handle because it looks <em>super sweet</em> on my iPhone 3GS when I zoom in. Just think how it’ll look on the iPhone 4’s Retina display! Maybe I’ll do some browser testing in the Apple store, I got kicked out for that last time…</p>\n<h3 id=\"a-small-problem-with-objects\">A small problem with objects</h3>\n<p>I’ve embedding an external <em>SVG</em> file using the <code>&lt;object&gt;</code> tag with my original <em>PNG</em> image as a fallback (I hope this works in Internet Explorer! will test tomorrow). The problem with this technique is that I don’t think it’s possible to have a transparent background – it defaults to a white square. The simple solution I found was to embed a background image within the <em>SVG</em> file. It works perfectly but doubles the file size.</p>\n<p>If anyone knows a better solution let me know!</p>\n<p>The other issue I came across was keeping the link back to my home page. Even with a jQuery click function the object tag doesn’t want to behave. I’m happy to let that go on this website, but with a more traditional top-left logo I’m not so sure.</p>\n<h3 id=\"browser-compatibility\">Browser compatibility</h3>\n<p>Someone correct me if I’m wrong but this technique seems pretty fail safe to me as it just falls back to the <em>PNG</em> if there’s no <em>SVG</em> support. And I’m well aware that this website requires a modern browser to actually render properly at all, that’s the beauty of being my own client!</p>\n<p>And if you’re wondering why I spent my evening obsessed with vectorising my website, see this article by Aral Balkan: “<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://aralbalkan.com/3331\">How to make your web content look stunning on the iPhone 4’s new Retina display</a>“ I found via twitter.</p>\n",
  "pageExcerpt": "Update 1th November 2011: The Good, the Bad, and the Logo\nIf you visited this website recently you may have noticed the new logo/emblem that adorns the top centre of the design. For the last few days that logo was simply a PNG image. Well this evening I asked myself why? It’s obviously been designed as […]",
  "pageTitle": "Using SVG Logos – David Bushell – Web Design (UK)"
}