{
  "pagePath": "/blog/page/16/",
  "pageHeading": "Blog (page 16)",
  "excerpts": [
    {
      "id": "vector-graphics-retina-and-you",
      "title": "Vector graphics, Retina, and You",
      "href": "/2012/07/13/vector-graphics-retina-and-you/",
      "body": "It’s Friday 13th. It’s been a long and productive week, I’ll try to keep this light-hearted :)\nI’m going to use this post to combine two rants. One on the use of the word “Retina”, another on live conference tweeting. I saw this retweeted the other day:\n“I think CSS is our best vector-based drawing tool in […]",
      "date": 1342178920000
    },
    {
      "id": "on-the-tools-of-our-trade",
      "title": "On the tools of our trade",
      "href": "/2012/07/11/on-the-tools-of-our-trade/",
      "body": "This year I’ve been making a conscious effort to change my tune when discussing particular methodologies and tools used in our fine art of website making.\nWhen we launched Passenger Focus at Browser I wrote “A Responsive Design Case Study” and for me it’s the best article I’ve ever written on this blog. I present my […]",
      "date": 1342004458000
    },
    {
      "id": "jquery-2-0-goodbye-old-ie",
      "title": "jQuery 2.0, “Goodbye Old IE”",
      "href": "/2012/06/29/jquery-2-0-goodbye-old-ie/",
      "body": "jQuery 2.0, expected release “early 2013”, will drop support for Internet Explorer 6–8.\njQuery was conceived specifically to address the differences in browsers, so we’re not going to abandon the essence of our philosophy and simply disregard the millions of active Internet users who (for whatever reasons) still use oldIE. Yet we also want to move […]",
      "date": 1340957971000
    },
    {
      "id": "passenger-focus-responsive-web-design-case-study",
      "title": "A Responsive Design Case Study",
      "href": "/2012/06/17/passenger-focus-responsive-web-design-case-study/",
      "body": "The many-device Web we use today has unearthed new design methodologies.\nDesigning one website for 3.5”–30” screens and everything between and beyond is a tricky challenge. The Web is like any other medium; it has limitations. You wouldn’t try to print a super thin font or full-colour photography on uncoated newspaper stock and expect high fidelity. […]",
      "date": 1339958569000
    },
    {
      "id": "nestable-jquery-plugin",
      "title": "Nestable jQuery Plugin",
      "href": "/2012/06/17/nestable-jquery-plugin/",
      "body": "I’ve started writing a jQuery plugin called Nestable — try it out.\nNestable is an interactive hierarchical list. You can drag and drop to rearrange the order. It even works well on touch-screens. If you’re familiar with the way WordPress allows the user to manage menus, this will be used for a similar UI.\n\n\nThe only similar […]",
      "date": 1339936744000
    },
    {
      "id": "featured-in-javascript-weekly",
      "title": "Featured",
      "href": "/2012/06/08/featured-in-javascript-weekly/",
      "body": "If you’re a website developer, subscriptions to the JavaScript Weekly and HTML5 Weekly newsletters are mandatory. Even in the days of Twitter they’re a goldmine of knowledge.\nAs it happens, my Socialite.js project makes an appearance in Issue #82! My praise of these newsletters is in no way disingenuous; it really is an honour (albeit a […]",
      "date": 1339159514000
    },
    {
      "id": "search-responsive-design",
      "title": "Search & Responsive Design",
      "href": "/2012/06/06/search-responsive-design/",
      "body": "As a Websitemaker the only thing you need to know about search engines (Google) is that they rank quality and relevance. Not the density of keywords, not the number of inbound links, certainly not the colour of your hat.\nApplying an “SEO” perspective to your website is one more obfuscated step between you and your users. […]",
      "date": 1339015294000
    }
  ],
  "nextPage": "/blog/page/17/",
  "prevPage": "/blog/page/15/",
  "pageTitle": "Blog (page 16) – David Bushell – Web Design (UK)"
}