{
  "pagePath": "/blog/page/16/",
  "pageHeading": "Blog (page 16)",
  "excerpts": [
    {
      "id": "responsive-day-out",
      "title": "Responsive Day Out",
      "href": "/2012/12/07/responsive-day-out/",
      "body": "I’ll be speaking at the Responsive Day Out conference in Brighton, 1st March 2013. Grab a ticket now because at £50+VAT they’ll be sold out very soon! And they’re gone!\n\nJeremy Keith explains more on his blog.\n\nIt’s a kind of conference, I guess, but I think of it as more like a gathering of like-minded people getting together to share […]",
      "date": 1354870355000
    },
    {
      "id": "the-mobile-book",
      "title": "The Mobile Book",
      "href": "/2012/12/05/the-mobile-book/",
      "body": "Smashing Magazine’s The Mobile Book is due for dispatch soon. Having had the opportunity to read it I’ll cut to the chase for those deliberating a purchase: it’s well worth the cover price. The e-book edition is a steal!\n\nLet it be known that this book goes beyond designing for the Web. The core themes are mobile […]",
      "date": 1354711297000
    },
    {
      "id": "responsive-bases-vertical-spaces",
      "title": "Responsive Bases & Vertical Spaces",
      "href": "/2012/11/19/responsive-bases-vertical-spaces/",
      "body": "Build a responsive design and you’ll find yourself knee deep in relative units and percentage widths. Media queries are the weapon of choice to adjust CSS on viewport change. Almost every example I’ve seen (and made) are based exclusively on the viewport width.\nWhat about height?\nThe Baseline Grid\nAs an exercise in ‘perfection’ when I last updated my […]",
      "date": 1353347128000
    },
    {
      "id": "design-books-for-sale",
      "title": "Design Books for Sale",
      "href": "/2012/10/29/design-books-for-sale/",
      "body": "Based in the UK? Like design, books, design books, book design?\nI’ve got just what you need. I’m selling a few of my design books. These are all top notch and have served me well (some since the uni days). Today I’m all digital and sadly have no room for a physical book collection. I want to see […]",
      "date": 1351547745000
    },
    {
      "id": "the-real-cost-of-retina",
      "title": "The Real Cost of Retina",
      "href": "/2012/10/23/the-real-cost-of-retina/",
      "body": "When the new iPad went on sale earlier this year the interest in high-resolution website design skyrocketed. We saw an influx of half-baked “Retina“ solutions.\nAlongside this the bigger picture — so to speak — of responsive images produced lengthy debate. We’re starting to see the fruits of that labour with a new picture element proposal. This is a good […]",
      "date": 1350997494000
    },
    {
      "id": "pikaday-javascript-datepicker",
      "title": "Pikaday: JavaScript datepicker",
      "href": "/2012/10/09/pikaday-javascript-datepicker/",
      "body": "Pikaday is a JavaScript datepicker with a light footprint and easy style-ability with modular CSS. It’s in ‘developer preview mode’ but already looking great:\n\nWhy now?\nBecause as much as we like open standards, the HTML5 input types lack browser support and are poorly implemented in places; see Chrome (22 as of writing) below:\n\nThis leaves us with a tricky […]",
      "date": 1349769790000
    },
    {
      "id": "groundhog-day",
      "title": "Groundhog Day",
      "href": "/2012/09/30/groundhog-day/",
      "body": "“ahhhhhh!”\n— is what I tweeted on this fine Sunday evening. (And some people choose not to follow me?) What provoked this dramatic outburst was every designers’ worst nightmare; a sudden urge to “redesign” their website.\nJune 2009, August 2009, June 2010, May 2011, February 2012. At this point the cycle is hardly a surprise and I guess I should […]",
      "date": 1349042155000
    }
  ],
  "nextPage": "/blog/page/17/",
  "prevPage": "/blog/page/15/",
  "pageTitle": "Blog (page 16) – David Bushell – Web Design (UK)"
}