{
  "dateUnix": 1426675859000,
  "dateFormatted": "Wednesday 18 Mar 2015",
  "pageHeading": "Responsive Design for Houden",
  "pagePath": "/2015/03/18/responsive-design-for-houden/",
  "innerHTML": "<p><strong>Houden is an e-ccomerce store, soon to launch with stylish bags and accessories for laptops, tablets, and cameras.</strong></p>\n<p>I was hired to improve aspects of the design and user experience with the help of new brand guidelines and a base template already under development at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.shopify.com/\">Shopify</a>. Below is a preview of the design and code I’ve been working on.</p>\n<h2 id=\"design-in-codepen\">Design in CodePen</h2>\n<p>My first task was to update the header / navigation, and design a responsive hero unit. This would need to support multiple layouts. I decided on a new approach for me, using <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://codepen.io/\">CodePen</a> as a tool for live, in-browser designing.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2015/03/houden-hero-codepen-dev.png\" alt=\"Houden hero unit designed in CodePen\"></p>\n<p>The client provided access to their code repository, along with an <a href=\"/2013/03/12/automation/\">automated</a> workflow to push CSS and Liquid template changes to the development server.</p>\n<p>Even with an automated process there is some friction uploading to a remote environment. By using CodePen I could eliminate this delay while still allowing my client to see immediate progress. I was able to design rapidly, and once happy with the direction, it was a simple task of copying the code back into the templates.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2015/03/houden-hero-alt.png\" alt=\"Houden hero unit (alternate designs)\"></p>\n<p>One simple but immensely useful feature of CodePen is the ability to fork (duplicate) pens and continue editing. This allowed me to play around with different concepts while leaving behind a nice design history. This isn’t so easy when working with local files — occasionally I’ll branch of in Git and tag key milestones, but often I won’t bother if I’m “in the zone” designing.</p>\n<p>Like any tool, CodePen isn’t going to design or code for you, but like a good night’s sleep or a strong cup of coffee, I found the experience very conducive to good work.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2015/03/houden-product-features.png\" alt=\"Houden product features\"></p>\n<p>Throughout my work with Houden I utilised CodePen whenever design required some experimentation. Other times, I would make small tweaks using Chrome’s developer tools, before committing them to the CSS source.</p>\n<p>As always the methods change to use what is most effective for ideation with the client.</p>\n<p>Be sure to check back when the website is open for business!</p>\n",
  "pageExcerpt": "Houden is an e-ccomerce store, soon to launch with stylish bags and accessories for laptops, tablets, and cameras.\nI was hired to improve aspects of the design and user experience with the help of new brand guidelines and a base template already under development at Shopify. Below is a preview of the design and code I’ve been working […]",
  "pageUndated": true,
  "pageTitle": "Responsive Design for Houden – David Bushell – Web Design (UK)"
}