{
  "dateUnix": 1296762806000,
  "dateFormatted": "Thursday 3 Feb 2011",
  "pageHeading": "On doing what you do best",
  "pagePath": "/2011/02/03/on-doing-what-you-do-best/",
  "innerHTML": "<p>Today I’m exceedingly happy :-D</p>\n<p>My article <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.smashingmagazine.com/2011/02/03/bringing-interactivity-to-your-website-with-web-standards/\"><em>Bringing Interactivity To Your Website With Web Standards</em></a> has just been published on <strong>Smashing Magazine,</strong> the biggest web design blog there is. I’m also half way through writing my second article. (Despite being immensely tired from slogging out up to 14 hours of work daily over the last fortnight – ouch!)</p>\n<p>I have a big smile on my face knowing the efforts I’ve made in blogging have been rewarded with such an honour.</p>\n<p>I’ve wrote about <a href=\"/2010/07/12/on-design-blogging/\">why I blog</a> before (it’s not all self promotion!) but I never said how motivating it is for me. It is, and so are all the other projects and interests I work on. My main job in web design is just one of these interests. To explain, allow me to go back to the beginning…</p>\n<p>I fall into perhaps one of the last generations to remember a technology free childhood in the UK. To think that I didn’t learn from a computer until late in my education, and iPhone’s were science fiction. Some kids aspired to be Doctors, Astronauts and Firemen, but I could never have aspired to be a Web Designer because it didn’t exist.</p>\n<p>If I had aspirations, they lied in arts &amp; crafts and language.</p>\n<p>I wrote my first line of HTML three years before I set my career path towards being a Graphic Designer, and over 10 years before I would eventually commit to a career in Website Design. With hindsight it was always inevitable but at the time I had no idea where my future would take me.</p>\n<p><strong>I was simply following interests.</strong></p>\n<p>When I was younger I was often berated about lack of tangible goals in life. What teachers could never understand and what I could never articulate was that following my interests <em>was</em> my goal. I didn’t care about which pencils I’d be qualified to push. Who would?</p>\n<p>I believe that unless you follow what you’re interested in, you’ll never be happy in life.</p>\n<p>Today I’m exceedingly happy :-D</p>\n",
  "pageExcerpt": "Today I’m exceedingly happy :-D\nMy article Bringing Interactivity To Your Website With Web Standards has just been published on Smashing Magazine, the biggest web design blog there is. I’m also half way through writing my second article. (Despite being immensely tired from slogging out up to 14 hours of work daily over the last fortnight – ouch!)\nI […]",
  "pageTitle": "On doing what you do best – David Bushell – Web Design (UK)"
}