{
  "pagePath": "/blog/page/13/",
  "pageHeading": "Blog (page 13)",
  "excerpts": [
    {
      "id": "macaque-a-new-project",
      "title": "Macaque: A New Project",
      "href": "/2013/04/07/macaque-a-new-project/",
      "body": "Today I started a new project. Macaque will be a personal to-do or list app. Sounds simple, right? Unlike my other side projects I’m coding and designing in public from day one.\nThis project exists because:\n\nI want to learn more Node and Ember\nI’ve failed to find a list app I like (oh lord, please don’t suggest one)\nI’d like to […]",
      "date": 1365370539000
    },
    {
      "id": "the-flat-build-2",
      "title": "The Flat Build (2)",
      "href": "/2013/04/05/the-flat-build-2/",
      "body": "My article The Flat Build was a slow burner but it has picked up steam recently and for the first time in like, forever, I’m building a pre-designed* website without having design influence. This has proven to be a good opportunity to refine and expand upon my flat build workflow (again).\nI’m aware I’m reinventing more than […]",
      "date": 1365157578000
    },
    {
      "id": "on-responsive-layout-and-grids",
      "title": "On Responsive Layout and Grids",
      "href": "/2013/03/19/on-responsive-layout-and-grids/",
      "body": "I often get asked which responsive grid system I use. This is a very frustrating question because it implies a requirement where I have none. With the myriad solutions presented I can’t blame people for thinking they have a choice to make.\nThis article is my response to that question.\nAnatomy of a grid system\nResponsive grid systems […]",
      "date": 1363692826000
    },
    {
      "id": "the-flat-build",
      "title": "The Flat Build",
      "href": "/2013/03/18/the-flat-build/",
      "body": "The flat build is the process of coding a static website in HTML &amp; CSS without worrying about complete functionality or CMS integration. UI prototypes, responsive design layouts, or even the initial stages of final front-end development.\nIt’s becoming increasingly apparent that merging the design and dev process in an iterative workflow is key to a […]",
      "date": 1363603561000
    },
    {
      "id": "automation",
      "title": "Automation",
      "href": "/2013/03/12/automation/",
      "body": "I used to believe hand-crafting every line of code was a necessity. I u-turned on that opinion and adopted CSS preprocessors with much gusto last year.\nIt wasn’t so much the syntactical learning curve that initially put me off — they’re familiar if you’ve done any kind of programming — it was the perceived “added complexity” they […]",
      "date": 1363112796000
    },
    {
      "id": "a-responsive-day-out",
      "title": "A Responsive Day Out",
      "href": "/2013/03/03/a-responsive-day-out/",
      "body": "\nMe on stage with Jeremy Keith, Tom Maslen, and Sarah Parmenter. Photos by Laura Kalbag and Marc Thiele.\nOn Friday 1st March, I spoke at Responsive Day Out in Brighton. Videos at Besquare, Audio of all talks is available and you can click along to my slides too.\nWhat a wonderful day! When Jeremy asked me to speak last year, March seemed eons away. I’ve never spoken […]",
      "date": 1362319748000
    },
    {
      "id": "bring-back-the-sitemap",
      "title": "Bring Back the Sitemap?",
      "href": "/2013/02/21/bring-back-the-sitemap/",
      "body": "I’m doing a small segment on navigation at Responsive Day Out (1st March). It’s an area of responsive design I enjoy experimenting with.\nYou’re probably familiar with responsive patterns that transform a traditional menu into something mobile-friendly. Combinations thereof cover most scenarios. If nothing suffices it might be more apt to focus on information architecture before attacking code again.\nTable of contents\nFor small viewports […]",
      "date": 1361455114000
    }
  ],
  "nextPage": "/blog/page/14/",
  "prevPage": "/blog/page/12/",
  "pageTitle": "Blog (page 13) – David Bushell – Web Design (UK)"
}