{
  "dateUnix": 1456740000000,
  "dateFormatted": "Monday 29 Feb 2016",
  "pageHeading": "A Bit of a New Look",
  "pagePath": "/2016/02/29/a-bit-of-a-new-look/",
  "innerHTML": "<p class=\"p--large\">I redesigned my website!</p>\n\n<p>This iteration has taken longer than usual because the visual changes are much more dramatic. I’m really pleased with the results:</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/dbushell-v8-intro.png\" alt=\"dbushell.com design circa 2016\"></p>\n\n<p>It’s been two years since I last updated the design. That is a record because it’s usually an annual tradition. Past updates include: <a href=\"/2014/04/21/spring-refresh/\">2014</a>, <a href=\"/2013/02/04/a-new-home/\">2013</a>, <a href=\"/2012/02/27/spring-cleaning-redesigning-dbushell-com/\">2012</a>, and <a href=\"/2011/05/25/designing-a-new-me/\">2011</a>. Last year I improved <a href=\"/2015/02/19/critical-css-and-performance/\">performance</a> and <a href=\"/2015/05/11/wordpress-to-metalsmith/\">deployment</a>.</p>\n<h2 id=\"business-priorities\">Business priorities</h2>\n<p>While I loved the simplicity of my previous homepage, it wasn’t selling me as a business. It made for a wonderful portfolio cover but nowadays I need to convert passersby into paying clients. That means content (and sparkles).</p>\n<p>I’m in the process of rewriting <a href=\"/services/\">my services</a> page and I’ve introduced two new pages speaking directly to <a href=\"/working-with-clients/\">clients</a> and <a href=\"/working-with-agencies/\">web agencies</a>. The content is, as always, a work in progress.</p>\n<h2 id=\"design-inspiration\">Design inspiration</h2>\n<p>The retro style emerged from the small “For Hire” sign I created for my sidebar/footer last year. It was well received but a few people noted it could be mistaken for an ad because it didn’t fit into my design. Too nice to consider removing, I realised it was the ideal starting point to inject more colour and personality into my website.</p>\n<p class=\"b-post__image\"><img src=\"/assets/img/dbushell-for-hire.svg\" alt=\"dbushell.com brand colours\"></p>\n\n<p>I spent a long time adjusting the colours to discover the perfect palette:</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/dbushell-v8-colours.svg\" alt=\"dbushell.com brand colours\"></p>\n\n<p>And from here I experimented with typography. I wasn’t sure how the script/hand-written style would translate online. It’s tricky because such a variety in weights doesn’t suit the web. Web fonts are heavy; a big performance cost. Ultimately I knew this style wouldn’t be viable to use for headings. I settled on a simple sans-serif, <a href=\"https://typekit.com/fonts/futura-pt\">Futura</a> being the natural choice.</p>\n<h2 id=\"responsive-navigation\">Responsive navigation</h2>\n<p>I’ve always been a fan of off-canvas navigation but I was concerned my previous version was a little too hidden. Is a link unseen a link unclicked? I’ll put that hypothesis to the test. My new design has a fixed header with an overflow menu that prioritises key pages.</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/dbushell-v8-nav.gif\" alt=\"dbushell.com responsive navigation\"></p>\n\n<h2 id=\"the-build\">The build</h2>\n<p>I was short on time to complete this project (if I ever wanted to ship something). Rather than building from scratch I decided to use my existing CSS as a foundation. Things have gotten a little messy because I didn’t have a clear vision for the design initially. My front-end optimisation has regressed but after launch I’ll tighten up the bolts.</p>\n<p>Previous incarnations of my website have had ridiculously good support for legacy browsers. Unnecessarily so, but I’ve always seen it as an exercise in “best practice”. When building from the ground up, progressive enhancement makes such support a natural by-product, for the most part! Retrofitting on the other hand isn’t so simple and requires more dedicated testing. In the interest of my own sanity I’ve abandoned old IE. No one would have noticed, I know my analytics, but it still feels a shame to lose that backwards compatibility. That said, it’s still looking good in IE9!</p>\n<h2 id=\"just-because-i-can\">Just because I can</h2>\n<p>My <a href=\"/2014/04/24/two-week-build/#typography\">old typography</a> used CSS gradients and text shadows to create custom link underlines. I’ve taken this one step further:</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/dbushell-v8-links.gif\" alt=\"dbushell.com link hover effect\"></p>\n\n<p>Yeah I know, the animations are overkill, but so many websites these days don’t even underline links. It’s a bit of fun for now.</p>\n<p>What do you think? Like my new website? Let me know on Twitter <a href=\"https://twitter.com/dbushell\">@dbushell</a>.</p>\n",
  "pageExcerpt": "I redesigned my website!\n\nThis iteration has taken longer than usual because the visual changes are much more dramatic. I’m really pleased with the results:\n\n\nIt’s been two years since I last updated the design. That is a record because it’s usually an annual tradition. Past updates include: 2014, 2013, 2012, and 2011. Last year I improved […]",
  "pageTitle": "A Bit of a New Look – David Bushell – Web Design (UK)"
}