{
  "dateUnix": 1308400740000,
  "dateFormatted": "Saturday 18 Jun 2011",
  "pageHeading": "Ampersand Conference",
  "pagePath": "/2011/06/18/ampersand-conference-ampconf/",
  "innerHTML": "<p>Yesterday I braved the “adverse weather conditions” to attend <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.ampersandconf.com/\">Ampersand</a>, the web typography conference in <strong>Brighton</strong>. My expectations were undecided.</p>\n<p>I knew I didn’t want to see a show &amp; tell, nor basic print typography knowledge presented as a new web-revelation (neither is it new, nor new to the web). Thankfully I was rewarded with an historical, technical and above all expertly analytical, <em>mature</em> look at digital typography.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/06/ampersand1.jpg\" alt=\"Brighton Pier\"></p>\n<p class=\"p--small u-dim\">Brighton, 17th June 2011. This photo may have been manipulated using Adobe® Photoshop® software.</p>\n<p>To my joy this conference wasn’t about <em>designing</em> with type. It had more of a “where are we now?” flavour to it. The talks put digital typography into perspective, with strong pride in how we’ve got this far, and clear direction towards an exciting future.</p>\n<h2 id=\"true-craftsmanship\">True Craftsmanship</h2>\n<p>Both <strong>Jonathan Hoefler</strong> and <strong>David Berlow</strong> took us on journeys of experience and dedication to the craft. They earned much respect for the difficulty involved in font creation. The time and skill needed is second to none in the design world. It makes the (generally acceptable) practices in website design look like a dogs dinner in comparison. Which, incidentally, is how I looked after venturing to the end of Brighton peer (photo evidence above).</p>\n<p>The number of glyphs in <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.typography.com/fonts/font_overview.php?productLineID=100008\">H&amp;FJ’s Gotham</a> typeface is staggering. The number of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Font_hinting\">hints</a>—in the region of 90 million if I remember correctly—is mind blowing. The announcement that almost 100% of <strong>H&amp;FJ</strong> fonts will available as web fonts led to rapturous applause. Considering the perfectionism expressed in Jonathan’s build up, we can assume that these fonts are truly <em>ready</em> for digital use.</p>\n<p>A few weeks ago I wrote about <a href=\"/2011/06/05/hey-i-was-reading-that/\">the poor state of web fonts</a>; rendering and screen limitations are tearing them apart. At the conference <strong>Vincent Connare</strong> (of <em>Comic Sans</em> fame) explained that most fonts have their place, it’s the poor use and design decisions that ruin them. Despite all efforts I have a feeling we’re going to see <em>Gotham Thin</em> set at 11px in the near future. But hey, there’s always going to be some poor practitioners.</p>\n<p>As web designers we have the benefit that good typographic design existed long before the machines that introduced our canvas. We must be careful and not ignorant of the differences while technology lags.</p>\n<h2 id=\"on-the-day\">On the Day</h2>\n<p>The speakers gave an excellent show.</p>\n<p>Their combined experience and knowledge left very few areas of digital type unexplored. The location had grandeur and decent acoustics but the leg room left me feeling like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.imdb.com/title/tt0196229/quotes?qt=qt0375903\">Derek Zoolander</a> (“<em>What is this? A center for ants?</em>“). It was an uncomfortable experience, even for a sub-six-footer like me.</p>\n<p>Despite the weather and loss of leg circulation I had a good day. I left with great respect for those working on digital typography both in design and technical implementation. You guys make my job possible.</p>\n",
  "pageExcerpt": "Yesterday I braved the “adverse weather conditions” to attend Ampersand, the web typography conference in Brighton. My expectations were undecided.\nI knew I didn’t want to see a show &amp; tell, nor basic print typography knowledge presented as a new web-revelation (neither is it new, nor new to the web). Thankfully I was rewarded with an […]",
  "pageTitle": "Ampersand Conference – David Bushell – Web Design (UK)"
}