{
  "pagePath": "/blog/page/36/",
  "pageHeading": "Blog (page 36)",
  "excerpts": [
    {
      "id": "barcamp-london-in-review",
      "title": "Barcamp London in Review",
      "href": "/2009/10/26/barcamp-london-in-review/",
      "body": "BarCamp London 7 is a free-to-attend weekend unconference for designers, developers and geeks of all types.\nSounds like a fun weekend eh?\nI didn’t know anything about BarCamp until a week or so before but it sounded very interesting so I thought why not? My boss (Iain Scott) was also lucky enough to grab a ticket in […]",
      "date": 1256589264000
    },
    {
      "id": "typotheque-offer-web-licenses",
      "title": "Typotheque offer web licenses",
      "href": "/2009/10/20/typotheque-offer-web-licenses/",
      "body": "Good news everybody!\nThe Typotheque font foundry are now offering web licenses with a hosted service similar to Typekit (read my review on Typekit.)\n“The Typotheque Web Font Service enables you to use custom fonts in your website using the @font-face rule in CSS. Just add a line of code to your page and get it working […]",
      "date": 1256068254000
    },
    {
      "id": "search-design-heroes",
      "title": "Search Design Heroes",
      "href": "/2009/10/18/search-design-heroes/",
      "body": "If you visit Design Heroes you’ll notice an extra tab in the top menu called “Extras”. This page will include new and experimental features that are added as the site grows.\nThe latest feature is a keyword search. Design Heroes is normally browsed by selecting the tags (listed on the left-hand side) but I think a […]",
      "date": 1255881037000
    },
    {
      "id": "inspiration-archives",
      "title": "Inspiration Archives",
      "href": "/2009/10/13/inspiration-archives/",
      "body": "If you’re a designer, photographer, or any kind of artist you’ve probably been asked the question - where do you get your ideas from?\nIt’s often said that it takes a certain kind of person to become an artist. I believe creative people become interested in design at a very young age and because of that […]",
      "date": 1255436518000
    },
    {
      "id": "graphic-design-referenced",
      "title": "Graphic Design Referenced",
      "href": "/2009/10/11/graphic-design-referenced/",
      "body": "If you’ve never heard of Bryony Gomez-Palacio and Armin Vit they run the design network Under Construction and are responsible for one of my all time favourite design blogs, Brand New. So when I heard they were releasing a new book “Graphic Design Referenced“ I knew I would be buying it immediately.\nGraphic Design, Referenced is […]",
      "date": 1255273290000
    },
    {
      "id": "most-amazing-top-2",
      "title": "Most Amazing Top 2",
      "href": "/2009/10/07/most-amazing-top-2/",
      "body": "I’m subscribed to ~50-60 RSS feeds in Google Reader, most of them are design related. I also follow hundreds of design related people (and 1 meerkat) on Twitter. I like being up-to-date. I recently started the website Design Heroes so I could bookmark the best of the best. The rules for Design Heroes are decidedly […]",
      "date": 1254922134000
    },
    {
      "id": "introducing-design-heroes",
      "title": "Introducing Design Heroes",
      "href": "/2009/10/01/introducing-design-heroes/",
      "body": "Hero - he-ro [heer-oh] - noun, a man of distinguished courage or ability, admired for his brave deeds and noble qualities.\nI may be using the word loosely here - it’s certainly not just for men.\nI’ve created a new website called Design Heroes. For three reasons:\n\nI had the domain and wasn’t doing anything with it.\nI need […]",
      "date": 1254400790000
    }
  ],
  "nextPage": "/blog/page/37/",
  "prevPage": "/blog/page/35/",
  "pageTitle": "Blog (page 36) – David Bushell – Web Design (UK)"
}