{
  "pagePath": "/blog/page/36/",
  "pageHeading": "Blog (page 36)",
  "excerpts": [
    {
      "id": "frozen-and-flickr",
      "title": "Frozen and Flickr",
      "href": "/2010/01/02/frozen-and-flickr/",
      "body": "Around here it’s nearly zero and covered in snow. I decided to spend the day integrating Flickr.\n[photo was lost to time…]\nIf you take a look in the right-hand column of my blog (under Twitter) you should see two of my latest Flickr photos. I say “should” because I’m not 100 percent on the Flickr API […]",
      "date": 1262449786000
    },
    {
      "id": "tweets-and-tweaks",
      "title": "Tweets and Tweaks",
      "href": "/2009/12/31/tweets-and-tweaks/",
      "body": "The most depressing thing about being a web designer/developer is that you spend all day making websites for other people. Your own little corner of the Internet gets neglected and all spider-webby. The web is rapidly developing with new tricks, techniques and opportunities. Rather than redesigning my whole website (which you should rarely, if ever […]",
      "date": 1262267270000
    },
    {
      "id": "happy-new-year",
      "title": "Happy New Year!",
      "href": "/2009/12/20/happy-new-year/",
      "body": "I know, I’m a few weeks early with the cheer (but this blog will have more legs).\nI’ve spent the weekend wrapping Xmas gifts for the family. As a “creative” person I’ve always felt slightly guilty about my poor wrapping skills. Last year I stepped it up a notch and use a large black marker to […]",
      "date": 1261335516000
    },
    {
      "id": "dieter-rams-design",
      "title": "Dieter Rams Design (and Apple)",
      "href": "/2009/12/05/dieter-rams-design/",
      "body": "Friday night and I’m temporarily postponing my usual drinking routine to visit an art/design exhibition at London’s Design Museum.\nAt least I thought so (they had beer there too). The main attraction was everyones favourite German industrial designer of the decade - Dieter Rams. He was the head designer at Braun between the 60s right up […]",
      "date": 1260022649000
    },
    {
      "id": "bring-on-2010",
      "title": "Bring on 2010!",
      "href": "/2009/11/23/bring-on-2010/",
      "body": "How can November be nearly over already?\nOne minute I’m writing a review on Dropbox and then the next minute (figuratively speaking) it’s almost 3 weeks later! Time flies when you’re absolutely rammed at work. That’s a good thing because Base Creative has some great design and development to showcase in the New Year. The bad […]",
      "date": 1258983470000
    },
    {
      "id": "dropbox",
      "title": "Dropbox",
      "href": "/2009/11/05/dropbox/",
      "body": "Dropbox is the hottest Internet service available to date (according to my very reliable and much trusted twitter feed).\nI’m generally very sceptical about anything modern that changes my routine so it’s taken me a while to give this one a go. Simply, Dropbox is:\n\n“software that syncs your files online and across your computers”\n\nI’m sure it’s […]",
      "date": 1257426742000
    },
    {
      "id": "barcamp-london-in-review",
      "title": "Barcamp London in Review",
      "href": "/2009/10/26/barcamp-london-in-review/",
      "body": "BarCamp London 7 is a free-to-attend weekend unconference for designers, developers and geeks of all types.\nSounds like a fun weekend eh?\nI didn’t know anything about BarCamp until a week or so before but it sounded very interesting so I thought why not? My boss (Iain Scott) was also lucky enough to grab a ticket in […]",
      "date": 1256589264000
    }
  ],
  "nextPage": "/blog/page/37/",
  "prevPage": "/blog/page/35/",
  "pageTitle": "Blog (page 36) – David Bushell – Web Design (UK)"
}