{
  "dateUnix": 1309520752000,
  "dateFormatted": "Friday 1 Jul 2011",
  "pageHeading": "Circle me (Google+)",
  "pagePath": "/2011/07/01/circle-me-google-plus/",
  "innerHTML": "<p>Have you seen <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://plus.google.com\">Google+</a>?</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/07/googleplus.png\" alt=\"Google+ - Copyright © Google\"></p>\n<p>Aside from making the name of their <em>“like button”</em> (Google+1) suddenly make <em>a lot</em> more sense, <strong>Google+</strong> seems to be a very intuitive mix between <strong>Twitter &amp; Facebook</strong>. And I <em>really</em> like it (or +1 it, I guess).</p>\n<p>For me Twitter is a broadcast and promotional tool, real conversation is very difficult. Facebook is just plain awful! It’s designed solely for friend &amp; family connections—that’s their excuse when privacy is mentioned—but people don’t use it that way. I think Google+ fixes everything that is unintuitive and poorly architectured on Facebook. They’ve figured out how people and social groups <em>connect</em>. That’s a bold statement for only a few hours of use but what the hell, it’s Friday.</p>\n<h2 id=\"the-future-\">The Future?</h2>\n<p>Google aren’t without their privacy upsets (remember the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://news.cnet.com/8301-31322_3-10451428-256.html\">Google Buzz nightmare</a>), and they’re very well versed in failed projects (Buzz, Wave, Video, Answers, TV…), so why would Google+ be any different? What I’m witnessing is people outside of the tech world actually excited about it. That’s a promising sign.</p>\n<p>Google have finally figured out <em>design</em>. From aesthetics through to interface and usability (for all devices) Google+ is a solid entity on the web. The fact that is works so intuitively is my primary signal for success.</p>\n<p>Google+ has arrived at a very pivotal moment in the Web’s history. We’re starting to understand the one-web, any-device reality that’s becoming part of our lives. Facebook is still pretty much stuck on the desktop. Twitter are buying up and piecing together outside ideas but not innovating themselves. Google are in a very good position to race ahead.</p>\n<p>If Google can’t challenge or kill Facebook then who can? <strong>Skype</strong>—with over 500 million users—has been suggested as the next competitor, but with Microsoft now at the helm, well, what more do I need to say?</p>\n<p>So <del>add me to a circle</del> and let’s hope the brand marketers don’t ruin everything!</p>\n<h4 id=\"update\"><em>Update</em></h4>\n<p>I can see content providers becoming eager for their readers to “+1” more so than “like”. Google is already personalising search results based on these recommendations. The metrics here would be far more measurable and direct. A search impression can be valued while a “like” is speculative; often wrapped in buzzword hype. That kind of promotion is bound to attract the masses.</p>\n",
  "pageExcerpt": "Have you seen Google+?\n\nAside from making the name of their “like button” (Google+1) suddenly make a lot more sense, Google+ seems to be a very intuitive mix between Twitter &amp; Facebook. And I really like it (or +1 it, I guess).\nFor me Twitter is a broadcast and promotional tool, real conversation is very difficult. Facebook […]",
  "pageTitle": "Circle me (Google+) – David Bushell – Web Design (UK)"
}