{
  "pagePath": "/blog/page/27/",
  "pageHeading": "Blog (page 27)",
  "excerpts": [
    {
      "id": "designing-a-new-me",
      "title": "Designing a new me",
      "href": "/2011/05/25/designing-a-new-me/",
      "body": "I often say that aesthetics are the least important part of a website design.\nContent and functionality are miles ahead of anything else. It’s obvious really, why would people visit unless you have some substance? They’re so important that design should focus on layout and architecture and only then should aesthetics be considered.\nIt’s refreshing!\nI’ve had dbushell.com online […]",
      "date": 1306318189000
    },
    {
      "id": "fowd-day-two-review",
      "title": "#FOWD Day Two Review",
      "href": "/2011/05/18/fowd-day-two-review/",
      "body": "I was a few minutes late today (apparently I didn’t have time for a tactical Maccy D’s bacon roll) which almost cost me dearly!\nA change in schedule meant Ethan Marcotte was up first with:\nResponsive Web Design\nThis was suppose to be the headline act. I think a lot of people who missed this morning (a lot […]",
      "date": 1305737155000
    },
    {
      "id": "fowd-day-one-review",
      "title": "#FOWD Day One Review",
      "href": "/2011/05/17/fowd-day-one-review/",
      "body": "This is my first year at Future of Web Design so I was unsure what to expect but secretly I knew it’d be pretty awesome. What a learning experience.\nBelow is a bit of a brain dump so I don’t forget, but I think everyone can benefit from these notes – the ideas were so strong they […]",
      "date": 1305657566000
    },
    {
      "id": "attending-fowd-2011",
      "title": "Attending FOWD 2011",
      "href": "/2011/05/15/attending-fowd-2011/",
      "body": "Only two days before this year’s Future of Web Design! I’m excited, thanks to the fine folks at Smashing Magazine I’ll be attending both seminar days. Say hello!\nI’m not a fan of the two track structure as I’ll have to miss some talks live (though I’ll be able to catch them online later). I’m going to skip […]",
      "date": 1305480240000
    },
    {
      "id": "the-responsive-design-secret",
      "title": "The Responsive Design Secret",
      "href": "/2011/05/11/the-responsive-design-secret/",
      "body": "Responsive website design - what technique should we use?\n…there’s the three fixed sizes approach - little (320px), medium (700px) and large (960px). There’s 100% fluid, 100% fluid with media queries for one or two stages smaller, or 100% fluid from 320 up. Or fluid with a min &amp; max-width. Fixed at 960 with a separate domain […]",
      "date": 1305137694000
    },
    {
      "id": "truly-great-websites-are-not-created-on-a-computer",
      "title": "Truly great websites are not created on a computer",
      "href": "/2011/05/05/truly-great-websites-are-not-created-on-a-computer/",
      "body": "There is a perception of the Website Designer busily working away, headphones on, brief in lap, mouse at hand, pushing pixels while striking a balance between their own artistic license and the client’s demands.\nThis couldn’t be further from the truth. Great websites are not created on a computer, and they’re certainly not designed by the […]",
      "date": 1304634799000
    },
    {
      "id": "why-ill-never-be-out-of-a-job",
      "title": "Why I’ll never be out of a job",
      "href": "/2011/05/03/why-ill-never-be-out-of-a-job/",
      "body": "The 15th Annual Webby Awards winners were announced today.\nNow, I’m not one to be cynical (and I’ve pledged to avoid negativity) but I’m completely perplexed at some of the design related choices. Many of the awards are purely content based which I’m not interested in, but this won Best Navigation/Structure:\n\n\nThe Webby Awards winner for Best […]",
      "date": 1304442473000
    }
  ],
  "nextPage": "/blog/page/28/",
  "prevPage": "/blog/page/26/",
  "pageTitle": "Blog (page 27) – David Bushell – Web Design (UK)"
}