{
  "pagePath": "/blog/page/27/",
  "pageHeading": "Blog (page 27)",
  "excerpts": [
    {
      "id": "why-ill-never-be-out-of-a-job",
      "title": "Why I’ll never be out of a job",
      "href": "/2011/05/03/why-ill-never-be-out-of-a-job/",
      "body": "The 15th Annual Webby Awards winners were announced today.\nNow, I’m not one to be cynical (and I’ve pledged to avoid negativity) but I’m completely perplexed at some of the design related choices. Many of the awards are purely content based which I’m not interested in, but this won Best Navigation/Structure:\n\nThe Webby Awards winner for Best […]",
      "date": 1304442473000
    },
    {
      "id": "design-and-enjoy-it",
      "title": "Design and enjoy it",
      "href": "/2011/04/24/design-and-enjoy-it/",
      "body": "I design websites all day which means I’m one click away from the design community.\nParticipation is rewarding but exposure can be difficult to control. On a good day it leads to inspiration that keeps me up at night in awe. Other times I’m left feeling like a mighty small fish. At worst I develop a […]",
      "date": 1303684794000
    },
    {
      "id": "simplicity-and-sexy-buttons-in-web-design",
      "title": "Simplicity and Sexy Buttons",
      "href": "/2011/04/18/simplicity-and-sexy-buttons-in-web-design/",
      "body": "I’ve mentioned simplicity a few times before but I thought I’d expand on this concept within web design as it’s such a fundamental part of my process.\nSimplicity in Aesthetics\nAlthough aesthetics are perhaps the least important aspect of website design they are initially the most noticeable, at least for demonstration purposes.\nLet’s consider four submit buttons:\n\nThe first […]",
      "date": 1303157548000
    },
    {
      "id": "seo-is-killing-website-design",
      "title": "SEO is Killing Website Design",
      "href": "/2011/04/12/seo-is-killing-website-design/",
      "body": "Misguided “Search Engine Optimisation” is the harbinger of a website disaster, and after the ‘sensationalist’ headline above, I’ll do my best to explain why.\nThe Logic of a Good Search Result\nWebsites should be optimised for search engines but you have to remember one important fact. Search engines care about delivering good results to their users. Users […]",
      "date": 1302636693000
    },
    {
      "id": "launching-xheight",
      "title": "Launching xheight",
      "href": "/2011/04/10/launching-xheight/",
      "body": "As most people know I don’t ‘do things by half’ and taking on ambitious projects is generally how I role these days. (Not Sunday though, I refused to take things serious on Sunday.)\nLast week I launched xheight.dbushell.com as a blog for many more designers than just myself to discuss the theory of design from experience […]",
      "date": 1302434964000
    },
    {
      "id": "three-months-in",
      "title": "Three Months In",
      "href": "/2011/03/28/three-months-in/",
      "body": "I find it hard to believe we’re already (ok, almost) in April.\n2011 in web design for me has kicked off with a BOOM! If I do say so myself. I’m no longer interested in just designing websites for clients and clients’ clients. I’m doing all that, and I’m pushing it further; looking for opportunities to […]",
      "date": 1301343043000
    },
    {
      "id": "designing-mylifelisted",
      "title": "Designing MyLifeListed",
      "href": "/2011/03/14/designing-mylifelisted/",
      "body": "Today I’m excited to see MyLifeListed launch!\nWe’ve been very busy at Base Creative designing &amp; developing the site. We’re glad to be part of such an exciting project. See for yourself:\n\nI’m going to write a more in-depth article on the design process of MyLifeListed but since this is probably my favourite design project to date, […]",
      "date": 1300139030000
    }
  ],
  "nextPage": "/blog/page/28/",
  "prevPage": "/blog/page/26/",
  "pageTitle": "Blog (page 27) – David Bushell – Web Design (UK)"
}