{
  "dateUnix": 1472724000000,
  "dateFormatted": "Thursday 1 Sep 2016",
  "pageHeading": "Colour Accessibility",
  "pagePath": "/2016/09/01/colour-accessibility/",
  "innerHTML": "<p>“Accessiblity” isn’t a scary word but many web folks shy away from it. Perhaps because the W3C guidelines are <em>a little</em> scary. The reality is <strong>website accessibility affects us all</strong>. Not just those of us who cross the threshold into a medically diagnosed condition.</p>\n<p><a href=\"https://chrome.google.com/webstore/detail/i-want-to-see-like-the-co/jebeedfnielkcjlcokhiobodkjjpbjia\">“I want to see like the colour blind”</a> is a Chrome plugin that adjusts a website on the fly. (Technically it applies an SVG <a href=\"https://developer.mozilla.org/en-US/docs/Web/SVG/Element/feColorMatrix\">colour matrix filter</a> to the entire page.) You may also like the plugin <a href=\"http://chromelens.xyz/\">ChromeLens</a> which provides even more functionality.</p>\n<p>I can see how my website might look with an absence of red perception:</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/colour-accessibility-dbushell.png\" alt=\"dbushell.com in protanopia and protanomaly modes\"></p>\n\n<p>In protanopia mode the contrast of my menu drops from <a href=\"http://leaverou.github.io/contrast-ratio/#white-on-%23ff6680\">2.8</a> to <a href=\"http://leaverou.github.io/contrast-ratio/#white-on-%23bdbb7a\">2</a> which isn’t ideal. I’m not going to change my brand colour because of this but in future I’ll avoid this combination for lengthier or more subtle text design. From this experiment I’ve learnt that contrast is a significant factor that is effected by colour blindness.</p>\n<h2 id=\"considerations\">Considerations</h2>\n<p>When I say <em>“website accessibility affects us all”</em>, I mean that there isn’t a hard cut-off that indicates a person will not benefit from design that is done with accessibility in mind.</p>\n<p>For example, if text contrast is not good enough for people with visual impairment, that suggests it is <strong>only just</strong> good enough for people without — and the line between those two groups is blurred (for lack of a better word). Whilst typing this blog post sunlight has started to stream through my window glaring off my monitor. This has rendered contrast lower and “good enough” for “normal eyes” is no longer cutting the mustard.</p>\n<p>I don’t profess to be the world’s foremost expert but I do know that treating website accessibility as a minority concern is entirely the wrong way to think about it.</p>\n",
  "pageExcerpt": "“Accessiblity” isn’t a scary word but many web folks shy away from it. Perhaps because the W3C guidelines are a little scary. The reality is website accessibility affects us all. Not just those of us who cross the threshold into a medically diagnosed condition.\n“I want to see like the colour blind” is a Chrome plugin […]",
  "pageTitle": "Colour Accessibility – David Bushell – Web Design (UK)"
}