{
  "pagePath": "/blog/page/22/",
  "pageHeading": "Blog (page 22)",
  "excerpts": [
    {
      "id": "resolution-independence",
      "title": "Resolution Independence!",
      "href": "/2012/01/16/resolution-independence/",
      "body": "One of my thoughts for Web Design: 2012 and Beyond concerned the issues of screen resolution and the necessity for scalable graphics on the web. As part of that thinking I’ve written a piece for Smashing Magazine entitled Resolution Independence with SVG:\n\nWhen we look at the breadth of Web-enabled devices, responsive design is sure to provide a better […]",
      "date": 1326741891000
    },
    {
      "id": "device-optimisation",
      "title": "Device Optimisation",
      "href": "/2012/01/11/device-optimisation/",
      "body": "Device optimisation is about accessing a website on one set up and fine-tuning the experience. It could be Internet Explorer 7 on a mediocre PC, the iPhone 4000, a generic and underpowered Android tablet, or a web-enabled HD 3D TV. Whatever the set up, ask: how can I make this one experience better?\nThe idea is […]",
      "date": 1326242026000
    },
    {
      "id": "responsive-tables-2",
      "title": "Responsive Tables (2)",
      "href": "/2012/01/05/responsive-tables-2/",
      "body": "\nNEW: CSS only Responsive Tables\nSee the link above for more recent developments.\n\n\nMy last article on responsive tables was very popular so I’ve only gone and implemented the idea that I was alluding to with horizontal scrolling!\n\nSee Responsive Tables Demo (2) — in a modern browser! Webkit browsers handle both tables perfectly. Firefox &amp; Opera handle the […]",
      "date": 1325793182000
    },
    {
      "id": "responsive-calendar-demo",
      "title": "Responsive Tables (and a calendar demo)",
      "href": "/2012/01/04/responsive-calendar-demo/",
      "body": "Update see more responsive tables progress (5th Jan).\nA real short post for future reference! I’m experimenting with a responsive calendar design and build. See my very rough responsive calendar demo.\nI’ve found through trial, error, and much pondering that the idea of a responsive calendar is actually not that complex. My demo needs more considered breakpoints and design tweaks but […]",
      "date": 1325721511000
    },
    {
      "id": "web-design-2012-and-beyond",
      "title": "Web Design: 2012 and Beyond",
      "href": "/2011/12/15/web-design-2012-and-beyond/",
      "body": "The year is ending, I guess it’s time to look forward?\n2011 has been the best year of my career so far. I left my previous job to join Browser, an unexpected but excellent move! I’ve been refining my front-end development skills and design process. Next year we’ll have big websites to launch that I plan to showcase here. […]",
      "date": 1323907873000
    },
    {
      "id": "socialite-js-preview",
      "title": "Socialite.js Preview",
      "href": "/2011/12/08/socialite-js-preview/",
      "body": "You’ve all seen social sharing buttons. Twitter’s “tweet”, Facebook’s “like” etc.\nHere’s a screenshot from a popular blog to refresh your memory:\n\nThey have their place on a website if used intelligently — that’s a big if! They’re difficult to design around and a nightmare for front-end development.\nThe copy-and-paste code for each button includes a default element and […]",
      "date": 1323350068000
    },
    {
      "id": "window-resize-in-javascript",
      "title": "Window Resize in JS",
      "href": "/2011/11/24/window-resize-in-javascript/",
      "body": "I will write a full article on responsive website design &amp; JavaScript soon, but for now here’s a quick snippet! (With a little help from jQuery, naturally.)\nvar resizeTimeout, win = $(window);\nwin.bind('resize', function()\n{\n    if (resizeTimeout) clearTimeout(resizeTimeout);\n    resizeTimeout = setTimeout(function()\n    {\n        […]",
      "date": 1322174153000
    }
  ],
  "nextPage": "/blog/page/23/",
  "prevPage": "/blog/page/21/",
  "pageTitle": "Blog (page 22) – David Bushell – Web Design (UK)"
}