{
  "dateUnix": 1339015294000,
  "dateFormatted": "Wednesday 6 Jun 2012",
  "pageHeading": "Search & Responsive Design",
  "pagePath": "/2012/06/06/search-responsive-design/",
  "innerHTML": "<p>As a <em>Websitemaker</em> the only thing you need to know about search engines (Google) is that they rank <strong>quality</strong> and <strong>relevance</strong>. Not the density of keywords, not the number of inbound links, certainly not the colour of your hat.</p>\n<p>Applying an “SEO” perspective to your website is one more obfuscated step between you and your users. Even if you manage to trick the algorithm for a while and your hits increase, <strong>hits are not conversions</strong>. Leave optimisation to competent developers. Focus on user experience, create compelling content, and don’t forget honest-to-god <em>advertising</em>.</p>\n<p>You can probably sense <a href=\"/2011/04/12/seo-is-killing-website-design/\">my dislike for SEO</a>. A recent — and quickly redacted (<a href=\"/images/2012/06/netmag.jpg\">screenshot here</a>) — article on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.netmagazine.com/\">.net magazine</a> pretty much sums up how pathetically delusional the SEO industry has become. (And yes, I believe the harsh criticism was very fair considering this was a thinly veiled piece of marketing in a professional journal.) No one should be surprised SEO businesses are struggling as search engines improve. If you read a <em>modern</em> SEO article today, they do exist, you would be forgiven for thinking such an author might actually have grasped the idea that real life users are the end point, not robots.</p>\n<p>I’m getting side tracked, and preaching to the choir I suspect.</p>\n<p>Optimising for search engines is just plain good, standards-based development. Ranking #1 is a reflection of quality and relevance. “SEO”, the brand, is a con artists game. If an “SEO” guru is ruining your project, no doubt their sage advice having appeared 2 weeks before launch, the best retaliation is further advice straight from the powers that be; Google.</p>\n<p>Today Google published an article on their <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://googlewebmastercentral.blogspot.co.uk/2012/06/recommendations-for-building-smartphone.html\">official webmaster blog</a> saying (emphasis mine):</p>\n<blockquote>\n<p>When building a website that targets smartphones, Google supports three different configurations: 1. Sites that use responsive web design, i.e. sites that serve all devices on the same set of URLs, with each URL serving the same HTML to all devices and using just CSS to change how the page is rendered on the device. <strong>This is Google’s recommended configuration</strong>. […]</p>\n</blockquote>\n<p>Responsive web design and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://bradfrostweb.com/blog/mobile/content-parity/\">content parity</a>.</p>\n<p>Clear affirmation of improving things for actual users. This is <em>very</em> important to us. If outside influencers — likely looking to justify a paycheck — are consulting on “best practice”, we can’t allow them to be wrong when their claims get bigger and bolder as they desperately seek new ideas.</p>\n<p>Guess what happens when a user clicks a search result and finds an <strong>accessible</strong> website containing what they were looking for? That website earns its rank. Ingenious, isn’t it?</p>\n",
  "pageExcerpt": "As a Websitemaker the only thing you need to know about search engines (Google) is that they rank quality and relevance. Not the density of keywords, not the number of inbound links, certainly not the colour of your hat.\nApplying an “SEO” perspective to your website is one more obfuscated step between you and your users. […]",
  "pageTitle": "Search & Responsive Design – David Bushell – Web Design (UK)"
}