{
  "dateUnix": 1253383302000,
  "dateFormatted": "Saturday 19 Sep 2009",
  "pageHeading": "Playing around with Typekit",
  "pagePath": "/2009/09/19/typekit/",
  "innerHTML": "<p>Typekit is an innovative subscription service that gives web designers access to a large collection of embeddable fonts.</p>\n<p>I was lucky enough to be invited to try out <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.typekit.com\">Typekit</a> which is pretty cool because it’s still “invitation only”. A subscription to Typekit gives you access to their growing font library for use on your websites. Fonts can be chosen through their slick web interface and applied to any HTML elements on your page. It’s user-friendly and doesn’t leave you hovering over a legal blackhole like using Cufon and sIFR.</p>\n<h3 id=\"using-typekit\">Using Typekit</h3>\n<p>Once you’ve signed up and created a new “Kit” for your website Typekit will give you 2 lines of HTML to paste into your <head>. That’s the hard part done. Now you just go to the Typekit website and browse the font catalogue, select the font you like, and specify the elements that will use this font (using the HTML tag, class, or id).</p>\n<p>Typekit is incredibly easy to use and the fact that their website is simple and well designed is a big plus. The number of fonts available at the moment is fairly small but ever expanding. It does take a few minutes to work through the system and update your page so it’s not good for designing on the fly. But if you’re designing like this it’s your own fault so go make a cup of tea or something.</p>\n<h3 id=\"under-the-hood\">Under the Hood</h3>\n<p>Typekit works by using JavaScript to manipulate the webpage’s CSS in your browser. It uses the CSS @font-face to reference the Typekit font. There is no DRM in the @font-face concept but Typekit has a few tricks up its sleeve. Namely Base64 encoding, and multiple files.</p>\n<p>Typekit <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://blog.typekit.com/2009/07/21/serving-and-protecting-fonts-on-the-web/\">admit themselves</a> that the original font can be extracted:</p>\n<blockquote>\n<p>“With enough knowledge of web technologies, it’s possible to circumvent each one of these steps. Many can be automated with scripts and command line tools. In aggregate, they provide enough of a barrier to discourage all but the most motivated.”</p>\n</blockquote>\n<p>But that doesn’t really matter because anything digital is going to inevitably get ripped off by someone anyway. You can’t stop people choosing the illegal path.</p>\n<p>Point is, this is a <em>legal</em> web service. We are at a time when @font-face is starting to see widespread implementation and the legality surrounding font licenses is cloudy at best. The alternative to @font-face of course is the old fashion replacement techniques like sIFR, Cufon, and the dreaded image replacement. Despite legality, there are so many reasons <strong>not</strong> to use these techniques that the average typography and web developer purist dies a little inside every time he/she use them.</p>\n<h3 id=\"the-cost-of-typekit\">The Cost of Typekit</h3>\n<p>It’s difficult to analyse the cost of a Typekit subscription as it’s likely to change before launch. Ultimately the depth of the font library will determine the true value. Font licenses can be hugely expensive so if the foundries offer them for the web through services like Typekit it may well be value for money. Typekit have done an excellent job setting up the service so I hope it succeeds.</p>\n<p>Figuratively speaking there are other costs involved too. To start, font embedding quickly racks up the calorie count. Fonts need a lot of data. In testing I found that by using 2 different fonts in 4 weights I added a whopping 267KB to the page download. That’s a very significant and noticeable weight. I try to keep my websites below 250KB including all resources and images.</p>\n<p>The second major issue is that you are relying on a 3rd party. If the Typekit servers are taken offline for maintenance or are loading slow due to traffic the best case scenario is that your website eventually loads with a fallback font like Arial.</p>\n<h3 id=\"final-thoughts\">Final Thoughts</h3>\n<p>Overall I like Typekit. The service works incredibly well, but more importantly the people behind Typekit are pushing forward typography on the web. It may not turn out to be the best solution but at least they’re not sitting on their thumbs. Hopefully we’ll see the big type foundries embrace the digital age and not try to sue everyone under the sun like the music industry did. If I were trying to draw a comparison from this I’d probably say something along the lines of “Typekit is trying to do for fonts what iTunes has done for music”.</p>\n<p>Actually, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.malarkey.co.uk/blog/about/why_typekit_will_change_everything/\">someone else</a> has already said that. I’ll have to think of another note to end on…</p>\n<p>..eh whatever, goodnight.</p>\n",
  "pageExcerpt": "Typekit is an innovative subscription service that gives web designers access to a large collection of embeddable fonts.\nI was lucky enough to be invited to try out Typekit which is pretty cool because it’s still “invitation only”. A subscription to Typekit gives you access to their growing font library for use on your websites. Fonts […]",
  "pageTitle": "Playing around with Typekit – David Bushell – Web Design (UK)"
}