{
  "pagePath": "/blog/page/3/",
  "pageHeading": "Blog (page 3)",
  "excerpts": [
    {
      "id": "raspberry-pi-epaper",
      "title": "Raspberry Pi + e-Paper module + Node.js",
      "href": "/2017/09/20/raspberry-pi-epaper/",
      "body": "A few weeks ago I was digging through storage and I found an original Raspberry Pi. When I’d bought it years ago interest was lost rather quickly. I wasn’t as comfortable with a Unix command line as I am today.\nThe Raspberry Pi / Arduino / single-board computer ecosystem has exploded since then. Maybe I can […]",
      "date": 1505901600000
    },
    {
      "id": "tifu-by-deleting-my-work",
      "title": "#TIFU by deleting my work",
      "href": "/2017/08/15/tifu-by-deleting-my-work/",
      "body": "Ever get that feeling you’ve lost something?\n\nI’ve long been a paying user of CodePen. It’s nice for sharing snippets, quick mock-ups, or messing around with code. CodePen Projects is a newish addition. It provides a more complete development environment.\nA mini-project came along for a client that gave me the perfect excuse to try CodePen Projects.\nDevelopment […]",
      "date": 1502791200000
    },
    {
      "id": "ssh-passphrases-in-macos-sierra",
      "title": "SSH Passphrases in MacOS Sierra (and learning Vim)",
      "href": "/2017/05/18/ssh-passphrases-in-macos-sierra/",
      "body": "Managing SSH keys for remote repositories ain’t easy to grok. “Multiple Accounts and SSH\nKeys” is to no\nsuprise one of my most popular articles. It’s\nstill relevant and I have to refer to it myself at least once a year.\nRecently MacOS began requesting my passphrase with every Git push and pull. That\nis not productive.\nThe solution is two […]",
      "date": 1495101600000
    },
    {
      "id": "typescript-instead-of-react-proptypes",
      "title": "TypeScript over React PropTypes",
      "href": "/2017/04/19/typescript-instead-of-react-proptypes/",
      "body": "React v15.5.0 is here and the React.PropTypes module gives a deprecation warning. Moving forward you’ll find it in it’s own package.\nI’ve always used React PropTypes because it seemed like the ‘right way’ to do things. Runtime validation has obvious value but in my experience there are three big negatives to it:\n\nPropTypes are tedious to write\nPropTypes […]",
      "date": 1492596000000
    },
    {
      "id": "the-magic-of-service-workers",
      "title": "The Magic of Service Workers",
      "href": "/2017/04/06/the-magic-of-service-workers/",
      "body": "They’re a thing. Google describes them as a “technical foundation”.\nWhat I’ve learnt is that a service worker is a JavaScript file. It runs in it’s own little world behind a website. That means it can’t access the DOM. What it can do is proxy network requests and access a storage cache.\nI’m sure they can do […]",
      "date": 1491472800000
    },
    {
      "id": "i-watched-iron-fist-and-coded-css",
      "title": "I watched Iron Fist and coded CSS 👈",
      "href": "/2017/04/03/i-watched-iron-fist-and-coded-css/",
      "body": "They have nothing in common.\nWell, aside from entertaining my weekend. I’m just bad at blog titles and I’m fed up of writing nonsense like “CSS modularity; theory and practice”. My draft title, which let’s face it, nobody is clicking.\nIron Fist is ‘aight I guess. I’m 7 episodes deep and I’m still awake which is an […]",
      "date": 1491213600000
    },
    {
      "id": "web-security-and-cloudflare",
      "title": "Web Security and Cloudflare",
      "href": "/2017/02/17/web-security-and-cloudflare/",
      "body": "I’ve never had to deal with SSL certificates before. That’s always been someone else’s responsibility. Being ignorant of the technical details, the idea of setting up SSL/TLS wrong scares me. The idea of my visitors seeing those browser warnings scares me even more. And they’re getting scarier by the year.\n\nI listened to an episode of […]",
      "date": 1487325600000
    }
  ],
  "nextPage": "/blog/page/4/",
  "prevPage": "/blog/page/2/",
  "pageTitle": "Blog (page 3) – David Bushell – Web Design (UK)"
}