{
  "dateUnix": 1264509543000,
  "dateFormatted": "Tuesday 26 Jan 2010",
  "pageHeading": "Week in Film",
  "pagePath": "/2010/01/26/week-in-film/",
  "innerHTML": "<p>So this arrived from the States today:</p>\n<p>[<em>photo was lost to time…</em>]</p>\n<p>Lemonade Movie (more info <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://lemonademovie.com/\">here</a>).</p>\n<p>It’s the feel-good movie of the recession, following 16 creative-types who were laid off and decided to embrace a life they were missing. Odd coincidence that the UK recession <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/business/8479639.stm\">died today</a>. The press will have to find another source of fear (still cold enough for the Snowpocalypse?).</p>\n<p>And speaking of the press - I saw another film last week,</p>\n<h3 id=\"typeface-film\">Typeface Film</h3>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://typeface.kartemquin.com\">Typeface</a> was premiering in London at the St Bride Library (on the 21st Jan). We were lucky enough to get tickets. It was a fly on the wall documentary following a group of old timers and a few young creatives clinging onto an old wood type factory/museum in rural America.</p>\n<blockquote>\n<p>“Typeface, Kartemquin’s latest documentary in progress, will bring this fascinating junction of historical and contemporary, as well as rural and urban America together for enjoyment and contemplation. This film will be of interest to art and graphic design enthusiasts, to teachers as an educational resource, and to anyone looking for a film about perseverance and preservation in the heart of America.”</p>\n</blockquote>\n<p>While entertaining I felt the film missed a much needed spark. Though saying that it did provide a lot to reflect on, but just not enough to go and adopt an old print house.</p>\n<p>Will watch Lemonade tonight.</p>\n",
  "pageExcerpt": "So this arrived from the States today:\n[photo was lost to time…]\nLemonade Movie (more info here).\nIt’s the feel-good movie of the recession, following 16 creative-types who were laid off and decided to embrace a life they were missing. Odd coincidence that the UK recession died today. The press will have to find another source of fear […]",
  "pageTitle": "Week in Film – David Bushell – Web Design (UK)"
}