{
  "pagePath": "/blog/page/24/",
  "pageHeading": "Blog (page 24)",
  "excerpts": [
    {
      "id": "socialite-js-preview",
      "title": "Socialite.js Preview",
      "href": "/2011/12/08/socialite-js-preview/",
      "body": "You’ve all seen social sharing buttons. Twitter’s “tweet”, Facebook’s “like” etc.\nHere’s a screenshot from a popular blog to refresh your memory:\n\nThey have their place on a website if used intelligently — that’s a big if! They’re difficult to design around and a nightmare for front-end development.\nThe copy-and-paste code for each button includes a default element and […]",
      "date": 1323350068000
    },
    {
      "id": "window-resize-in-javascript",
      "title": "Window Resize in JS",
      "href": "/2011/11/24/window-resize-in-javascript/",
      "body": "I will write a full article on responsive website design &amp; JavaScript soon, but for now here’s a quick snippet! (With a little help from jQuery, naturally.)\nvar resizeTimeout, win = $(window);\nwin.bind('resize', function()\n{\n    if (resizeTimeout) clearTimeout(resizeTimeout);\n    resizeTimeout = setTimeout(function()\n    {\n        […]",
      "date": 1322174153000
    },
    {
      "id": "reaction-time-2",
      "title": "Reaction Time (2)",
      "href": "/2011/11/16/reaction-time-2/",
      "body": "A few weeks ago I wrote Reaction Time explaining the art of relative interactivity.\nToday I found another perfect example!\nI’m using a technique based on Ariel Flesler’s excellent jQuery scrollTo plugin. The plugin scrolls the document until a specific element is in view. The set up: I have several tabs on my page that update content below […]",
      "date": 1321470806000
    },
    {
      "id": "looking-forward",
      "title": "Looking Forward",
      "href": "/2011/11/16/looking-forward/",
      "body": "Watch this TEDxSantaCruz talk by Roger McNamee published in July. He made five very compelling hypothesis around the future of the internet and the web.\n\n\n\nPlease ignore the irony of the above video if it happens to embed with Flash! YouTube promises HTML5 video in the future through the wonders of this iframe…\nWatch all 16 minutes, it’s well […]",
      "date": 1321403061000
    },
    {
      "id": "in-favour-of-semantics",
      "title": "In Favour of Semantics",
      "href": "/2011/11/11/in-favour-of-semantics/",
      "body": "The true value of a website is its content.\nData — until semantics and presentation turn it into information. If that value is true we can therefore infer that semantics reign supreme in front-end website production.\nThe thing is, not all content is created equally. There needs to be a pragmatic interpretation of how content is represented. For […]",
      "date": 1321053927000
    },
    {
      "id": "the-good-the-bad-and-the-logo",
      "title": "The Good, the Bad, and the Logo",
      "href": "/2011/11/11/the-good-the-bad-and-the-logo/",
      "body": "Back in June 2010 I wrote about using SVG for your logo. When I realigned my website earlier this year (see: Designing a new me) I reverted back to the typical PNG and used the -webkit-min-device-pixel-ratio to provide a high-res version.\nWell 17 months ago I wasn’t as sharp as I am today with front-end standards and for whatever […]",
      "date": 1321001916000
    },
    {
      "id": "hats",
      "title": "Hats",
      "href": "/2011/11/08/hats/",
      "body": "Some days I wear my perfectionist hat, other days I wear my pragmatist hat.\nI would much prefer to wear a MailChimp chimp hat but that’s neither here nor there. *\nWeb standards are not perfect as this month’s hilariously geeky &lt;time&gt; element debacle has reminded us. The practice and adoption of standards from both browsers and developers […]",
      "date": 1320796307000
    }
  ],
  "nextPage": "/blog/page/25/",
  "prevPage": "/blog/page/23/",
  "pageTitle": "Blog (page 24) – David Bushell – Web Design (UK)"
}