{
  "pagePath": "/blog/page/24/",
  "pageHeading": "Blog (page 24)",
  "excerpts": [
    {
      "id": "looking-forward",
      "title": "Looking Forward",
      "href": "/2011/11/16/looking-forward/",
      "body": "Watch this TEDxSantaCruz talk by Roger McNamee published in July. He made five very compelling hypothesis around the future of the internet and the web.\n\n\n\nPlease ignore the irony of the above video if it happens to embed with Flash! YouTube promises HTML5 video in the future through the wonders of this iframe…\nWatch all 16 minutes, it’s well […]",
      "date": 1321403061000
    },
    {
      "id": "in-favour-of-semantics",
      "title": "In Favour of Semantics",
      "href": "/2011/11/11/in-favour-of-semantics/",
      "body": "The true value of a website is its content.\nData — until semantics and presentation turn it into information. If that value is true we can therefore infer that semantics reign supreme in front-end website production.\nThe thing is, not all content is created equally. There needs to be a pragmatic interpretation of how content is represented. For […]",
      "date": 1321053927000
    },
    {
      "id": "the-good-the-bad-and-the-logo",
      "title": "The Good, the Bad, and the Logo",
      "href": "/2011/11/11/the-good-the-bad-and-the-logo/",
      "body": "Back in June 2010 I wrote about using SVG for your logo. When I realigned my website earlier this year (see: Designing a new me) I reverted back to the typical PNG and used the -webkit-min-device-pixel-ratio to provide a high-res version.\nWell 17 months ago I wasn’t as sharp as I am today with front-end standards and for whatever […]",
      "date": 1321001916000
    },
    {
      "id": "hats",
      "title": "Hats",
      "href": "/2011/11/08/hats/",
      "body": "Some days I wear my perfectionist hat, other days I wear my pragmatist hat.\nI would much prefer to wear a MailChimp chimp hat but that’s neither here nor there. *\nWeb standards are not perfect as this month’s hilariously geeky &lt;time&gt; element debacle has reminded us. The practice and adoption of standards from both browsers and developers […]",
      "date": 1320796307000
    },
    {
      "id": "learning-from-the-crazy-ones",
      "title": "Learning from the crazy ones",
      "href": "/2011/10/30/learning-from-the-crazy-ones/",
      "body": "I’ve been reading the Steve Jobs biography and a quote in the Jony Ive chapter (half way through the book) from Jobs really stood out:\n\n“In most people’s vocabularies, design means veneer, but to me, nothing could be further from the meaning of design. Design is the fundamental soul of a man-made creation that ends up expressing […]",
      "date": 1319972978000
    },
    {
      "id": "reaction-time",
      "title": "Reaction Time",
      "href": "/2011/10/25/reaction-time/",
      "body": "Last week I wrote about device optimisation which adds a much needed bit of pragmatism to the holy grail of timeless, device-agnostic website design.\nI touched on a technique that I’ll expand here because it can be used more generically. If you’re going for a responsive layout with interactive elements this makes a massive difference to UX.\nRelative […]",
      "date": 1319568205000
    },
    {
      "id": "the-thoughtful-touches",
      "title": "The Thoughtful Touches",
      "href": "/2011/10/18/the-thoughtful-touches/",
      "body": "I just finished building a website!\nI’m afraid it’s not live just yet but there are a few thoughts I’d like to share, so if you can get your imagination running I promise not to waste your time! (No refunds.)\nIt’s different than other websites I’ve built because it’s 90% photography — think fullscreen slideshows. While the […]",
      "date": 1318967962000
    }
  ],
  "nextPage": "/blog/page/25/",
  "prevPage": "/blog/page/23/",
  "pageTitle": "Blog (page 24) – David Bushell – Web Design (UK)"
}