{
  "pagePath": "/blog/page/33/",
  "pageHeading": "Blog (page 33)",
  "excerpts": [
    {
      "id": "its-all-over",
      "title": "It’s all over!",
      "href": "/2010/03/07/its-all-over/",
      "body": "I started the daily photo project back on the 1st January (obviously) with plans to take a photo every day until 2011. Things were going well, that is until day 61. About 12 minutes after midnight I realised in a state of panic/relief that Day 60 did not have a photo.\nIt’s surprising just how disappointing […]",
      "date": 1267961340000
    },
    {
      "id": "1000-cranes",
      "title": "1000 Cranes",
      "href": "/2010/02/18/1000-cranes/",
      "body": "A new project!\nThe other week I was indirectly reminded (via twitter, obviously) about a previous obsession with Origami. To satisfy a sudden resurging demand to fold everything in half I picked up a few sheets of origami paper - and that was that.\nWell today a package arrived from Hong Kong along with a horrifying flash-back […]",
      "date": 1266521182000
    },
    {
      "id": "olympus-e-p1",
      "title": "Olympus E-P1",
      "href": "/2010/02/14/olympus-e-p1/",
      "body": "Ever since I started the daily photo project I’ve been looking to buy a digital camera. The iPhone’s camera has been surprisingly good but it doesn’t hold up to serious goat photography (scroll down).\n\nMy choice came down to a toss up between the Olympus E-P1 (above) and the Panasonic Lumix GF1. Both use the new […]",
      "date": 1266164566000
    },
    {
      "id": "in-search-of-atlantis",
      "title": "In search of Atlantis",
      "href": "/2010/02/07/in-search-of-atlantis/",
      "body": "Every get that feeling you’re out of the loop? People know something you don’t?\nI’ve been in London for closer to 2 years now, so it was starting to get slightly embarrassing that the nearest arts superstore I could recommend was over 200 miles away. Thankfully I’d heard rumours that the east-end housed my answer (evidence […]",
      "date": 1265558354000
    },
    {
      "id": "first-thursday",
      "title": "First Thursday",
      "href": "/2010/02/04/first-thursday/",
      "body": "Man, this month has been hectic!\n\nWhen I’m not at work I’m busy trying to finish an in-depth article on the future of interactive design (featuring the iPad :-). The delay might be a good thing because there has been a some excellent articles on the subject in the past couple days so I’ll have a […]",
      "date": 1265323486000
    },
    {
      "id": "week-in-film",
      "title": "Week in Film",
      "href": "/2010/01/26/week-in-film/",
      "body": "So this arrived from the States today:\n\nLemonade Movie (more info here).\nIt’s the feel-good movie of the recession, following 16 creative-types who were laid off and decided to embrace a life they were missing. Odd coincidence that the UK recession died today. The press will have to find another source of fear (still cold enough for […]",
      "date": 1264509543000
    },
    {
      "id": "conundrums-by-harry-pearce",
      "title": "Conundrums",
      "href": "/2010/01/19/conundrums-by-harry-pearce/",
      "body": "Look what arrived today!\nTypographic Conundrums by Harry Pearce.\n\nThis awesome little book is full of typographic conundrums that need to be visually decoded into revealing a common saying or phrase. Very clever in their wit and simplicity.\nI was lucky enough to attend Cumbria University where Harry Pearce was asked to give a talk. He showed off […]",
      "date": 1263908368000
    }
  ],
  "nextPage": "/blog/page/34/",
  "prevPage": "/blog/page/32/",
  "pageTitle": "Blog (page 33) – David Bushell – Web Design (UK)"
}