{
  "pagePath": "/blog/page/33/",
  "pageHeading": "Blog (page 33)",
  "excerpts": [
    {
      "id": "on-design-blogging",
      "title": "On design blogging",
      "href": "/2010/07/12/on-design-blogging/",
      "body": "I’ve never liked the term “blogging”. It sounds a bit buzzy but I guess it’s becoming more acceptable these days. I still refuse to use the word “tweeting” in real life conversation without following it up with “I can’t believe I said that”. Ignoring the vocabulary blogging and tweeting have become a big part of my professional […]",
      "date": 1278967233000
    },
    {
      "id": "morning-design-blogs",
      "title": "Morning design blogs",
      "href": "/2010/07/08/morning-design-blogs/",
      "body": "I’d like to say I spend my mornings sat peacefully in my slippers, a nice cup of tea to hand, the sun steadily rising in my kitchen window while I casually read the latest design blogs on my MacBook Pro. I would like to say that. But most mornings are a frantic bewildered rush to […]",
      "date": 1278621823000
    },
    {
      "id": "html5-for-web-designers",
      "title": "HTML5 for Web Designers",
      "href": "/2010/07/07/html5-for-web-designers/",
      "body": "The latest addition to my design book library (well, shelf) is the much anticipated HTML5 for Web Designers by Jeremy Keith, published by A Book Apart.\n\nThe HTML5 spec is 900 pages and hard to read. HTML5 for Web Designers is 85 pages and fun to read. Easy choice.\n\nI’ve been very excited to read this book […]",
      "date": 1278523348000
    },
    {
      "id": "the-balance-of-web-design",
      "title": "The Balance of Web Design",
      "href": "/2010/07/04/the-balance-of-web-design/",
      "body": "Before I present another awesome feature of my own website, I’d like to briefly discuss the theory behind website design:\nWhen we speak about “website design” our initial thoughts centre around the aesthetic style. In reality the secret to good website design is content layout on the individual pages, and the content structure of the whole website.\nDelivering content correctly is […]",
      "date": 1278255184000
    },
    {
      "id": "using-svg-logos",
      "title": "Using SVG Logos",
      "href": "/2010/06/30/using-svg-logos/",
      "body": "Update 1th November 2011: The Good, the Bad, and the Logo\nIf you visited this website recently you may have noticed the new logo/emblem that adorns the top centre of the design. For the last few days that logo was simply a PNG image. Well this evening I asked myself why? It’s obviously been designed as a […]",
      "date": 1277929259000
    },
    {
      "id": "do-you-need-a-javascript-library",
      "title": "Do you need a JavaScript library?",
      "href": "/2010/06/29/do-you-need-a-javascript-library/",
      "body": "Over the last few years JavaScript has gone through a renaissance.\nFrom a buggy unpredictable add-on, to a mature superfast piece of kit, JavaScript is an integral component to any website. To prove this I’d present libraries like jQuery, Modernizr and Raphaël (to name a few of my favourites).\nBut the question of the day is: do you actually need […]",
      "date": 1277844775000
    },
    {
      "id": "finding-the-right-style",
      "title": "Finding the right style",
      "href": "/2010/06/28/finding-the-right-style/",
      "body": "At Base Creative we’re doing a series of blog posts and video blogs (“vlogs” - I’m not sure that’ll catch on) about our website design strategy. That’s the process we go through with our clients and especially the initial meetings. In my latest post I discuss a specific technique we use in the strategy meeting:\n\nOne way which […]",
      "date": 1277725107000
    }
  ],
  "nextPage": "/blog/page/34/",
  "prevPage": "/blog/page/32/",
  "pageTitle": "Blog (page 33) – David Bushell – Web Design (UK)"
}