{
  "dateUnix": 1363603561000,
  "dateFormatted": "Monday 18 Mar 2013",
  "pageHeading": "The Flat Build",
  "pagePath": "/2013/03/18/the-flat-build/",
  "innerHTML": "<p>The flat build is the process of coding a static website in HTML &amp; CSS without worrying about complete functionality or CMS integration. UI prototypes, responsive design layouts, or even the initial stages of final front-end development.</p>\n<p>It’s becoming increasingly apparent that merging the design and dev process in an iterative workflow is key to a successful web project.</p>\n<p>Getting to the browser sooner — where changes are fast but welcome — makes the flat build an obvious bottleneck to progress. The most apparent issue is shared code. The global elements used across multiple pages. Design and structure is going to change and manually updating flat build files is tedious and prone to fragmentation.</p>\n<h2 id=\"the-old-way\">The old way</h2>\n<p>it used to be the only time I’d do a flat build was post-design. I’d use PHP includes because CMS integration was the main task at hand; the end game.</p>\n<pre><code class=\"language-php\"><span class=\"token delimiter\">&lt;?php</span> <span class=\"token keyword\">include</span> <span class=\"token string\">'header.php'</span><span class=\"token punctuation\">;</span> <span class=\"token delimiter\">?></span>\n</code></pre>\n<p>I was coding up PSDs. My only concern was when to introduce CMS template constructs. Too soon and HTML becomes messy to refactor. Too late and time is wasted with repetitive placeholders. Design was not suppose to change and I consider that a real pain in the arse when it inevitably did.</p>\n<p>Now that flat builds are introduced as soon as possible I could continue to use PHP. By definition it’s a HTML preprocessor, isn’t that exactly what I need? My issue is that PHP will always be required to view the build. I want to compile plain HTML I can view in the browser anywhere I go and quickly chop up when it comes to development (I always build a style guide/pattern library alongside my templates). Running a full stack on my laptop or requiring server deployment is too unwieldy at this stage.</p>\n<p>Includes are also not the only requirement for productive flat builds to evolve throughout the project. Asset management can also be a big bottleneck.</p>\n<h2 id=\"the-apps\">The apps</h2>\n<p>I’m not surprised we’re seeing trendy apps appear to solve this problem. <a href=\"http://hammerformac.com/\">Hammer</a>, <a href=\"http://mixture.io/\">Mixture</a>, and <a href=\"http://incident57.com/codekit/\">CodeKit</a> all give it a good go. My first recommendation to anyone looking to improve their flat build process would be to trial these apps. An attractive UI tends to be quickly accessible with a small learning curve.</p>\n<p class=\"b-post__image\"><img src=\"/images/2013/03/hammer-for-mac.png\" alt=\"\"></p>\n\n<p>For me — and this may be entirely my own flaw — none of these apps quite fit the bill. Because they’re “one size fits all” solutions it’s difficult to work around them if you have additional requirements. For example, I have SVG assets I want to automatically rasterise as PNG fallbacks.</p>\n<h2 id=\"building-your-own\">Building your own</h2>\n<p>I like total control and flexibility. I roll my own <a href=\"http://dbushell.com/2013/03/12/automation/\">automated Grunt tasks</a> to achieve what these apps do (and more).</p>\n<p>The barrier to entry here is extremely high. I can’t deny there’s a hell of a lot to learn just to understand how all of the pieces work. I know a lot of people don’t like this complexity. I agree to some extent with the arguments against but you do have to consider what knowledge is actually a prerequisite.</p>\n<p>As long as you’re not introducing more work than you’re going to save — which is the whole point — I’m all for choosing the tools that suit you and your team. Personally, things like CoffeeScript and HTML abstractions are a step too far for me. I can’t however deny other people find them more productive. If I’m not working independently on a project it’d be ignorant of me to default to this Grunt set up. That’s the important decision.</p>\n<p class=\"p--small\"><em>(For some reason — maybe it is irrational — I have a deep hatred for CoffeeScript but ranting here would totally default my own points so I’ll hold my tongue!)</em></p>\n\n\n\n\n<h2 id=\"missing-pieces\">Missing pieces</h2>\n<p>Naturally the inclination to do it yourself results in a half-baked solution. My Grunt set up is missing a HTML preprocessor, which if you remember is 50% of this article.</p>\n<p>I decided to build my own from scratch. I know, I know, I do actually have a client website I need to build but I figured I’d take some 20% time for personal development. This was primarily a bit of fun to learn more Node (grunt tasks already exists that could achieve this <a href=\"https://github.com/onehealth/grunt-preprocess/\">grunt-preprocess</a>, <a href=\"https://github.com/vanetix/grunt-includes\">grunt-includes</a>, <a href=\"https://github.com/outaTiME/grunt-replace\">grunt-replace</a>).</p>\n<p>It follows Hammer’s include syntax:</p>\n<pre><code class=\"language-markup\"><span class=\"token comment\" spellcheck=\"true\">&lt;!-- @include _header.html --></span>\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>main</span> <span class=\"token attr-name\">role</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>main<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>p</span><span class=\"token punctuation\">></span></span>Hello World!<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>p</span><span class=\"token punctuation\">></span></span>\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>main</span><span class=\"token punctuation\">></span></span>\n<span class=\"token comment\" spellcheck=\"true\">&lt;!-- @include _footer.html --></span>\n</code></pre>\n<p>It can perform multiple passes (to find includes within includes). Includes are matched via name first or path second if you specify a directory:</p>\n<pre><code class=\"language-markup\"><span class=\"token comment\" spellcheck=\"true\">&lt;!-- @include blog/_header.html --></span>\n</code></pre>\n<p>Which is quite cool to allow for namespacing.</p>\n<p>Feel free to poke around the <a href=\"https://gist.github.com/dbushell/5186122\">code in this gist</a>. It’s not an actual project repo yet because it’s missing vital features like relative asset/anchor URLs. Manual management of those is even more painful than basic includes.</p>\n<h2 id=\"perspective\">Perspective</h2>\n<p>For me, mastering the flat build process is as much an opportunity to experiment as it is about actually increasing productivity.</p>\n<p>By developing my own solution I’m starting to unearth a whole new batch of potential time savers. It’s allowed me to closely inspect my build process and how it integrates with design and I have some interesting ideas I want to play with — more on that later!</p>\n<p>You might decide to use an app or a task automator like me. I’d been very intrigued if you still prefer to use no tools at all aside from a text editor. Whatever you do, please write about your techniques are requirements.</p>\n<h2 id=\"updates\">Updates</h2>\n<p><a href=\"http://middlemanapp.com/\">Middleman</a> and <a href=\"http://yeoman.io/\">Yeoman</a> have been mentioned (thanks <a href=\"http://twitter.com/mattberridge\">@mattberridge</a> and <a href=\"http://twitter.com/patrickhamann\">@patrickhamann</a>). And of course full-on static site generators like <a href=\"https://github.com/mojombo/jekyllJekyll\">Jekyll</a> may serve both development and deployment purposes.</p>\n<p><a href=\"/2013/04/05/the-flat-build-2/\">Read: The Flat Build (2)</a></p>\n",
  "pageExcerpt": "The flat build is the process of coding a static website in HTML &amp; CSS without worrying about complete functionality or CMS integration. UI prototypes, responsive design layouts, or even the initial stages of final front-end development.\nIt’s becoming increasingly apparent that merging the design and dev process in an iterative workflow is key to a […]",
  "pageTitle": "The Flat Build – David Bushell – Web Design (UK)"
}