{
  "dateUnix": 1338023028000,
  "dateFormatted": "Saturday 26 May 2012",
  "pageHeading": "The Restriction of Type",
  "pagePath": "/2012/05/26/the-restriction-of-type/",
  "innerHTML": "<p>Responsive website design is incredibly difficult to get right. It’s often said that designing for <strong>content</strong> is the key to success.</p>\n<p>In the screenshots below you can see the websites of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://elliotjaystocks.com/\">Elliot Jay Stocks</a>, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.zeldman.com/\">Jeffrey Zeldman</a>, and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://informationarchitects.net/\">Information Architects</a>, all of which have had a redesign/realign this year with content as their priority and thus <strong>typography</strong> as their paintbrush.</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/05/websites-on-nexus.png\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/05/websites-on-nexus.png\" alt=\"Websites on Galaxy Nexus\"></a></p>\n\n<p>There are problems here:</p>\n<ul>\n<li>Elliot Jay Stocks’ website is unreadable on my Galaxy Nexus. I wear glasses — I’m very slightly shortsighted — and it’s illegible to me. The main copy is effectively 13px, a size at which most fonts can’t even be rendered properly. That’s a real shame, I gave up and <em>almost</em> forgot to go back and read his <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://elliotjaystocks.com/blog/has-adaptive-design-failed-of-course-it-bloody-hasnt/\">outstanding rebuttal</a> to <em>“Has adaptive design failed”</em> (thank you Elliot, that was magnificent!)</li>\n<li>While text size on Jeffrey Zeldman’s website is good on my mobile, the build is broken. The content is a thin column taking up 1/3rd of the width and therefore just too difficult to read.</li>\n<li>Information Architects is on the small side but bearable. The <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://informationarchitects.net/blog/responsive-typography/\">custom typeface</a> has incredible detail (even if overly iPad-centric in formation). My issue again is with the build; type set flush against the left edge and content being cropped off by the right.</li>\n</ul>\n<p>I don’t post these screenshots to unfairly call people out, only to note how <em>difficult</em> it is to make a responsive website despite having such a narrow — and very well reasoned — focus on content &amp; typography. I know it is unreasonable to nitpick and criticise details of a website design without knowing the brief and circumstance, but when your focus is so clearly defined there is little room for such apparent errors.</p>\n<p>I do realise that I am opening <em>myself</em> up for criticism here, so I’ll start.</p>\n<h2 id=\"a-loss-of-identity\">A Loss of Identity</h2>\n<p>My website design is also very much content focused. To aid my goal of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://bradfrostweb.com/blog/mobile/content-parity/\">content parity</a> I continued a minimal design style that my personal websites have always had, but the over focus has led to a rather plain small-screen experience:</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/05/dbushell-on-nexus.png\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/05/dbushell-on-nexus.png\" alt=\"dbushell.com on Galaxy Nexus\"></a></p>\n\n<p>Only after the mysteriously arrowed “DBUSHELL” is tapped does the header appear; the most visual and ‘branded’ element.</p>\n<p>Sure, my website aims to be readable and accessible. I don’t think visitors will have any complaints (comment section below!) Despite that I can’t help feeling part of the identity has been lost. Frankly it’s a bit dull, and so are the three websites above if I’m brutally honest. Even without their problems, is highly accessible content the end game?</p>\n<p>While it is true that — at least for blogs like this — the real value is within the content, it’s still our job as designers to use visual presentation as an enhancer, a persuader, <em>a seller</em>. We can’t just rely on words no matter how eloquently they’re written or how beautifully they’re presented. It cannot be emphasised enough just how important solid typography is but it’s still one of many foundation of good design. To design a compelling website — particularly on mobile — requires more.</p>\n<p>With so much focus on pure content we’re in danger of losing our license to <em>design</em>. The supposedly superficial ‘decoration’ is what makes a website compelling in a bustling commercial environment. A back-to-basics deconstruction of your personal website is a great way to understand the significance of content and content-first strategies, but from all I read today I worry that many in the industry are letting it hinder their ability to actually design, experiment, and — dare I say — incorporate real issues of anti-content responsibilities like advertisement and sponsorship into website design.</p>\n",
  "pageExcerpt": "Responsive website design is incredibly difficult to get right. It’s often said that designing for content is the key to success.\nIn the screenshots below you can see the websites of Elliot Jay Stocks, Jeffrey Zeldman, and Information Architects, all of which have had a redesign/realign this year with content as their priority and thus typography […]",
  "pageTitle": "The Restriction of Type – David Bushell – Web Design (UK)"
}