{
  "dateUnix": 1312230129000,
  "dateFormatted": "Monday 1 Aug 2011",
  "pageHeading": "Adobe Edge Preview",
  "pagePath": "/2011/08/01/adobe-edge-preview/",
  "innerHTML": "<p>My first foray into programming was <strong>Flash ActionScript</strong> and thus I’ve always had a place in my heart for the damned software. (With the release of ActionScript 3 I even learnt a bit about <em>real</em> programming.) Even now — despite my flag waving for web standards — I do still secretly love Flash, regardless of how deprecated it may appear.</p>\n<h3 id=\"a-missed-opportunity\">A missed opportunity</h3>\n<p>I think Adobe are well aware of how the web is moving away from Flash. It’s a bit unfair, because although web developers prefer their beloved standards, the big guns still prefer proprietary software and walled gardens. Flash <em>could</em> have (with work) been a strong candidate for mobile app development, until Apple knifed that possibility.</p>\n<h3 id=\"a-fight-back\">A fight back</h3>\n<p>With the release of the <strong><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://labs.adobe.com/technologies/edge/\">Adobe Edge Preview</a></strong> I shouldn’t think anyone will be surprised of Adobe’s next strategy: high fidelity productivity software for the web that runs in the browser; no plugin required, all the standards you’ve yearned for.</p>\n<blockquote>\n<p>Adobe® Edge is a new web motion and interaction design tool that allows designers to bring animated content to websites, using web standards like HTML5, JavaScript, and CSS3.</p>\n</blockquote>\n<p>You can’t fault that, can you?</p>\n<p>My initial reaction on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://plus.google.com/112664170427933857280/posts/9xK75W2nxFU\">Google+</a> was:</p>\n<blockquote>\n<p>Adobe Edge — a nightmare worse than Flash, or the forerunner in an inevitable shift towards automated tools as web development becomes too complex for hand-crafted code?</p>\n</blockquote>\n<p>Since then I’ve played with it more and found a few points of interest:</p>\n<ul>\n<li>Adobe Edge makes use of <strong>jQuery</strong>. In fact it appears to be built right on top of the JavaScript library.</li>\n<li>A lot of CSS transforms and properties are being manipulated here. Multiple techniques are being used to support all browsers (like a good JS library should).</li>\n<li>It’s fairly chunky. I racked up a whopping 150kb with a simple image fade and rotate (not including the image). But is that really too much these days? A few web fonts can produce similar baggage. Just like jQuery the initial weight starts to pays for itself the more functionality is implemented.</li>\n<li>The stage and timeline are very reminiscent of the Flash authoring tool and it all compiles down to JSON. Will we be able to write “Edge” without the software provided? The answer seems to be <em>yes</em>; at least I’ve managed to manually rewrite the timeline fairly easily.</li>\n</ul>\n<p>While Edge may be limited to producing annoying animated advertising now, I suspect it won’t be long before we see interactivity based on events and user input, and dare I say audio and video manipulation?</p>\n<p>Combine that with an authoring tool as powerful as Flash and you suddenly have web app production software and ease-of-use the likes of which we’ve never seen. All standards based, all <em>Apple</em>-proof.</p>\n<h3 id=\"something-to-consider-\">Something to consider…</h3>\n<p>At this year’s <a href=\"/2011/06/09/design-it-build-it-dibi/\">DIBI conference</a> <strong>Inayaili de León</strong> gave an interesting talk entitled <em>The Mechanical Revolution</em>. She raised the very real and pragmatic idea that we should <em>let go</em> of our hand-crafted ideals; allow the machine to work for us.</p>\n<p>Is that not what Adobe Edge aims to do?</p>\n<p>Our precious web standards are only going to get more complex. It’s already challenging enough to keep up with HTML and CSS. For many JavaScript is now a specialism.</p>\n<p>Let’s not forget that Flash provided us with online video and interactivity years before anything else and continues to lead in many areas. Adobe are not going to simply call it a day. They have an immensely talented group of engineers and developers, and this Edge preview signifies an intelligent shift in their web strategy - one that is probably more considered than that of the Flash naysayers.</p>\n<p>At the end of the day it’s our use of these tools that matters.</p>\n<p>Adobe Edge is not going to be a solution for making websites in the way most accessibility minded developers evangelise, but it could make Flash redundant on the web. Being based on open web standards I do see potential for a website to start from an accessible baseline and progress into an interactive “app”. Or maybe I wish… I’m reserving the right to protest for now.</p>\n<h3 id=\"-update-4th-august-\">[Update - 4th August]</h3>\n<p>Not content with hope and pure speculation I posted on the Adobe forums with the provocatively titled: <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://forums.adobe.com/thread/885158\">Edge - another walled garden?</a>. I’m pleased with both the response and openness from Adobe:</p>\n<blockquote>\n<p>Your suggestions good and we are looking at ways to enable more control over the markup.  For Edge Preview 1 we made the decision to attach the animation and content to the HTML at runtime to maintain a clean separation from the HTML markup in order to make it easier to integrate with different dynamic server environments.</p>\n<p>We are definitely NOT building a “walled garden” with Edge. We chose HTML as the file format that Edge works with in order to enable folks to work directly in an open format. We will be publishing the Edge runtime API in a future preview with the intent of making it available to code against as we add support for interactivity to Edge.</p>\n<p>opening externally-written HTML files in Edge is definitely worth getting into. You can go back and forth between Edge and an editor pretty well, and it’s a totally different experience than building something from scratch in the tool.</p>\n</blockquote>\n<p>That’s answered my main concern for now.</p>\n<p>It would seem we’ll be able to use Edge to add interactivity to semantically <em>accessible</em> HTML with full control over default/fallback states. It won’t stop amateurs creating all-Edge websites like we see with Flash—and I get a cold sweat thinking of how to retort the “but it’s web standards?” response—but it <em>will</em> be useful for professionals; a powerful authoring tool to replace hand coded jQuery.</p>\n",
  "pageExcerpt": "My first foray into programming was Flash ActionScript and thus I’ve always had a place in my heart for the damned software. (With the release of ActionScript 3 I even learnt a bit about real programming.) Even now — despite my flag waving for web standards — I do still secretly love Flash, regardless of […]",
  "pageTitle": "Adobe Edge Preview – David Bushell – Web Design (UK)"
}