{
  "dateUnix": 1304634799000,
  "dateFormatted": "Thursday 5 May 2011",
  "pageHeading": "Truly great websites are not created on a computer",
  "pagePath": "/2011/05/05/truly-great-websites-are-not-created-on-a-computer/",
  "innerHTML": "<p>There is a perception of the <em>Website Designer</em> busily working away, headphones on, brief in lap, mouse at hand, pushing pixels while striking a balance between their own artistic license and the client’s demands.</p>\n<p>This couldn’t be further from the truth. <strong>Great websites are not created on a computer</strong>, and they’re certainly not designed by the <em>Designer</em> alone.</p>\n<p><strong>Great websites</strong> need a healthy partnership between agency and client. Since the client is paying for the service and expertise, it’s the agencies responsibility to managed the project and maintain the relationship and direction.</p>\n<h3 id=\"on-strategy\">On Strategy</h3>\n<p>Once fair contract formalities are agreed upon the website strategy is discussed. This initial meeting is vital for the <em>Designer</em> to understand the business, the audience, and the website goals. This reassures the client of their confidence in the agencies ability.</p>\n<p>Without trust, the client is forced to take responsibility of a process they don’t understand. Even worse, this misguided step-up to authority often leads to the agency taking a worried step back. This leads to ill-judged and unchallenged design decisions, revision after revision, and frustration for all parties.</p>\n<p>The truth is, this is so easy to avoid. As a professional design agency we can easily admit that without the client’s help we cannot design their website alone. It’s teamwork.</p>\n<p>Everything that happens between the <em>Designer</em> and the computer is a result of this process and discussion with the client – anything else – well, that’s just self-indulgence!</p>\n<p>Before any design happens we meet with the client to talk “strategy”. We do this to achieve the following:</p>\n<ul>\n<li>Everyone <em>knows</em> what the website aims to achieve.</li>\n<li>Everyone <em>knows</em> who will be looking at the website and of whom it needs to attract.</li>\n<li>Everyone <em>understands</em> the brand and aesthetic preferences.</li>\n<li>Everyone <em>understands</em> what functionality needs to be developed.</li>\n<li>Everyone has <em>an idea</em> of the content and how it will be structured.</li>\n<li>Everyone has <em>an idea</em> of how long the project will take, and what process is involved.</li>\n</ul>\n<p>There are many more things that can be learnt, but the point is that no one can proceed or start a website design without a strategy. And most certainly, no one can design a <strong>great website</strong> with just a brief landing on their desk and no more input.</p>\n<p>But that’s not it!</p>\n<h3 id=\"on-process\">On Process</h3>\n<p>The design process includes not just regular client feedback, but regular client <em>involvement</em>. There’s a significant different. Feedback is on questions like “Does this fit the brand style?”, “Is this what you imagined?”. <em>Involvement</em> is much more, it’s teamwork. It’s an acknowledgement that we are all designing this website together, connecting the business to the talent, to the specialist knowledge on both ends. For this to happen their needs to be fluidity and consistency in the process, and no secrets or set backs.</p>\n<p>As we know it’s the agencies responsibility to maintain this design relationship (and that isn’t done in Photoshop!). Failure to maintain honest communication and scheduling leads to the biggest problem I noted above. However, if we’re all aiming for a <strong>great website</strong> this is very easy to avoid. Every decision should be made openly with the project goals at heart.</p>\n<h3 id=\"on-content\">On Content</h3>\n<p>The most important part of a website is its content – the non-superfluous elements that users are going to see, read and watch. Content sells products and services (or fails to, which is more often the case). A website design must centre around content.</p>\n<p>Content is defined somewhere between what the user expects to see and what the website owner wants to portray. Perfecting this balance is vital to a website’s success. Inject something extra, like humour, and this success will explode.</p>\n<p>Content should dicate design. The oposite is rarely a good idea, though design can heighten the visual impact of content (regardless of it’s value).</p>\n<hr>\n<p>Well that’s an abrupt end for part one! I’ll write more on this topic soon…</p>\n<p>My point is – you could take the world’s best <em>Designer_, _Developer_, or _Copywriter</em> and put them into a poorly controlled project and they won’t produce great work. Place them infront of the client and you’re on the right track.</p>\n<p>That’s because <strong>great websites</strong> are not created on a computer.</p>\n<p class=\"p--small u-dim\">(Although you could probably produce a mediocre one.)</p>\n",
  "pageExcerpt": "There is a perception of the Website Designer busily working away, headphones on, brief in lap, mouse at hand, pushing pixels while striking a balance between their own artistic license and the client’s demands.\nThis couldn’t be further from the truth. Great websites are not created on a computer, and they’re certainly not designed by the […]",
  "pageTitle": "Truly great websites are not created on a computer – David Bushell – Web Design (UK)"
}