{
  "pagePath": "/blog/page/10/",
  "pageHeading": "Blog (page 10)",
  "excerpts": [
    {
      "id": "prototyping",
      "title": "Prototyping",
      "href": "/2013/04/18/prototyping/",
      "body": "A couple of weeks ago I embarked upon a new side quest: make a list app and use as much JavaScript in the stack as possible. Fighting adversity, I’ve made progress:\n\n\n\nTwitter Bootstrap is a great UI toolkit for prototypes. Don’t let it seduce you, my underlying code ain’t pretty!\n\n\n\n\nLearning Curve\nAfter the excitement of last weekend’s […]",
      "date": 1366314337000
    },
    {
      "id": "test-driven-development",
      "title": "Test Driven Development",
      "href": "/2013/04/14/test-driven-development/",
      "body": "I’ve been hacking away at my side project Macaque today. It’s quickly becoming the world’s most over-engineered to-do app. At the moment it’s categorising primates:\n\n\nIsn’t it beautiful?\nAs you can see, my big ideas for Macaque focus on design but I am building it end-to-end. For the supporting back-end I’ve spent the weekend writing and testing […]",
      "date": 1365968197000
    },
    {
      "id": "macaque-a-new-project",
      "title": "Macaque: A New Project",
      "href": "/2013/04/07/macaque-a-new-project/",
      "body": "Today I started a new project. Macaque will be a personal to-do or list app. Sounds simple, right? Unlike my other side projects I’m coding and designing in public from day one.\nThis project exists because:\n\nI want to learn more Node and Ember\nI’ve failed to find a list app I like (oh lord, please don’t suggest […]",
      "date": 1365370539000
    },
    {
      "id": "the-flat-build-2",
      "title": "The Flat Build (2)",
      "href": "/2013/04/05/the-flat-build-2/",
      "body": "My article The Flat Build was a slow burner but it has picked up steam recently and for the first time in like, forever, I’m building a pre-designed* website without having design influence. This has proven to be a good opportunity to refine and expand upon my flat build workflow (again).\nI’m aware I’m reinventing more […]",
      "date": 1365157578000
    },
    {
      "id": "on-responsive-layout-and-grids",
      "title": "On Responsive Layout and Grids",
      "href": "/2013/03/19/on-responsive-layout-and-grids/",
      "body": "I often get asked which responsive grid system I use. This is a very frustrating question because it implies a requirement where I have none. With the myriad solutions presented I can’t blame people for thinking they have a choice to make.\nThis article is my response to that question.\nAnatomy of a grid system\nResponsive grid systems […]",
      "date": 1363692826000
    },
    {
      "id": "the-flat-build",
      "title": "The Flat Build",
      "href": "/2013/03/18/the-flat-build/",
      "body": "The flat build is the process of coding a static website in HTML &amp; CSS without worrying about complete functionality or CMS integration. UI prototypes, responsive design layouts, or even the initial stages of final front-end development.\nIt’s becoming increasingly apparent that merging the design and dev process in an iterative workflow is key to a […]",
      "date": 1363603561000
    },
    {
      "id": "automation",
      "title": "Automation",
      "href": "/2013/03/12/automation/",
      "body": "I used to believe hand-crafting every line of code was a necessity. I u-turned on that opinion and adopted CSS preprocessors with much gusto last year.\nIt wasn’t so much the syntactical learning curve that initially put me off — they’re familiar if you’ve done any kind of programming — it was the perceived “added complexity” […]",
      "date": 1363112796000
    }
  ],
  "nextPage": "/blog/page/11/",
  "prevPage": "/blog/page/9/",
  "pageTitle": "Blog (page 10) – David Bushell – Web Design (UK)"
}