{
  "dateUnix": 1332277791000,
  "dateFormatted": "Tuesday 20 Mar 2012",
  "pageHeading": "Preserving the Web",
  "pagePath": "/2012/03/20/preserving-the-web/",
  "innerHTML": "<p>Before I ramble on, if you haven’t seen Jeremy Keith’s talk on time, networks and history, may I point you to his article: <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://adactio.com/articles/5312/\">Of Time And The Network</a>. You can also watch his talk from <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://vimeo.com/38138120\">Webstock ‘12 on Vimeo</a>.</p>\n<p>In regards to our content he says:</p>\n<blockquote>\n<p>Publish it. Publish it on the network. Put it out there, using standardised formats. Care for the URLs. Make sure those URLs last. And make lots of copies, and allow people to make lots of copies.</p>\n</blockquote>\n<p>When I first watched this talk I felt somewhat enlightened. Suddenly I understood the importance of archiving our digital history. Then I remembered many occasions in the past where I’ve had a similar revelation. These occasions had something in common, I was looking for work I’d lost to time.</p>\n<p>This domain [dbushell.com] has been online for coming on 9 years but I made many more amateur contributions to the <em>World Wide Web</em> when I was a youngling. Probably embarrasing things, likely many Geocities websites, but <em>mine</em> nonetheless. I’ve searched many archives but most or my “early years” are lost.</p>\n<h2 id=\"preserving-a-website\">Preserving a Website</h2>\n<p>So as it happens I <a href=\"/2012/03/06/design-heroes/\">recently</a> shut up shop at my <em>other</em> blog <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">Design Heroes</a>. I scheduled a mass deletion for an upcoming free weekend but — thankfully! — Mr. Keith’s video intervened. Now, I have no delusion that my little bookmark blog has any value to others, but I do know I’ll kick myself in a decade’s time when I think back to the day I deleted several years of my life on a hangover Sunday.</p>\n<p>The answer? Perserve the website. I had my doubts about pickling a USB stick so I decided to keep Design Heroes online in suspended animation. This required:</p>\n<ul>\n<li>Minimising external resources.</li>\n<li>Removing the underlying CMS and database.</li>\n<li>Maintaining/redirecting the original URLs.</li>\n<li>Making a copy of the website for download.</li>\n<li>Adding a notice for future visitors.</li>\n</ul>\n<p>Design Heroes has just under 1000 pages so manual archival wasn’t an attractive option. I started by editing the PHP templates to remove things like social buttons and searching — interactivity that isn’t going to work in the deep freeze.</p>\n<p>I downloaded the whole website (sans images) with <strong><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.gnu.org/software/wget/\">Wget</a></strong> and a variation of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.linuxjournal.com/content/downloading-entire-web-site-wget\">this command</a> (first result I got in Google). I found I had to run it a few times to force it through my pagination. I then deleted the CMS templates and uploaded the static HTML pages. I also zipped up the whole thing and added a download link with a liberal license. Finally, A little .htaccess magic was added to throw a 301 permanent redirect on my original URLs to ensure integrity there.</p>\n<p>Voilà!</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">One preserved website</a> ready to duplicate and re-host with ease and no dependencies. I reckon this process can be refined and improved. I also think there should be a standardised notice and preservation icon — <strong>let me know your ideas!</strong></p>\n",
  "pageExcerpt": "Before I ramble on, if you haven’t seen Jeremy Keith’s talk on time, networks and history, may I point you to his article: Of Time And The Network. You can also watch his talk from Webstock ‘12 on Vimeo.\nIn regards to our content he says:\n\nPublish it. Publish it on the network. Put it out there, using standardised […]",
  "pageTitle": "Preserving the Web – David Bushell – Web Design (UK)"
}