{
  "dateUnix": 1384434839000,
  "dateFormatted": "Thursday 14 Nov 2013",
  "pageHeading": "What is wrong with this message?",
  "pagePath": "/2013/11/14/what-is-wrong-with-this-message/",
  "innerHTML": "<p>Nobody said microcopy was easy…</p>\n<p>While catching up with my Twitter feed I follow a link to Google+ — appears to show signs of life within the tech community — and I’m greeted with this wonderful message:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2013/11/google-warning.png\" alt=\"Google plus nonsense\"></p>\n<p><strong><em>“Your profile has been suspended because it impersonates someone.”</em></strong></p>\n<p>A straight up accusation of potentially illegal acts. There’s no ambiguity, I’m guilty until proven innocent. I don’t pretend to be an expert in the field of user experience but I do know a thing or two about <em>common sense</em>. This is an appalling notification to throw in your user’s face. It raises the question, just who wrote this message? a designer? an engineer? the legal department? — if it was a <em>copy writer</em> I’ve lost all hope.</p>\n<p>I tried to reach out to Google+ with my obvious concerns (and disgust) but I require an active Google+ account to post to the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://plus.google.com/communities/115758385206378551362\">user group</a>. Oh well.</p>\n<p>It should go without saying that website users are humans. Design and build with empathy. Especially if it’s a website you’re trying to force down our throats.</p>\n",
  "pageExcerpt": "Nobody said microcopy was easy…\nWhile catching up with my Twitter feed I follow a link to Google+ — appears to show signs of life within the tech community — and I’m greeted with this wonderful message:\n\n“Your profile has been suspended because it impersonates someone.”\nA straight up accusation of potentially illegal acts. There’s no ambiguity, I’m […]",
  "pageTitle": "What is wrong with this message? – David Bushell – Web Design (UK)"
}