{
  "dateUnix": 1359948357000,
  "dateFormatted": "Monday 4 Feb 2013",
  "pageHeading": "A New Home",
  "pagePath": "/2013/02/04/a-new-home/",
  "innerHTML": "<p>Welcome to my new website. I haven’t rebranded entirely — what you see bears many similarities to <a href=\"/2012/02/27/spring-cleaning-redesigning-dbushell-com/\">updates past</a> — but I am launching a new stage in my career.</p>\n<p><strong>2013 is the year I go freelance.</strong></p>\n<p>This site now represents my <a href=\"/responsive-design/\">web design</a> and <a href=\"/front-end-development/\">front-end development</a> services. It’s heavily content-centric in design. And responsive, of course! It has a newfound simplicity. That’s not a compromise; in fact, efforts to that effect have improved the experience across a wider range of devices and browsers. There’s still much testing and perfecting to do but what better environment is there than a live server?</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2013/02/front-end-development.png\" alt=\"My new website design\"></p>\n<h2 id=\"under-the-hood\">Under the hood</h2>\n<p>After writing an in-depth example on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2013/01/15/off-canvas-navigation-for-responsive-website/\">Off-Canvas Navigation</a> for Smashing Magazine I’ve since adapted it to improve accessibility. As suggested by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.paulrobertlloyd.com/\">Paul Robert Lloyd</a> I’ve moved the element to the end of the document. This makes the baseline fallback less complex and the <em>“Return to top of page”</em> link more logical.</p>\n<p>Technically I’ve built this site to be super lightweight and fast. Most pages are around 200kb in weight on an empty cache. I’ll share much of my development techniques in future articles but go right ahead and view-source.</p>\n<h2 id=\"what-s-next-for-me\">What’s next for me</h2>\n<p>Focus on performance and accessibility has surged in recent months within the web industry — that’s a very good thing. If I were to set one goal this year it’d be to show how great websites can be when you don’t fight against the medium.</p>\n<p>On a less romantic note, it’s been a big week for me. Maybe 70–75 hours. I’m typing right now at 3:04am watching this Super Bowl thing. I’ve drafted business plans, client contracts, website copy. My accounting and invoicing practices have received a big upgrade. I’ve finally set up a business bank account.</p>\n<p>These are exciting times indeed and I’ve never felt more energised. <a href=\"/contact/\">Get in touch</a> if you have an interesting project I can help you with.</p>\n<p class=\"p--small u-dim\">P.S. blog comments are currently off but I’d very much like your feedback so <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">send me a tweet</a>.</p>\n",
  "pageExcerpt": "Welcome to my new website. I haven’t rebranded entirely — what you see bears many similarities to updates past — but I am launching a new stage in my career.\n2013 is the year I go freelance.\nThis site now represents my web design and front-end development services. It’s heavily content-centric in design. And responsive, of course! […]",
  "pageTitle": "A New Home – David Bushell – Web Design (UK)"
}