{
  "pagePath": "/blog/page/5/",
  "pageHeading": "Blog (page 5)",
  "excerpts": [
    {
      "id": "be-careful-with-your-viewbox",
      "title": "Be careful with your viewBox",
      "href": "/2016/03/01/be-careful-with-your-viewbox/",
      "body": "In Sara Soueidan’s article: SVG Style Inheritance and the ‘Flash of Unstyled SVG’, Sara explains the importance of having width, height, and viewBox attributes on SVG elements. This reminded me of two issues I ran into last week building my new design.\nI have an SVG sprite for social icons:\n\n  \n  .svg-icon  { […]",
      "date": 1456826400000
    },
    {
      "id": "a-bit-of-a-new-look",
      "title": "A Bit of a New Look",
      "href": "/2016/02/29/a-bit-of-a-new-look/",
      "body": "I redesigned my website!\nThis iteration has taken longer than usual because the visual changes are much more dramatic. I’m really pleased with the results:\n\nIt’s been two years since I last updated the design. That is a record because it’s usually an annual tradition. Past updates include: 2014, 2013, 2012, and 2011. Last year I improved […]",
      "date": 1456740000000
    },
    {
      "id": "css-framework-for-partsgiant",
      "title": "CSS Framework for PartsGiant",
      "href": "/2016/01/04/css-framework-for-partsgiant/",
      "body": "PartsGiant is a soon to launch e-commerce store based in Michigan, USA.\nI was hired to build the PartsGiant front-end CSS framework and HTML templates. The work would be done in stages throughout the year. This required flexibility on my part and scalability in the codebase I developed.\nI’ve always championed the idea of maintainable, future-proof coding […]",
      "date": 1451901600000
    },
    {
      "id": "2015-in-review",
      "title": "My Year in Review",
      "href": "/2015/12/30/2015-in-review/",
      "body": "All considered, 2015 has been a good year!\nMy highlight for sure was moving into my new flat. The whole searching, buying, and decorating process took way longer than I imagined. Because of this I didn’t take on as many large projects, but I did manage to find enough freelance work to keep me going.\nJanuary\nWhat better […]",
      "date": 1451469600000
    },
    {
      "id": "tales-wordpress-theme-now-free",
      "title": "Tales WordPress theme is now free",
      "href": "/2015/11/12/tales-wordpress-theme-now-free/",
      "body": "Tales is a WordPress theme I developed early last year to show that responsive design and legacy browser support are not mutually exclusive.\n\nFor the few months that I sold Tales it provided a small but welcome side income (considering my lack of advertising). Today I’m happy to announce that Tales is now free to download […]",
      "date": 1447322400000
    },
    {
      "id": "accelerated-mobile-pages",
      "title": "Accelerated Mobile Pages",
      "href": "/2015/10/20/accelerated-mobile-pages/",
      "body": "The AMP Project is an initiative by Google to improve the “mobile web”.\nAccelerated Mobile Pages are an alternate version of their corresponding, canonical web page. They’re still HTML but limited — check the spec. The best way to understand Accelerated Mobile Pages is to see them in action:\n\nThe BBC News website has implemented AMP, screenshotted […]",
      "date": 1445335200000
    },
    {
      "id": "september-update",
      "title": "September Update",
      "href": "/2015/09/07/september-update/",
      "body": "Good afternoon! So it’s been a while since I last blogged. Turns out buying a home takes longer than I imagined!\nWhen I left London in 2012, I moved back in with my parents  (temporarily) to embark upon a freelance career. Work has been steady, not easy, but rewarding and I’m much happier out of […]",
      "date": 1441620000000
    }
  ],
  "nextPage": "/blog/page/6/",
  "prevPage": "/blog/page/4/",
  "pageTitle": "Blog (page 5) – David Bushell – Web Design (UK)"
}