{
  "pagePath": "/blog/page/5/",
  "pageHeading": "Blog (page 5)",
  "excerpts": [
    {
      "id": "social-profiles",
      "title": "Social Profiles",
      "href": "/2015/06/26/social-profiles/",
      "body": "My website navigation now links to my GitHub and CodePen profiles, alongside Twitter. A long overdue change. It was embarrassing to be rocking the Google+ link. I never used Google+, I don’t even use Facebook, but it was useful to get my face alongside search results. That feature disappeared some time ago and thus the […]",
      "date": 1435312800000
    },
    {
      "id": "order-html-vs-css",
      "title": "Order: HTML vs CSS",
      "href": "/2015/06/01/order-html-vs-css/",
      "body": "Content should follow a logical top-to-bottom order within HTML. CSS is used to change the visual presentation of this content across different viewports.\nOn small viewports — mobile phones for example — a vertical layout that mimics the HTML order is generally a safe default. For wider viewports it is common to introduce more complex layout […]",
      "date": 1433152800000
    },
    {
      "id": "wordpress-to-metalsmith",
      "title": "WordPress to Metalsmith",
      "href": "/2015/05/11/wordpress-to-metalsmith/",
      "body": "It’s a busy work schedule that is usually to blame for my lack of written output on this blog. That was not the case last month!\nDowntime\nAs you may have noticed, my website has been going offline frequently. Not good. After several failed attempts to fix the — admittedly self-inflicted — issue I decided a full […]",
      "date": 1431338400000
    },
    {
      "id": "responsive-design-for-houden",
      "title": "Responsive Design for Houden",
      "href": "/2015/03/18/responsive-design-for-houden/",
      "body": "Houden is an e-ccomerce store, soon to launch with stylish bags and accessories for laptops, tablets, and cameras.\nI was hired to improve aspects of the design and user experience with the help of new brand guidelines and a base template already under development at Shopify. Below is a preview of the design and code I’ve […]",
      "date": 1426675859000
    },
    {
      "id": "critical-css-and-performance",
      "title": "Critical CSS and Performance",
      "href": "/2015/02/19/critical-css-and-performance/",
      "body": "I built my website last year with a strong focus on front-end performance.\nThis week inspired by Scott Jehl’s article “How we make RWD sites load fast as heck” and Callum Hart’s “Non-blocking UI’s with interface previews” I decided to revisit my code and give it another boost. The trick to getting content on screen faster […]",
      "date": 1424365085000
    },
    {
      "id": "when-can-a-website-be-over-1mb",
      "title": "When can a website be over 1mb?",
      "href": "/2015/02/06/when-can-a-website-be-over-1mb/",
      "body": "When a new website is released for a popular or high profile brand there are two stages of reaction. The first is praise: “it’s responsive!”, “it’s gorgeous!”. The second is criticism: “don’t work in IE9!”, “it’s over 1MB!”. As is internet traditional, opinion must be bipolar and unconditional.\nInitial reaction to the new Majora’s Mask 3DS […]",
      "date": 1423222268000
    },
    {
      "id": "i-dont-do-angular-is-that-ok",
      "title": "I don’t do Angular, is that OK?",
      "href": "/2015/02/04/i-dont-do-angular-is-that-ok/",
      "body": "I’ve never been one to care for job titles. One or two words can’t adequately explain the extent of our roles. I try to avoid giving myself a strict title on this website.\nOn my homepage:\n“I design, build &amp; write all things web”\n\n\nThen I list:\n\nResponsive Design\nFront-end Development\nProcess &amp; Strategy\n\nThese pages are a delicate balance of an […]",
      "date": 1423057945000
    }
  ],
  "nextPage": "/blog/page/6/",
  "prevPage": "/blog/page/4/",
  "pageTitle": "Blog (page 5) – David Bushell – Web Design (UK)"
}