{
  "dateUnix": 1519207200000,
  "dateFormatted": "Wednesday 21 Feb 2018",
  "pageHeading": "CodePen Snippets",
  "pagePath": "/2018/02/21/codepen-snippets/",
  "innerHTML": "<p>I’ve started a new <a href=\"https://codepen.io/collection/nbgEPa\">Code Snippets</a> collection on CodePen. It will be populated with the little and sometimes peculiar CSS techniques I’ve used. Mostly CSS but with occasional JavaScript sprinkles. Progressively enhanced, of course.</p>\n<p>Stuff like this styled range input:</p>\n<div class=\"b-post__image\">\n  <iframe height=\"150\" scrolling=\"no\" title=\"Styled input range (slider/progress)\" src=\"//codepen.io/dbushell/embed/awgLZK/?height=150&theme-id=0&default-tab=result&embed-version=2\" frameborder=\"no\" allowtransparency=\"true\" allowfullscreen=\"true\">See the Pen <a href=\"https://codepen.io/dbushell/pen/awgLZK/\">Styled input range (slider/progress)</a> by David Bushell (<a href=\"https://codepen.io/dbushell\">@dbushell</a>) on <a href=\"https://codepen.io\">CodePen</a>.</iframe>\n</div>\n\n<p>Who would have guessed each browser requires proprietary code?</p>\n<p>I’ll add a new Pen whenever I find a common design pattern that provokes a <em>‘how do I build this?!’</em> If the browser ballet insists on unusual CSS trickery I’ll log my findings. As with all web development anything older than a few months is likely a bit dated. Browser support will vary but tested to my satisfaction for at least one project<sup>†</sup>. That’s at least all modern browsers with a graceful fallback in older IE.</p>\n<p class=\"p--small\"><sup>†</sup> not a guarantee.</p>\n\n<p>If you’d like to share an improvement – fork away! Or leave a comment. Please use the CodePen comments so others’ can learn from you. I may or may not update older snippets. Some may become irrelevant as CSS specs develop.</p>\n<p>This isn’t a polished portfolio. Just raw code. But if I do have time I will try to pretty things up. Any superfluous, non-functional CSS will be kept separate.</p>\n<p>This new collection exists for two reasons:</p>\n<ol>\n<li>I keep solving the same problem over and over again because I can’t remember what websites I’ve worked on.</li>\n<li>Highly focused code demos are my most popular content.</li>\n</ol>\n<p>I encourage all front-end devs to do something similar. We have to feed those insatiable <em>“how do I…”</em> Google and StackOverflow searches!</p>\n<p>Follow <a href=\"https://twitter.com/dbushell\">@dbushell</a> for updates.</p>\n",
  "pageExcerpt": "I’ve started a new Code Snippets collection on CodePen. It will be populated with the little and sometimes peculiar CSS techniques I’ve used. Mostly CSS but with occasional JavaScript sprinkles. Progressively enhanced, of course.\nStuff like this styled range input:\n\n  See the Pen Styled input range (slider/progress) by David Bushell (@dbushell) on CodePen.\n\n\nWho would have […]",
  "pageDesc": "This isn’t a polished portfolio. Just raw code.",
  "pageTitle": "CodePen Snippets – David Bushell – Web Design (UK)"
}