{
  "pagePath": "/blog/page/28/",
  "pageHeading": "Blog (page 28)",
  "excerpts": [
    {
      "id": "gday-mate",
      "title": "G’Day Mate!",
      "href": "/2011/02/10/gday-mate/",
      "body": "A wonderful package arrived on my desk this morning!\nIt contained the CSS Awwwards book from The CSS Awards* honouring the best CSS Websites of 2010 - that’s a lot of CSS!\nI’m Mr July 9. It makes me happy but humbled, especially sat next to The Mid-Century Modernist - a site far more worthy of such […]",
      "date": 1297342166000
    },
    {
      "id": "a-month-of-interests",
      "title": "A Month of Interests",
      "href": "/2011/02/06/a-month-of-interests/",
      "body": "If you don’t follow my Design Heroes blog these are the links that I’ve found inspiring, useful or just plain funny over the last month!\nFoundation\nI watch and listen to a lot of podcasts but Foundation by Kevin Rose is one of the more exciting ones to appear recently. It’s all about web start-ups and innovation […]",
      "date": 1297028970000
    },
    {
      "id": "on-doing-what-you-do-best",
      "title": "On doing what you do best",
      "href": "/2011/02/03/on-doing-what-you-do-best/",
      "body": "Today I’m exceedingly happy :-D\nMy article Bringing Interactivity To Your Website With Web Standards has just been published on Smashing Magazine, the biggest web design blog there is. I’m also half way through writing my second article. (Despite being immensely tired from slogging out up to 14 hours of work daily over the last fortnight […]",
      "date": 1296762806000
    },
    {
      "id": "reflecting-on-aesthetics",
      "title": "Reflecting on Aesthetics",
      "href": "/2011/01/16/reflecting-on-aesthetics/",
      "body": "This past month I’ve focused solely on the accessibility and usability of web design. I’ve spent a long time considering how this fits into my daily practice, for real clients and personal projects, and all the ideals, limitations and opportunities involved.\nIn my article Transitioning as a Web Designer I sum up a very practical evolution […]",
      "date": 1295221386000
    },
    {
      "id": "transitioning-as-a-web-designer",
      "title": "Transitioning as a Web Designer",
      "href": "/2011/01/15/transitioning-as-a-web-designer/",
      "body": "“Web Designer” is one of the most exciting job titles in the design category. That’s because — and bear with me here — what was once an acceptable website design in a particular year may no longer be acceptable to produce the next.\nFor the last couple of years at Base Creative I’ve been designing fixed-width […]",
      "date": 1295128664000
    },
    {
      "id": "happy-new-ye-oh",
      "title": "Happy New Ye…oh",
      "href": "/2011/01/09/happy-new-ye-oh/",
      "body": "Ah, it’s the 9th already?\nI don’t do New Year’s resolutions, but I do like to look forward every now and then to consider all the amazing opportunities out there. 2011 is going to be all about pushing boundaries in life and work.\n(Not sure what that means in reality but I’ve plenty of time to find […]",
      "date": 1294616151000
    },
    {
      "id": "2010-in-design",
      "title": "2010 in Design",
      "href": "/2010/12/14/2010-in-design/",
      "body": "Funny how things never turn out how you expect them to.\nRewind a year and I find myself planning a big twenty-ten. After completing a very solid year in my pro web design career, 2010 was suppose to be all about exploring past passions in art and crafts. Replacing the mouse with a paint brush and […]",
      "date": 1292365598000
    }
  ],
  "nextPage": "/blog/page/29/",
  "prevPage": "/blog/page/27/",
  "pageTitle": "Blog (page 28) – David Bushell – Web Design (UK)"
}