{
  "pagePath": "/blog/page/28/",
  "pageHeading": "Blog (page 28)",
  "excerpts": [
    {
      "id": "seo-is-killing-website-design",
      "title": "SEO is Killing Website Design",
      "href": "/2011/04/12/seo-is-killing-website-design/",
      "body": "Misguided “Search Engine Optimisation” is the harbinger of a website disaster, and after the ‘sensationalist’ headline above, I’ll do my best to explain why.\nThe Logic of a Good Search Result\nWebsites should be optimised for search engines but you have to remember one important fact. Search engines care about delivering good results to their users. Users can very quickly […]",
      "date": 1302636693000
    },
    {
      "id": "launching-xheight",
      "title": "Launching xheight",
      "href": "/2011/04/10/launching-xheight/",
      "body": "As most people know I don’t do things by half and taking on ambitious projects is generally how I role these days. (Not Sunday though, I refused to take things serious on Sunday.)\nLast week I launched xheight.dbushell.com as a blog for many more designers than just myself to discuss the theory of design from experience […]",
      "date": 1302434964000
    },
    {
      "id": "three-months-in",
      "title": "Three Months In",
      "href": "/2011/03/28/three-months-in/",
      "body": "I find it hard to believe we’re already (ok, almost) in April.\n2011 in web design for me has kicked off with a BOOM! If I do say so myself. I’m no longer interested in just designing websites for clients and clients’ clients. I’m doing all that, and I’m pushing it further; looking for opportunities to use […]",
      "date": 1301343043000
    },
    {
      "id": "designing-mylifelisted",
      "title": "Designing MyLifeListed",
      "href": "/2011/03/14/designing-mylifelisted/",
      "body": "Today I’m excited to see MyLifeListed launch!\nWe’ve been very busy at Base Creative designing &amp; developing the site. We’re glad to be part of such an exciting project. See for yourself:\n\n\nI’m going to write a more in-depth article on the design process of MyLifeListed but since this is probably my favourite design project to date, here’s a […]",
      "date": 1300139030000
    },
    {
      "id": "what-does-design-mean-to-you",
      "title": "What does Design mean to you?",
      "href": "/2011/03/13/what-does-design-mean-to-you/",
      "body": "I write a lot about my experiences as a professional Web Designer. Writing helps shape my understanding. Sometimes I’ll start writing on a topic only to realise I know less than I thought I did.\nWhat fascinates me more though is reading what other designers have to say. For that reason I’m planning to launch a new blog […]",
      "date": 1300027027000
    },
    {
      "id": "inspire-me-now",
      "title": "Inspire me now!",
      "href": "/2011/03/09/inspire-me-now/",
      "body": "There are many things that inspire me – some I’d be embarrassed to admit! – but a combination of graphics, typography and a great quotation is certain to be a winner.\nI’ve never really been a quote type of person though, because my memory isn’t geared to remembering that sort of stuff.  I even set up a […]",
      "date": 1299674997000
    },
    {
      "id": "in-search-of-the-perfect-captcha",
      "title": "In Search of the Perfect CAPTCHA",
      "href": "/2011/03/04/in-search-of-the-perfect-captcha/",
      "body": "I’ve been on quite the journey over the last few weeks…\n…searching for the perfect CAPTCHA!\nYou can read my findings over at Smashing Magazine – big thanks to the team for their support and guidance in writing this article – I’m still immensly honoured! It’s also been quite an eye-opener to the issues of accessibility. That’s something I’m […]",
      "date": 1299243520000
    }
  ],
  "nextPage": "/blog/page/29/",
  "prevPage": "/blog/page/27/",
  "pageTitle": "Blog (page 28) – David Bushell – Web Design (UK)"
}