{
  "dateUnix": 1288039937000,
  "dateFormatted": "Monday 25 Oct 2010",
  "pageHeading": "Book Review: Just My Type",
  "pagePath": "/2010/10/25/book-review-just-my-type/",
  "innerHTML": "<p>If you’ve been following my Design Heroes blog you’ll know I’ve recently been impressed with two (<a href=\"http://designheroes.co.uk/link/true-to-type-how-we-fell-in-love-with-our-letters\">1</a>, <a href=\"http://designheroes.co.uk/link/whats-so-wrong-with-comic-sans\">2</a>) different excerpts from <a href=\"http://www.simongarfield.com/\">Simon Garfield’s</a> new book <a href=\"http://www.amazon.co.uk/Just-My-Type-About-Fonts/dp/1846683017\">Just My Type</a>.</p>\n<p>So much so that I purchased and read it as fast as humanly possible.</p>\n<p>The book starts with a chapter on Comic Sans, illustrating the significant impact a font can have. It follows on with a second story then quickly moves onto a brief history of typography, from Gutenberg’s Bible to type classifications. The chapter is an adequate explanation for non type-geeks and a nice reminder with a comical reference for the more discerning of us.</p>\n<blockquote><p>Just My Type is a book of stories about fonts. It examines how Helvetica and Comic Sans took over the world. It explains why we are still influenced by type choices made more than 500 years ago, and why the T in the Beatles logo is longer than the other letters.</p></blockquote>\n\n\n<p>The follow chapters pick up on the historical significance of certain typefaces while exploring modern day  usage and perception of typography. While discussing type without mentioning American and European influencers would be impossible, the book remains a definitely British affair, always returning to the streets of London. The cultural references, insight and just plain fascinating stories are what set this book apart from the myriad of other factual but dull typographic essays.</p>\n<p><em>Just My Type</em> puts typography in context with a modern world, while seamlessly tying in the history and legacy that makes the subject wonderful.</p>\n<p>I actually learnt a few new things regarding typography. Pride (and mostly ego) won’t allow me to admit exactly what, but I put it down to the writing style of this book. It has the narrative and investigative nature you’d expect from a well written editorial piece. No doubt a result of the author’s journalistic background.</p>\n<p>I’ve read many books about typography and they’ve all been the same.</p>\n<p>This one is different.</p>\n",
  "pageExcerpt": "If you’ve been following my Design Heroes blog you’ll know I’ve recently been impressed with two (1, 2) different excerpts from Simon Garfield’s new book Just My Type.\nSo much so that I purchased and read it as fast as humanly possible.\nThe book starts with a chapter on Comic Sans, illustrating the significant impact a font […]",
  "pageTitle": "Book Review: Just My Type – David Bushell – Web Design (UK)"
}