{
  "pagePath": "/blog/page/26/",
  "pageHeading": "Blog (page 26)",
  "excerpts": [
    {
      "id": "what-is-mobile",
      "title": "What is mobile?",
      "href": "/2011/09/14/what-is-mobile/",
      "body": "Have you ever seen someone walk down the street with a tower strapped to their back and a 24” flatscreen perched on one arm tweeting away? We can assert that anyone “mobile” is more than likely “small-screen” but there is still a strong distinction between the two. “Mobile” suggests either:\n\nuse of a specific handheld device — […]",
      "date": 1316006024000
    },
    {
      "id": "save-the-planet-with-css",
      "title": "Save the planet with CSS!",
      "href": "/2011/09/04/save-the-planet-with-css/",
      "body": "I’ve been quiet lately (big updates on the horizon) so a quick one for this evening:\nMy pre-launch checklist for website builds has always include “create print.css”. Most of the time I forget (or ignore it). It seems like the default thing to do though. Until you think about it.\nWho prints web pages?\nI do sometimes. Invoices, receipts, […]",
      "date": 1315159739000
    },
    {
      "id": "moving-on",
      "title": "Moving on",
      "href": "/2011/08/10/moving-on/",
      "body": "I’ve been the Senior Web Designer (and front-end dev) at Base Creative, London for the last three years. I’ve worked on great projects with amazing clients, making the Web that little bit better.\nBut sadly nothing can stay the same forever, and despite fond memories, I’ve decided to move on.\nNext Monday I’ll be joining Browser Creative, continuing with […]",
      "date": 1312996208000
    },
    {
      "id": "adobe-edge-preview",
      "title": "Adobe Edge Preview",
      "href": "/2011/08/01/adobe-edge-preview/",
      "body": "My first foray into programming was Flash ActionScript and thus I’ve always had a place in my heart for the damned software. (With the release of ActionScript 3 I even learnt a bit about real programming.) Even now — despite my flag waving for web standards — I do still secretly love Flash, regardless of how deprecated it […]",
      "date": 1312230129000
    },
    {
      "id": "the-social-designer-google-authorship",
      "title": "The Social Designer",
      "href": "/2011/07/14/the-social-designer-google-authorship/",
      "body": "Earlier this month I wrote an article about self promotion online as a designer (read Speak to Me over at xheight). I summed it up to this sentiment:\n\nSelf promotion is not about pushing an ego onto others, it’s simply about making yourself visible and accessible.\n\nOne thing I realised quickly in my career is the importance of […]",
      "date": 1310645305000
    },
    {
      "id": "solving-a-problem-like-change",
      "title": "Solving a Problem like Change",
      "href": "/2011/07/12/solving-a-problem-like-change/",
      "body": "A while back the Gawkernetwork redesigned their line-up and the Internet revolted. It was bad, very _very _bad. The design, the usability, the technical implementation—it had people scratching their heads.\nYesterday TechCrunchlaunched a redesign and, well, it’s not quite ‘a Gawker’.\n\n\nWe used AOL Paint, which comes free on the AOL CD and has this sweet UltraLogoMatic2000 feature.\n\nTo […]",
      "date": 1310471846000
    },
    {
      "id": "circle-me-google-plus",
      "title": "Circle me (Google+)",
      "href": "/2011/07/01/circle-me-google-plus/",
      "body": "Have you seen Google+?\n\nAside from making the name of their “like button” (Google+1) suddenly make a lot more sense, Google+ seems to be a very intuitive mix between Twitter &amp; Facebook. And I really like it (or +1 it, I guess).\nFor me Twitter is a broadcast and promotional tool, real conversation is very difficult. Facebook is just […]",
      "date": 1309520752000
    }
  ],
  "nextPage": "/blog/page/27/",
  "prevPage": "/blog/page/25/",
  "pageTitle": "Blog (page 26) – David Bushell – Web Design (UK)"
}