{
  "pagePath": "/blog/page/18/",
  "pageHeading": "Blog (page 18)",
  "excerpts": [
    {
      "id": "smashing-book-3",
      "title": "Smashing Book #3",
      "href": "/2012/05/07/smashing-book-3/",
      "body": "As an occasional writer for Smashing Magazine — that’s a disclaimer (and an honour!) — I’ve had the pleasure of reading the latest publication, Smashing Book #3 - Redesign The Web.\nHere’s my honest opinion on why this book is worth buying:\nOn Business\nBook #3 opens with wise words from Paul Boag on the reality of web […]",
      "date": 1336398706000
    },
    {
      "id": "hacking-it-right",
      "title": "Hacking it Right",
      "href": "/2012/05/03/hacking-it-right/",
      "body": "Developing with open web standards that are to be interpreted by literally hundreds of variations in device and browser can be tricky, but the biggest problem is often not the browser interpreting the code, but the developer writing it. Many so called “bugs” are the product of bad code and wrong expectations; don’t blame the […]",
      "date": 1336082878000
    },
    {
      "id": "notes-from-user-testing",
      "title": "Notes From User Testing",
      "href": "/2012/04/30/notes-from-user-testing/",
      "body": "Last week Browser hosted a UAT session for our latest website development (launching soon!)\nMost website designs — or any design for that matter — do not go through this sort of testing but it’s well worth the effort when done right. It’s exciting and a bit scary to be sat there with your clients while […]",
      "date": 1335770434000
    },
    {
      "id": "modularity-and-style-guides",
      "title": "Modularity and Style Guides",
      "href": "/2012/04/23/modularity-and-style-guides/",
      "body": "Last week I wrote about scoping typographic styles to introduce the concept of modularity in CSS. In that example, I removed the common globally defined text styles — for paragraphs, headings and lists etc — and scoped them with a .text class to be applied to any block of text-based content. This technique gives us […]",
      "date": 1335174328000
    },
    {
      "id": "scoping-typography-css",
      "title": "Scoping Typography CSS",
      "href": "/2012/04/18/scoping-typography-css/",
      "body": "I’m writing a very long article on front-end dev builds, this is a quick prelude to that!\nIt’s common practice to define global typography style early in a stylesheet. This makes a lot of sense. After all, a good design has consistent typography with a clear hierarchy throughout. When writing this CSS, type selectors like:\nh1 { […]",
      "date": 1334748564000
    },
    {
      "id": "terms-of-service-tldr",
      "title": "Terms of Service TL;DR",
      "href": "/2012/04/15/terms-of-service-tldr/",
      "body": "This week saw an echo of praise around the tech community for photography website 500px’s approach to its Terms of Service page.\nThe basic idea being that the left column contains the verbose legal terms while the right column holds a brief layman’s translation. What I find worry is the vast number of web professionals who […]",
      "date": 1334488626000
    },
    {
      "id": "spotify-play-button-and-socialite-js",
      "title": "Spotify & Socialite.js",
      "href": "/2012/04/11/spotify-play-button-and-socialite-js/",
      "body": "Spotify have just released their Spotify Play Button allowing you to embed any song or playlist on your website or blog. It’s awesome, but it also comes at a cost.\nThe whole include (which uses an iframe) weights in at close to 500kb and uses upwards of 30 http requests alone. Chunky! Chunkier than many web […]",
      "date": 1334150615000
    }
  ],
  "nextPage": "/blog/page/19/",
  "prevPage": "/blog/page/17/",
  "pageTitle": "Blog (page 18) – David Bushell – Web Design (UK)"
}