{
  "dateUnix": 1283784836000,
  "dateFormatted": "Monday 6 Sep 2010",
  "pageHeading": "Think Different",
  "pagePath": "/2010/09/06/think-different/",
  "innerHTML": "<p>I stumbled across one of Apple’s classic ad campaigns. Watch Jobs pitch it below:</p>\n<p>Found this via <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.younggunsvsoldones.com/2010/08/31/steve-jobs-think-different-pitch/\">Young Guns vs. Old Ones</a>.</p>\n<p>Inspiring, and a masterpiece of advertisement.</p>\n<p>Makes me wonder how differently Apple were thinking when they announced <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.apple.com/itunes/ping/\">Ping</a> their new social network for music.</p>\n<p>Despite <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.apple.com/html5/\">championing HTML5</a> it would seem Apple have now decided a web browser (even Safari) is inferior to the almighty monolith that is <strong>iTunes</strong>. Ping is completely walled off. Why it doesn’t have a web interface I have no idea. It’s social without the riff-raff. Or Apple-friendly mainstream artists without the indie bands.</p>\n<p>The problem with the interface of iTunes Store &amp; Ping is that by all accounts it generally sucks (ignoring Steve’s opinion). It doesn’t behave or interact in the same way as a website. But it _should _be a website. Instead it’s confusing, fiddly, tedious, awkward; proprietary nonsense. <strong>Now that is thinking differently.</strong></p>\n<p>To quote Apple on HTML5:</p>\n<blockquote>\n<p>These web standards are open, reliable, highly secure, and efficient. They allow web designers and developers to create advanced graphics, typography, animations, and transitions. <strong>Standards aren’t add-ons to the web. They are the web.</strong> And you can start using them today.</p>\n</blockquote>\n<p><strong>“Standards aren’t add-ons to the web. They are the web.”</strong> But apparently not good enough for iTunes and Ping? I guess those two are just add-ons then. Only available in certain countries.</p>\n<p>Good job Apple make awesome ads.</p>\n<p>Now if you’ll excuse me, I’m going to play Angry Birds on my iPhone. For four hours.</p>\n",
  "pageExcerpt": "I stumbled across one of Apple’s classic ad campaigns. Watch Jobs pitch it below:\nFound this via Young Guns vs. Old Ones.\nInspiring, and a masterpiece of advertisement.\nMakes me wonder how differently Apple were thinking when they announced Ping their new social network for music.\nDespite championing HTML5 it would seem Apple have now decided a web browser […]",
  "pageTitle": "Think Different – David Bushell – Web Design (UK)"
}