{
  "dateUnix": 1317474186000,
  "dateFormatted": "Saturday 1 Oct 2011",
  "pageHeading": "Building for Future Design",
  "pagePath": "/2011/10/01/building-for-future-design/",
  "innerHTML": "<p>2011 is vanishing fast!</p>\n<p>I’ve been busy working hard at my new home (<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.browsercreative.com/\">Browser</a>) refining my front-end coding skills.</p>\n<p>My focus has been on honing the semantic and accessible nature of the websites we build. That is the underlying requirement I need to fulfil my mandate of designing superb user experiences. It’s really all about pushing website design forward. To do that you can’t ignore the foundations.</p>\n<p>Gone are the days where a beautifully interactive website will suffice that consists of surface quality and little more. Websites with only that concern don’t last. They don’t convert sales, they piss off more users than they seduce. But that doesn’t mean that websites have to be boring and rigidly static. It’s my job to lay the groundwork so that we can enhance user experience while maintaining <em>accessible</em> interactivity.</p>\n<h2 id=\"looking-forward\">Looking forward</h2>\n<p>Earlier this year I wrote about <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2011/02/03/bringing-interactivity-to-your-website-with-web-standards/\">Bringing Interactivity To Your Website With Web Standards</a> for <em>Smashing Magazine</em> showcasing some of the experimental techniques in practice today.</p>\n<p>In recent months Adobe demonstrated with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://labs.adobe.com/technologies/edge/\">Edge</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://muse.adobe.com/\">Muse</a> that you can build animation and interactivity <em>with</em> web standards and still get it <strong>disastrously wrong</strong>. (I’ll explain how to do it <em>right</em> below.) I <a href=\"/2011/08/01/adobe-edge-preview/\">had</a> high hopes for Edge and I do believe the future of web design will continue to move away from its print design influences, but I must remember that websites are more than just skin deep. Aesthetics should not be priority.</p>\n<p>The web is the world’s digital information archive. It’s built upon open standards to ensure accessibility on any connected device. As practitioners we have a responsibility to maintain that basic principle. If we do that we can be <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://futurefriend.ly/\">Future Friendly</a>. We can experiment with new design paradigms and we can take advantage of new technology.</p>\n<h2 id=\"building-the-foundations\">Building the foundations</h2>\n<p>With my new job and opportunity to work on some very large scale responsive UI designs I’ve spent a lot of time reviewing my build practice. Designing these websites is great fun. Experimentation in design leads to innovation, but however safe or radical of a design we deliver to the clients, actually implementing it properly is the most important part.</p>\n<p>This is a condensed version of my build workflow. In reality it’s not entirely as linear as I’ve listed here but in theory I find this a useful way to consider it.</p>\n<p>It goes a little something like this:</p>\n<ul>\n<li>Write the website’s entire HTML using only elements and tags that make semantic sense.</li>\n<li>I think about <em>content</em>, not the design (use dummy content if need be). Any images are content, they supplement the textual information.</li>\n<li>Make sure the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2011/08/16/html5-and-the-document-outlining-algorithm/\">document outline</a> is correct.</li>\n<li>Add in <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/wai-aria/\">WAI-ARIA</a> — not as scary and the name suggests.</li>\n<li>Add in <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://microformats.org/\">Microformats</a> or <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://schema.org/\">Schema</a> (and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://developers.facebook.com/docs/opengraph/\">Open Graph</a> if a soul has been sold).</li>\n</ul>\n<p>At this stage if you cannot access every single page and piece of content on the website (in theory, let’s ignore backend architecture), <strong>the website build is seriously flawed</strong>. I can’t stress that enough!</p>\n<ul>\n<li>Apply CSS until the website resembles the design.</li>\n<li>I argue strongly in favour of separating general style (typography, colour etc) from layout. Using media queries I can deliver a website that fits onto any device.</li>\n<li>Follow a progressive enhancement approach using advanced CSS3 to apply more detailed styles.</li>\n<li>Any visual design that can’t be produce with CSS is delivered with a sprite image (or an individual image as last resort, never in the HTML unless it’s also content).</li>\n<li>Avoid editing the HTML by adding superfluous elements simply to ease styling.</li>\n<li>Avoid illogical CSS hacks, they only lead to more crazy hacks down the line.</li>\n<li>Write a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://printstylesheet.dbushell.com/\">print stylesheet</a>. If I’ve separated aesthetics from layout (using the small-screen first approach) this is very easy — I can just hide everything apart from the main content/article.</li>\n</ul>\n<p>At this stage I have a working, <em>accessible</em> website with content separate from style. It will purposefully deliver progressively better aesthetics to more modern browsers. It will also shape itself to fit on any size screen <em>without</em> simply <a href=\"/2011/09/14/what-is-mobile/\">removing content or functionality</a> (without very strong cause). The code is also perfectly optimised for search engines. Next:</p>\n<ul>\n<li>I write the JavaScript.</li>\n</ul>\n<p>That last one sounds isolated but the two stages prior are critical prerequisites. JavaScript should not break any of the fundamental web principles I’ve previously ensured. The most important being: the user should be able to access and link to anyway content directly with a URL. Just because JavaScript is client-side doesn’t mean that I can abuse CSS and HTML in non-standard ways. Stay semantic. Stay accessible. Stay usable.</p>\n<p>That’s a very brief overview of the process and as I’ve said, in reality it’s less linear than that with so many intricacies and best-practices not listed here. At some point the server side code needs to be incorporated (at which point depends on those involved).</p>\n<h2 id=\"progressing-forward\">Progressing forward</h2>\n<p>I post this as a reminder to myself because there is a forever growing opportunity to improve the design and user experience towards the end of this process.</p>\n<p>JavaScript is booming, CSS is becoming very powerful in more than just aesthetic style; its animations, transforms and transitions can be combine with JavaScript in wonderful ways, though a lot of the interactive techniques we’re using today are still experimental.</p>\n<p>If the future of website design lies on this horizon — and I strongly believe it does — we must ensure a solid foundation to build upon. We must maintain the principles that make the web so resilient and with that we can envision how our <em>access</em> is changing. As standards progress so do the devices we use to access the web. They will be the big game changers in website design.</p>\n",
  "pageExcerpt": "2011 is vanishing fast!\nI’ve been busy working hard at my new home (Browser) refining my front-end coding skills.\nMy focus has been on honing the semantic and accessible nature of the websites we build. That is the underlying requirement I need to fulfil my mandate of designing superb user experiences. It’s really all about pushing website design forward. […]",
  "pageTitle": "Building for Future Design – David Bushell – Web Design (UK)"
}