{
  "dateUnix": 1356863405000,
  "dateFormatted": "Sunday 30 Dec 2012",
  "pageHeading": "A New Beginning",
  "pagePath": "/2012/12/30/a-new-beginning/",
  "innerHTML": "<p>Everything changes for me at the end of January.</p>\n<p>After a wonderful 18 months at <a href=\"http://www.browserlondon.com/\">Browser</a> and five years living in London I’m heading home, back up north to Manchester — and then almost immediately back down south for <a href=\"http://dbushell.com/2012/12/07/responsive-day-out/\">Responsive Day Out</a> — but after that I’ll be starting something new.</p>\n<h2 id=\"what-s-next-\">What’s Next?</h2>\n<p>London was a great place to start my web career but not a good place to live. It was incredibly difficult to quit my job but I had to bite the bullet.</p>\n<p>I need to figure out what I want to do going forward. I’m not entirely sure yet. Perhaps it’s time to open my own shop? I won’t be rushing into anything, but I’m all ears if you have any opportunities. <strong><a href=\"mailto:hi@dbushell.com\">Please do get in touch</a></strong> if you require my web-making skills. I can’t ponder the meaning of life on an empty stomach!</p>\n<h2 id=\"small-resolutions\">Small Resolutions</h2>\n<p>Some things I <em>am</em> sure of and I’ve got a big head start on these resolutions:</p>\n<h3 id=\"improve-fitness\">Improve fitness</h3>\n<p>I now run over 10k a week and I’m aiming for a half-marathon in May. What a difference six months can make. I’ve already shed two stone and I no longer feel like a keyboard sloth. Pleased with that.</p>\n<h3 id=\"write-more-write-less\">Write more, write less</h3>\n<p>I’ve already alluded to changes in <a href=\"http://dbushell.com/2012/12/26/a-year-of-writing/\">my writing</a>. Rather than the bi-monthly epics I tend to slog over I want to publish more frequently on this blog; save the meatier stuff for Smashing Magazine etc.</p>\n<h3 id=\"filter-the-chirping\">Filter the chirping</h3>\n<p>I’ve authored (ha!) just shy of 10,000 tweets since April, 2009. I don’t know why that depresses me because Twitter is very useful. It’s my industry billboard, newspaper, and soapbox — and almost exclusively so. Very useful, but often frustrating to wade through the tedium that boils up every time the latest non-issue is overblown. Web folk like a good drama it seems. I need to stop reading every single tweet and be more selective in those that pique my interest. I’ve moved Twitter onto my second app screen to force a change in consumption.</p>\n<h3 id=\"research-develop\">Research, Develop</h3>\n<p>The most enjoyable times of 2012 have been the opportunities I’ve made to share projects like my <a href=\"http://dbushell.com/2012/10/09/pikaday-javascript-datepicker/\">lightweight datepicker</a> and experiments like my <a href=\"http://dbushell.com/2012/12/22/a-responsive-off-canvas-menu-with-css-transforms-and-transitions/\">off-canvas menu</a>. These tend to be wildly popular, collaborative, and the best learning experiences. I have a long list of random ideas that would serve much better in the public spotlight.</p>\n<p>And with that, bring on 2013!</p>\n",
  "pageExcerpt": "Everything changes for me at the end of January.\nAfter a wonderful 18 months at Browser and five years living in London I’m heading home, back up north to Manchester — and then almost immediately back down south for Responsive Day Out — but after that I’ll be starting something new.\nWhat’s Next?\nLondon was a great place […]",
  "pageTitle": "A New Beginning – David Bushell – Web Design (UK)"
}