{
  "dateUnix": 1306318189000,
  "dateFormatted": "Wednesday 25 May 2011",
  "pageHeading": "Designing a new me",
  "pagePath": "/2011/05/25/designing-a-new-me/",
  "innerHTML": "<p>I often say that aesthetics are the least important part of a website design.</p>\n<p><strong>Content</strong> and <strong>functionality</strong> are miles ahead of anything else. It’s obvious really, why would people visit unless you have some substance? They’re so important that design should focus on layout and architecture and only then should aesthetics be considered.</p>\n<h2 id=\"it-s-refreshing-\">It’s refreshing!</h2>\n<p>I’ve had <strong>dbushell.com</strong> online for 7 years and it’s gone through 5 iterations. My personal brand has been a slow evolution, I’ve presented my portfolio first and foremost because that defines me. Over the years I’ve allowed a few aesthetic elements to slip in (namely “green”) but it’s still about what I produce.</p>\n<p>My <a href=\"/2010/06/26/dbushell-v4/\">previous update</a> back in June ‘10 made blogging that bit easy (and I’ve done a <em>lot</em> of blogging since).</p>\n<h4 id=\"old-and-busted-\">Old and busted:</h4>\n<p><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/dbushellcomv4.jpg\" alt=\"dbushell.com version 4\"></p>\n<h4 id=\"new-hotness-\">New hotness:</h4>\n<p><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/dbushellcomv5.jpg\" alt=\"dbushell.com version 5\"></p>\n<h2 id=\"what-s-new-this-time-\">What’s new this time?</h2>\n<p>A few things annoyed me about the old design. Really annoyed me. The “logo” was <em>huge</em> and stole too much attention without serving much purpose. The new one is slicker and seriously vintage (guaranteed airtime).</p>\n<p>My mascot—the green crane—is now facing <em>inwards</em>. I should have paid more attention in my university’s semiotics lecture. I only realised after translating a Chinese design blogger who had featured me. Thank you, whoever you are!</p>\n<p>I’ve embraced the sponsors. I joined the brilliant <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://carbonads.com\">Carbon Ads</a> network a few months ago and had to shoehorn the ads in the best I could. The result wasn’t good enough and it couldn’t be fixed easily. My new design with the u-dark header seats the ads perfectly.</p>\n<h3 id=\"it-s-responsive-\">It’s responsive!</h3>\n<p><em>**</em>I’ve preached about responsive web design for long enough. The term is redundant, web design _is_ responsive design. Previously I experimented with a few multi-column varied-width blog templates but now my whole website is fluid.</p>\n<p>I’ve built up from a <em>min-width</em> of <strong>320px</strong> to a <em>max-width</em> of <strong>1140px</strong> with media queries to adjust layout for several steps upward. A lot of people don’t set bounds but it’s a nice touch to avoid silly extremes. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://github.com/scottjehl/respond\">Respond.js</a> is magic.</p>\n<p>Most of my blog layouts remain the same, they just fits more intelligently now. I’ve also cleaned up a lot of HTML—<em>but don’t look yet</em> I’ve still a bit to tidy! My <a href=\"/showcase/my-life-listed/\">portfolio pages</a> are going “high-def” with powerful visuals and I’ll be adding more recent projects very soon.</p>\n<h3 id=\"perfection-\">Perfection?</h3>\n<p>Unlikely! But I’m satisfied for now. Leave a comment below. Tell me what you think :) As always I’ll be realigning things for months to come. There are a few WordPress issues I need to iron out. Damn you WP!</p>\n<p>Almost everything I’ve implemented here has come from months of experimentation and evolving design practices working at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.basecreative.eu\">Base Creative</a>. We’ve got some amazing projects going live soon. If you want to work with me – that’s where I am!</p>\n<p>Oh, and for comparison here’s version 3. Notice the similarities?</p>\n<p><a href=\"/images/2011/05/dbushellv3.jpg\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/dbushellv3-300x224.jpg\" alt=\"dbushell.com version 3\"></a></p>\n<p class=\"medium\">Thanks to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.minimalsites.com/david-bushell\">Minimal Sites</a> for saving that screenshot!</p>\n\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://lovedsgn.com/post/6554\">Love</a></p>\n",
  "pageExcerpt": "I often say that aesthetics are the least important part of a website design.\nContent and functionality are miles ahead of anything else. It’s obvious really, why would people visit unless you have some substance? They’re so important that design should focus on layout and architecture and only then should aesthetics be considered.\nIt’s refreshing!\nI’ve had dbushell.com […]",
  "pageTitle": "Designing a new me – David Bushell – Web Design (UK)"
}