{
  "dateUnix": 1307298695000,
  "dateFormatted": "Sunday 5 Jun 2011",
  "pageHeading": "Hey, I was reading that…",
  "pagePath": "/2011/06/05/hey-i-was-reading-that/",
  "innerHTML": "<p>I’m a huge fan of web typography, but we’ll have to wait a bit longer to catch up with print.</p>\n<p>Twitter surged last week with the news of <a href=\"http://blog.typekit.com/2011/06/01/futura/\">Futura’s arrival at Typekit</a>.</p>\n<blockquote><p>Futura PT’s classic design — tall ascenders, near perfect geometric shapes — make it both instantly recognizable and irrepressibly modern.</p></blockquote>\n\n\n<p>Indeed, and browser rendering makes it entirely <em>unrecognisable</em>. We’ve known this for a while; Futura has been available on less popular/more pricy services for months. See the example from Typekit’s blog:</p>\n<p><img src=\"/images/2011/06/Rendering-at-text-sizes.png\" alt=\"Futura - rendering at text sizes - Typekit\">\n<em class=\"medium\">Image © 2011 Typekit, Inc. </em></p>\n<p>The rendering is passible on a Mac, dreadful on Windows—and that’s just regular Futura Book. Light and <em>Light Italic</em> are going to be atomic-thin. Typekit says this is “strikingly legible”. I’m not sure that’s a compliment. Play around with the <a href=\"http://typekit.com/fonts/futura-pt\">Futura Type Specimen</a> and you’ll see for yourself:</p>\n<p><img src=\"/images/2011/06/typekit.png\" alt=\"Futura PT - Typekit Specimen\"></p>\n<p>Those sub-pixels are being tortured. I daren’t check how it’s displayed on a Windows machine.</p>\n<p><strong>Update: I did check Windows, and it’s horrific:</strong></p>\n<p><img src=\"/images/2011/06/typekit-windows.png\" alt=\"Futura Typekit Specimen on Windows\"></p>\n<p>There’s nothing wrong with Futura’s design or Typekit’s serving it’s simply a technical limitation. But it’s an issue that is evidentially being ignored by many web designers.</p>\n<h2 id=\"web-typography-limitations\">Web Typography Limitations</h2>\n<p>Futura and many (actually most) other web fonts can never be used for body copy. At least not until we’re all sat infront of desktop displays that match the <em>pixels-per-inch</em> of the iPhone’s Retina screen. If you thought browser upgrading was a slow and frustrating process, you’ll cry when you realise we’ll be designing for old hardware for decades longer.</p>\n<p>There are fonts like <a href=\"http://www.google.com/webfonts/family?family=Droid+Serif\">Droid Serif</a> that work great—you’re reading it now—but we have to concede the choice is limited. I’ve experimented with web fonts on many sites and the results have been disappointing. The legibility problems are too large.</p>\n<p>Here’s the kicker: <strong>choosing a pretty font does not mean a website has good typography</strong>.</p>\n<p>Good typography in Arial is indefinitely more desirable than <em>bad</em> typography in a fancier web font. Appropriate type size, leading, line-length and general typesetting is missing in many professionally designed websites. Top that off with an illegible font and you’ve got a perfect cake that nobody’s eating. If that metaphor makes no sense – your website isn’t going to attract many visitors.</p>\n<p>To be fair, design on the web has matured a lot in the last few years but lack of attention to technical limitations and too much focus on gloss has produced a fair selection of online duds. Design distractions are everywhere. Web fonts, JavaScript, CSS3 and HTML5 are all luring us in to their glorious freshness and rejuvenating powers.</p>\n<p>Websites are designed to serve a purpose. Normally to promote and sell a product or service. They are not a canvas for us to throw every new technology at. While these things do often help provide a better solution it’s almost always simple <em>clarity</em> that works best, not illegible web fonts.</p>\n<hr>\n<p>In other news, on June 7th <em>Monotype Imaging</em> are releasing a new digital version of <strong>Helvetica</strong> including display weights under its original name “Neue Haas Grotesk”.</p>\n<p>Incidentally, I’ll be going offline for a while…</p>\n",
  "pageExcerpt": "I’m a huge fan of web typography, but we’ll have to wait a bit longer to catch up with print.\nTwitter surged last week with the news of Futura’s arrival at Typekit.\nFutura PT’s classic design — tall ascenders, near perfect geometric shapes — make it both instantly recognizable and irrepressibly modern.\n\n\nIndeed, and browser rendering makes it […]",
  "pageTitle": "Hey, I was reading that… – David Bushell – Web Design (UK)"
}