{
  "dateUnix": 1255273290000,
  "dateFormatted": "Sunday 11 Oct 2009",
  "pageHeading": "Graphic Design Referenced",
  "pagePath": "/2009/10/11/graphic-design-referenced/",
  "innerHTML": "<p>If you’ve never heard of Bryony Gomez-Palacio and Armin Vit they run the design network <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.underconsideration.com\">Under Construction</a> and are responsible for one of my all time favourite design blogs, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.underconsideration.com/brandnew/\">Brand New</a>. So when I heard they were releasing a new book “<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.underconsideration.com/graphicdesignreferenced/\">Graphic Design Referenced</a>“ I knew I would be buying it immediately.</p>\n<blockquote>\n<p>Graphic Design, Referenced is a visual and informational guide to the most commonly referenced terms, historical moments, landmark projects, and influential practitioners in the field of graphic design.</p>\n</blockquote>\n<p>The book starts with an ambitious but aptly titled “humble timeline” starting with the Arts and Crafts movement, through De Stijl and right up to the dot-com bubble. Certainly seems accurate allthough I only got half way through Richard Holis’ <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.amazon.co.uk/Graphic-Design-Concise-History-World/dp/0500203474/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1255267766&amp;sr=8-1-spell\">Graphic Design: A Concise History</a> during Fresher’s week so I can’t be sure.</p>\n<p>After the timeline the book split into four sections, Principles, Knowledge, Representatives, and Practice, so I’m going to review each section like so:</p>\n<h3 id=\"principles-p20-\">Principles (p20)</h3>\n<p>Speaking of University I wish this book was around when I went because it covers a lot of the core design principles and disciplines of design, typography, and print. I could probably list these things in my sleep now but it’s certainly nice to have a refresher. That’s about it for this seciton. A thorough introduction.</p>\n<p><strong>Rating: 9/10</strong></p>\n<h3 id=\"knowledge-p90-\">Knowledge (p90)</h3>\n<p>This section showcases knowledge, firstly on paper - journals, magazines and books - look! there’s Richard Holis, I promise I’ll read your book soon. Then we move online - blogs, forums etc. Don’t see my blog introduced for some reason. While some of the books are fairly old they’re still relevant and available. I wonder how many of these websites will be accessible in 5 or 10 years?</p>\n<p>We are now treated to a rather short list of museums &amp; archives (16 wordwide). I would have liked to see a longer list considering I could probably name that many in London alone. Finally the section finishes with knowledge in schools. Or more precisely American universities. That was disappointing.</p>\n<p><strong>Rating: 5/10</strong></p>\n<h3 id=\"representatives-p136-\">Representatives (p136)</h3>\n<p>The representatives section focuses on those individuals of outstanding innovation. This is a who’s who of historic and modern graphic design legends. I assume they’re leaving me out for the sequel. I remember many years ago when my parents finally told me I couldn’t be an astronaut I decided to apply for college. In the interview I was asked who was my inspiration in the design world. Being young and very unwise about design I didn’t have any heroes. I wish I could memorise these pages, go back in time and spout it all out. Overall a nice collection of designers.</p>\n<p><strong>Rating: 8/10</strong></p>\n<h3 id=\"practice-p250-\">Practice (p250)</h3>\n<p>Last but not least is graphic design work itself. The following 100+ pages feature some of the classic “posters, books, magazines, album covers, packaging, logos and identities” produced over the years. To be honest I kinda flicked through this part. If you really want to see examples of work then buy a book that focuses on a specific discipline.</p>\n<p>The reason I will go back and read this section however is the authors unique ability to analyse and comment on design, which is what makes their online blogs so good.</p>\n<p><strong>Rating: 6/10</strong></p>\n<h3 id=\"in-conclusion\">In Conclusion</h3>\n<p>The book certainly tries to take on more than a pit bull could chew. Though the authors freely admit that in the introduction (more elegantly of course). Regardless it does a remarkable job of cramming so much graphic design information into 400 pages. For design students, or just anyone who wants to understand the world of graphic design this is the book for you. It’s full of pictures too! For “graphic designers” like me, it’s a reassuring test and source of knowledge.</p>\n<p>Biggest selling points - The principles of typography are very extensive and throughout the book the authors never fail to add interesting and readable commentary.</p>\n<p>Weaknesses - the ambitious nature of the book falls apart during the knowledge section. The book and website listings are at best adequate, the list of museums is not extensive enough to deserve mentioning, and the knowledge in classrooms looks like a prospectus for American universities.</p>\n<p><strong>Final rating: hmm… 7 out of 10.</strong></p>\n<p>Good show! Money quote: “a must have book for designers”.</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.amazon.co.uk/Graphic-Design-Referenced-Language-Applications/dp/1592534473/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1255270425&amp;sr=8-1\">Go buy it »</a></p>\n",
  "pageExcerpt": "If you’ve never heard of Bryony Gomez-Palacio and Armin Vit they run the design network Under Construction and are responsible for one of my all time favourite design blogs, Brand New. So when I heard they were releasing a new book “Graphic Design Referenced“ I knew I would be buying it immediately.\n\nGraphic Design, Referenced is […]",
  "pageTitle": "Graphic Design Referenced – David Bushell – Web Design (UK)"
}