{
  "pagePath": "/blog/page/30/",
  "pageHeading": "Blog (page 30)",
  "excerpts": [
    {
      "id": "reflecting-on-aesthetics",
      "title": "Reflecting on Aesthetics",
      "href": "/2011/01/16/reflecting-on-aesthetics/",
      "body": "This past month I’ve focused solely on the accessibility and usability of web design. I’ve spent a long time considering how this fits into my daily practice, for real clients and personal projects, and all the ideals, limitations and opportunities involved.\nIn my article Transitioning as a Web Designer I sum up a very practical evolution […]",
      "date": 1295221386000
    },
    {
      "id": "transitioning-as-a-web-designer",
      "title": "Transitioning as a Web Designer",
      "href": "/2011/01/15/transitioning-as-a-web-designer/",
      "body": "“Web Designer” is one of the most exciting job titles in the design category. That’s because — and bear with me here — what was once an acceptable website design in a particular year may no longer be acceptable to produce the next.\nFor the last couple of years at Base Creative I’ve been designing fixed-width […]",
      "date": 1295128664000
    },
    {
      "id": "happy-new-ye-oh",
      "title": "Happy New Ye…oh",
      "href": "/2011/01/09/happy-new-ye-oh/",
      "body": "Ah, it’s the 9th already?\nI don’t do New Year’s resolutions, but I do like to look forward every now and then to consider all the amazing opportunities out there. 2011 is going to be all about pushing boundaries in life and work.\n(Not sure what that means in reality but I’ve plenty of time to find […]",
      "date": 1294616151000
    },
    {
      "id": "2010-in-design",
      "title": "2010 in Design",
      "href": "/2010/12/14/2010-in-design/",
      "body": "Funny how things never turn out how you expect them to.\nRewind a year and I find myself planning a big twenty-ten. After completing a very solid year in my pro web design career, 2010 was suppose to be all about exploring past passions in art and crafts. Replacing the mouse with a paint brush and […]",
      "date": 1292365598000
    },
    {
      "id": "walking-on-air",
      "title": "Walking on Air",
      "href": "/2010/12/01/walking-on-air/",
      "body": "I’m in a genuinely positive mood this evening, partially because dbushell.com survived another automatic WordPress update* but mainly because my MacBook Air arrived today!\nSince this is the first laptop I have ever owned I’m not going to write a comprehensive product review but I’d like to point out a few things that are brilliant:\n\nThe multi-touch pad works amazingly […]",
      "date": 1291245027000
    },
    {
      "id": "the-visual-hierarchy",
      "title": "The Visual Hierarchy",
      "href": "/2010/11/22/the-visual-hierarchy/",
      "body": "I’ve written a little web design article for Base Creative.\nHere’s a snippet:\n\nThere is more to design than making things look attractive and truth be told that’s the easy part. In regards to web design the actual aesthetics of a website have very little bearing on its success. Style is superficial and becomes more subjective the heavier […]",
      "date": 1290456967000
    },
    {
      "id": "when-free-fonts-arent-free",
      "title": "When Free Fonts Aren’t Free",
      "href": "/2010/11/18/when-free-fonts-arent-free/",
      "body": "Font Squirrel is one of the best online resources for finding high quality (and almost free) fonts. I do rate it very highly, and @font-face generator is the work of magic elves in my opinion.\n\n“Font Squirrel is your best resource for FREE, hand-picked, high-quality, commercial-use fonts. Even if that means we send you elsewhere to […]",
      "date": 1290090331000
    }
  ],
  "nextPage": "/blog/page/31/",
  "prevPage": "/blog/page/29/",
  "pageTitle": "Blog (page 30) – David Bushell – Web Design (UK)"
}