{
  "dateUnix": 1310471846000,
  "dateFormatted": "Tuesday 12 Jul 2011",
  "pageHeading": "Solving a Problem like Change",
  "pagePath": "/2011/07/12/solving-a-problem-like-change/",
  "innerHTML": "<p>A while back the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://gawker.com\"><strong>Gawker</strong></a>network redesigned their line-up and the Internet revolted. It was bad, very _very _bad. The design, the usability, the technical implementation—it had people scratching their heads.</p>\n<p>Yesterday <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://techcrunch.com\"><strong>TechCrunch</strong></a>launched a redesign and, well, it’s not quite ‘a Gawker’.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/07/techcrunch.png\" alt=\"New TechCrunch Logo &amp; Website Design\"></p>\n<blockquote>\n<p>We used AOL Paint, which comes free on the AOL CD and has this sweet UltraLogoMatic2000 feature.</p>\n</blockquote>\n<p>To their credit TechCrunch recognised the inevitable backlash and posted several witty, self-deprecating (at the same time ‘fuck you’) style posts in true TC fashion. An entertaining and on-brand launch that threw a proactive punch towards the change haters. As anyone in the <del>design industry</del> world knows: <strong>people don’t like change</strong>.</p>\n<p>The problem is how do you separate real feedback from the hate bandwagon? More importantly—because design feedback at this stage is irrelevant—how do you actually launch a large scale refresh without the expected onslaught?</p>\n<p>TechCrunch came out with a strong ‘don’t care’ attitude, but that’s not a universal solution and it will never play to everyone’s taste. It also doesn’t change the fact that the new design really_ isn’t that good_. There’s a telling quote from the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://techcrunch.com/2011/07/11/redesigning-techcrunch-we-picked-this-logo-just-to-piss-you-off/\">launch article</a>: <em>“After our eighth rejected visual design…”</em>. Eight rejected designs? Now granted, I’ve never lead a design project under the gaze of a giant like AOL, but surely if a project gets that far it’s undoubtedly suffering from disastrous managerial hands? Personally I’m indifferent to the new design. As a website it’s no better, no worse than the old. It’s just <em>different</em>.</p>\n<h2 id=\"avoiding-change\">Avoiding Change</h2>\n<p>What’s the solution? You have to avoid the need for drastic change to begin with.</p>\n<p>Continually access and iterate; don’t allow your website to get behind. That’s not to say you should create a redesign and then release elements slowly, I’m saying you should <strong>never</strong> need a major overhaul of the same website and brand to catch up. Websites aren’t like physical products. Updates should be frequent and fluid with no identifiable steps between versions. Take a leaf from Google’s book.</p>\n<p>Designers like to call this realigning (as oppose to redesigning). But it’s more than that; recognise changes in technology, users, content strategy and popular trends and react to them quickly.</p>\n<p>The old TechCrunch had fallen behind. It looked like a website from a past era (just a few years on the web timeline). When this happens bureaucracy creeps in and the dreaded redesign leads to the same inevitable result. The real issues aren’t addressed and any <em>changes</em> are purely subjective.</p>\n<p>What if you do fall behind?</p>\n<p>You play catch-up, you release <em>too</em> much and you take the criticism and move on. Just avoid ‘a Gawker’.</p>\n",
  "pageExcerpt": "A while back the Gawkernetwork redesigned their line-up and the Internet revolted. It was bad, very _very _bad. The design, the usability, the technical implementation—it had people scratching their heads.\nYesterday TechCrunchlaunched a redesign and, well, it’s not quite ‘a Gawker’.\n\n\nWe used AOL Paint, which comes free on the AOL CD and has this sweet UltraLogoMatic2000 […]",
  "pageTitle": "Solving a Problem like Change – David Bushell – Web Design (UK)"
}