{
  "pagePath": "/blog/page/15/",
  "pageHeading": "Blog (page 15)",
  "excerpts": [
    {
      "id": "what-is-the-medium",
      "title": "What is the medium?",
      "href": "/2012/09/25/what-is-the-medium/",
      "body": "A must read on A List Apart: The Web Aesthetic, by Paul Robert Lloyd.\nThe article above is jam packed with goodness. I’ve been racking my brain this year trying to understand the web as a medium and Paul does a wonderfully succinct job of encapsulating that idea in a way that I’ve never quite managed.\nTo […]",
      "date": 1348612624000
    },
    {
      "id": "agile-website-design-and-development",
      "title": "Agile Website Design",
      "href": "/2012/09/17/agile-website-design-and-development/",
      "body": "At Browser we’ve been transitioning into an Agile development process.\nIf you know nothing about Agile, it involves breaking down a project into individual requirements and delivering them within an iterative release cycle. This not only allows for a feedback loop involving client and agency alike, but it also gives an evolving indication of time and […]",
      "date": 1347912776000
    },
    {
      "id": "im-bored-with-code",
      "title": "I’m bored with code",
      "href": "/2012/08/27/im-bored-with-code/",
      "body": "The state of the browser defines our freedom as website makers. Browsers are a constant source of frustration. For every step forward they take so does the horizon. New possibilities emerge; expectations are raised. What is seen as “modern” is always just beyond our ability. It has always been my desire to deliver websites at […]",
      "date": 1346101891000
    },
    {
      "id": "www",
      "title": "WWW",
      "href": "/2012/08/20/www/",
      "body": "I’ve been semi-offline for quite a while now. I took some weeks off to relax and enjoy the Olympics, so this is a short post to warm up my blogging fingers. (Not to suggest that — by jumping straight back behind the keyboard — I haven’t been inspired by the games, I’ve been running a […]",
      "date": 1345487654000
    },
    {
      "id": "re-social-media-buttons",
      "title": "Re: Social Media Buttons",
      "href": "/2012/07/20/re-social-media-buttons/",
      "body": ".net magazine recently published the Big question: should we drop social media buttons with opinions and anecdotes from various professionals.\nTwo common arguments against them are:\nPage load\n**Social widgets are massive. They’re effectively additional websites sandboxed within tiny iframes and most are poorly optimised. Facebook’s “like” button is appalling. This problem cannot be understated and I developed […]",
      "date": 1342787589000
    },
    {
      "id": "vector-graphics-retina-and-you",
      "title": "Vector graphics, Retina, and You",
      "href": "/2012/07/13/vector-graphics-retina-and-you/",
      "body": "It’s Friday 13th. It’s been a long and productive week, I’ll try to keep this light-hearted :)\nI’m going to use this post to combine two rants. One on the use of the word “Retina”, another on live conference tweeting. I saw this retweeted the other day:\n“I think CSS is our best vector-based drawing tool in […]",
      "date": 1342178920000
    },
    {
      "id": "on-the-tools-of-our-trade",
      "title": "On the tools of our trade",
      "href": "/2012/07/11/on-the-tools-of-our-trade/",
      "body": "This year I’ve been making a conscious effort to change my tune when discussing particular methodologies and tools used in our fine art of website making.\nWhen we launched Passenger Focus at Browser I wrote “A Responsive Design Case Study” and for me it’s the best article I’ve ever written on this blog. I present my […]",
      "date": 1342004458000
    }
  ],
  "nextPage": "/blog/page/16/",
  "prevPage": "/blog/page/14/",
  "pageTitle": "Blog (page 15) – David Bushell – Web Design (UK)"
}