{
  "pagePath": "/blog/page/15/",
  "pageHeading": "Blog (page 15)",
  "excerpts": [
    {
      "id": "design-books-for-sale",
      "title": "Design Books for Sale",
      "href": "/2012/10/29/design-books-for-sale/",
      "body": "Based in the UK? Like design, books, design books, book design?\nI’ve got just what you need. I’m selling a few of my design books. These are all top notch and have served me well (some since the uni days). Today I’m all digital and sadly have no room for a physical book collection. I want […]",
      "date": 1351547745000
    },
    {
      "id": "the-real-cost-of-retina",
      "title": "The Real Cost of Retina",
      "href": "/2012/10/23/the-real-cost-of-retina/",
      "body": "When the new iPad went on sale earlier this year the interest in high-resolution website design skyrocketed. We saw an influx of half-baked “Retina“ solutions.\nAlongside this the bigger picture — so to speak — of responsive images produced lengthy debate. We’re starting to see the fruits of that labour with a new picture element proposal. […]",
      "date": 1350997494000
    },
    {
      "id": "pikaday-javascript-datepicker",
      "title": "Pikaday: JavaScript datepicker",
      "href": "/2012/10/09/pikaday-javascript-datepicker/",
      "body": "Pikaday is a JavaScript datepicker with a light footprint and easy style-ability with modular CSS. It’s in ‘developer preview mode’ but already looking great:\n\n\n\n\n\nWhy now?\nBecause as much as we like open standards, the HTML5 input types lack browser support and are poorly implemented in places; see Chrome (22 as of writing) below:\n\n\nThis leaves us with […]",
      "date": 1349769790000
    },
    {
      "id": "groundhog-day",
      "title": "Groundhog Day",
      "href": "/2012/09/30/groundhog-day/",
      "body": "“ahhhhhh!”\n— is what I tweeted on this fine Sunday evening. (And some people choose not to follow me?) What provoked this dramatic outburst was every designers’ worst nightmare; a sudden urge to “redesign” their website.\nJune 2009, August 2009, June 2010, May 2011, February 2012. At this point the cycle is hardly a surprise and I […]",
      "date": 1349042155000
    },
    {
      "id": "what-is-the-medium",
      "title": "What is the medium?",
      "href": "/2012/09/25/what-is-the-medium/",
      "body": "A must read on A List Apart: The Web Aesthetic, by Paul Robert Lloyd.\nThe article above is jam packed with goodness. I’ve been racking my brain this year trying to understand the web as a medium and Paul does a wonderfully succinct job of encapsulating that idea in a way that I’ve never quite managed.\nTo […]",
      "date": 1348612624000
    },
    {
      "id": "agile-website-design-and-development",
      "title": "Agile Website Design",
      "href": "/2012/09/17/agile-website-design-and-development/",
      "body": "At Browser we’ve been transitioning into an Agile development process.\nIf you know nothing about Agile, it involves breaking down a project into individual requirements and delivering them within an iterative release cycle. This not only allows for a feedback loop involving client and agency alike, but it also gives an evolving indication of time and […]",
      "date": 1347912776000
    },
    {
      "id": "im-bored-with-code",
      "title": "I’m bored with code",
      "href": "/2012/08/27/im-bored-with-code/",
      "body": "The state of the browser defines our freedom as website makers. Browsers are a constant source of frustration. For every step forward they take so does the horizon. New possibilities emerge; expectations are raised. What is seen as “modern” is always just beyond our ability. It has always been my desire to deliver websites at […]",
      "date": 1346101891000
    }
  ],
  "nextPage": "/blog/page/16/",
  "prevPage": "/blog/page/14/",
  "pageTitle": "Blog (page 15) – David Bushell – Web Design (UK)"
}