{
  "pagePath": "/blog/page/2/",
  "pageHeading": "Blog (page 2)",
  "excerpts": [
    {
      "id": "a-morning-with-vuejs",
      "title": "A Morning with Vue.js",
      "href": "/2020/01/23/a-morning-with-vuejs/",
      "body": "I’m a React person but I’m not devoted to it. Honest! Earlier this week I found a morning to flirt with Vue.js.\n\nMy intention was to pen an article comparing the two frameworks. Upon reflection it feels somewhat pointless. Like React, Vue is primarily “focused on the view layer”. And like React, Vue does a pretty […]",
      "date": 1579773600000
    },
    {
      "id": "netlify-first-impressions",
      "title": "Netlify: First Impressions",
      "href": "/2020/01/15/netlify-first-impressions/",
      "body": "Netlify is hot right now. It’s been hot for a while. It’s on my list of tech I pretend to know when people ask. I assume it handles static site hosting and deployment.\n\nJAMstack is a popular/confusing term covering static sites and the new tech surrounding them. I’ve long adhered to such a philosophy for personal […]",
      "date": 1579082400000
    },
    {
      "id": "blogging-in-2020",
      "title": "Blogging in 2020",
      "href": "/2020/01/10/blogging-in-2020/",
      "body": "Hey, I went a whole year without blogging!\nI guess the streak is officially over. The lack of content here has weighed on me heavily considering how integral this blog has been to my career. Really, it was my true portfolio. It demonstrated much more than the glossy screenshots on other pages ever did. And now […]",
      "date": 1578650400000
    },
    {
      "id": "availability-september",
      "title": "Availability - September 2018",
      "href": "/2018/08/14/availability-september/",
      "body": "Hi there!\nDo you need an experienced front-end dev person who can also consult, design, and figure out back-end integration with minimal Slack gifs? Well good news! I have a surplus of time in September and I can build (almost) anything.\nYou can contact me to discuss projects, requirements, costs, the weather.\n",
      "date": 1534240800000
    },
    {
      "id": "pwa-progressive-web-apps",
      "title": "PWA: Progressive Web Apps",
      "href": "/2018/05/21/pwa-progressive-web-apps/",
      "body": "This website – dbushell.com – or dbushell.app if you like redirects – is now a progressive web app!\nWhat does that mean? Don’t let the fancy initialism deceive you. PWAs are websites first and foremost. But they can be installed like an app. What is meant by “app” depends on where it’s installed. As of writing […]",
      "date": 1526896800000
    },
    {
      "id": "react-redux-internationalisation",
      "title": "React & Redux - Internationalisation",
      "href": "/2018/04/05/react-redux-internationalisation/",
      "body": "Internationalisation, i18n, localisation – whatever you prefer – can be tricky if your code does not support the ability to translate user interface text.\nWhen writing React it’s easy to hard-code UI text right into the JavaScript. This is not good if your website or app needs to support multiple languages. Even if you only support […]",
      "date": 1522922400000
    },
    {
      "id": "codepen-snippets",
      "title": "CodePen Snippets",
      "href": "/2018/02/21/codepen-snippets/",
      "body": "I’ve started a new Code Snippets collection on CodePen. It will be populated with the little and sometimes peculiar CSS techniques I’ve used. Mostly CSS but with occasional JavaScript sprinkles. Progressively enhanced, of course.\nStuff like this styled range input:\n\n  See the Pen Styled input range (slider/progress) by David Bushell (@dbushell) on CodePen.\n\n\nWho would have […]",
      "date": 1519207200000
    }
  ],
  "nextPage": "/blog/page/3/",
  "prevPage": "/blog/",
  "pageTitle": "Blog (page 2) – David Bushell – Web Design (UK)"
}