{
  "dateUnix": 1316006024000,
  "dateFormatted": "Wednesday 14 Sep 2011",
  "pageHeading": "What is mobile?",
  "pagePath": "/2011/09/14/what-is-mobile/",
  "innerHTML": "<p>Have you ever seen someone walk down the street with a tower strapped to their back and a 24” flatscreen perched on one arm tweeting away? We can assert that anyone “mobile” is more than likely “small-screen” but there is still a strong distinction between the two. “Mobile” suggests either:</p>\n<ul>\n<li>use of a specific handheld device — each model too niche to consider individually for most practical web design decisions (if we subscribe to the “one web” philosophy, which we should).</li>\n<li>or “on the go” activity (a wild assertion to make).</li>\n<li>or even worse: a supposed segregated “mobile web”.</li>\n</ul>\n<p>Screen size is part of the <strong>user’s context</strong> that we <em>can</em> detect and make adjustments for, hence why it’s a huge part of <em>responsive design</em>. And though we can pretty much guarantee that no one is tapping away on their desktop while riding the bus, we cannot guess their actual situation or intention based on that knowledge alone. This leads to a few important considerations:</p>\n<ul>\n<li>Be careful of assuming browsing habits.</li>\n<li>Be careful of prioritising content and restricting functionality.</li>\n</ul>\n<p>In front-end development we do <em>feature</em> detection, not browser or device detection. In design we should be considering what knowledge we have in terms of the user and their context. In reality, we have very few hard facts about either.</p>\n<p>When designing websites we have to prioritise content by making a lot of assertions on what the user is trying to achieve. That’s somewhat easier for functionality-based websites where a single page may be dedicated to one task. For content-based websites this is a lot harder, particularly if there are business interests to push. Therefore any kind of restriction or removal of content &amp; functionality as a solution to improve usability on small-screens can only lead to user frustration; we’re trying to force them down a path they don’t necessarily want to take.</p>\n<p>We can’t escape the need to make guesses in web design, but we can escape the fallacies.</p>\n<p>“Mobile” is a term best reserved for native, one-device apps — something we should be very aware of when taking inspiration for small-screen website designs. I’m particularly fond of the <a href=\"http://stuffandnonsense.co.uk/projects/320andup/\">small-screen first</a> approach, not only because it makes both design &amp; development easier, but also because it so clearly disposes of the wrong ideas.</p>\n<p>For a practical example consider contact &amp; location details. We can make a guess that small-screen means mobile “on the go” and provide this information high up. A lot of websites do. But that doesn’t mean that on desktop — or more accurately large-screen — we should hide those details away on a hard to find “contact” page. From the limited user knowledge we have it’s just as likely the user is rushing out of their office and want to jot down a telephone number. Or perhaps they’re sat on a comfy couch, casually browsing for no particular reason.</p>\n<p>One last thing: a website is not an app. Though if you intend to use the web and its technologies to create a device-dependent, app-like “web app”, well, it’s not quite a website either. Hybrids are cool with me, just don’t promote them as both without recognising the intrinsic differences. They’re entirely different mediums.</p>\n",
  "pageExcerpt": "Have you ever seen someone walk down the street with a tower strapped to their back and a 24” flatscreen perched on one arm tweeting away? We can assert that anyone “mobile” is more than likely “small-screen” but there is still a strong distinction between the two. “Mobile” suggests either:\n\nuse of a specific handheld device […]",
  "pageTitle": "What is mobile? – David Bushell – Web Design (UK)"
}