{
  "dateUnix": 1251303084000,
  "dateFormatted": "Wednesday 26 Aug 2009",
  "pageHeading": "Redesign or Realign?",
  "pagePath": "/2009/08/26/redesign-or-realign/",
  "innerHTML": "<p>Over the past few years I’ve been continually developing my own “brand” - a consistent look and feel for my portfolio, CV, letterhead (never sent one), business cards (499 gathering dust), websites, mugs, t-shirts…</p>\n<p class=\"p--small u-dim\">Update 30th August 09 - New blog design online!</p>\n<p>From the beginning I’ve gone for the whole minimalist green/silver style. I think it has enough personality without being overpowering when combined with my varied portfolio work. The design style has evolved slowly and I’m rather happy with it especially this 2nd version of my website. However, I do think this blog leaves much to be desired (it was a slight after thought that I should be writing about my career choice).</p>\n<p>So – it’s time to realign!</p>\n<p>I’ve decided that as a web designer and aspiring writer this blog design just wont do. It’s a pitiful 500 pixels wide with 12pt text. That’s just not good enough for my high standards. The plan is not to redesign, but <strong>realign</strong> the blog part of my website with a new inspired layout and some traditional typography treatments.</p>\n<p>The title of this post was inspired by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.alistapart.com/articles/redesignrealign\">this article at A List Apart</a>. Worth a read.</p>\n<p>I just noticed my home page suggest this blog will be about all-things “web design” which is a complete lie to date, I’ll have to fix that. By which I mean either writing more web orientated articles, or just editing my home page. We’ll see.</p>\n",
  "pageExcerpt": "Over the past few years I’ve been continually developing my own “brand” - a consistent look and feel for my portfolio, CV, letterhead (never sent one), business cards (499 gathering dust), websites, mugs, t-shirts…\nUpdate 30th August 09 - New blog design online!\nFrom the beginning I’ve gone for the whole minimalist green/silver style. I think it […]",
  "pageTitle": "Redesign or Realign? – David Bushell – Web Design (UK)"
}