{
  "dateUnix": 1398087058000,
  "dateFormatted": "Monday 21 Apr 2014",
  "pageHeading": "Spring Refresh",
  "pagePath": "/2014/04/21/spring-refresh/",
  "innerHTML": "<p>Spring means several things to me: Easter, the conclusion of the football league, and the annual tradition of refreshing my personal website design. This year is more pertinent than usual being one year since <a href=\"/2013/02/04/a-new-home/\">I started freelancing</a>.</p>\n<p class=\"b-post__image\"><img src=\"/images/2014/04/home-page-comparison.png\" alt=\"dbushell.com home page design comparison (2013–2014)\"></p>\n\n\n\n\n<h2 id=\"no-more-logo\">No More Logo</h2>\n<p>I’ve ditched my logo. It was large and a little out-dated. I work independently, my name and face are my brand alongside my design aesthetic, so why do I need a logo too?</p>\n<p>My <a href=\"/showcase/origami-unfolded/\">origami crane</a> is another signature image. One that’s more attractive, versatile, and a piece of my design portfolio I’m especially fond of. Allowing this to become the primary visual focus has given my home page a new beautiful simplicity.</p>\n<p>Practically speaking the logo was unwieldy to design around. If an unimaginative person were to write <em>“The Laws of Web Design”</em> one might state <em>“the logo must appear in the top-left corner”</em>. Such boring convention encourages an equally unimaginative masthead to follow suit. By freeing myself of these constraints I became open to much more experimental ideas.</p>\n<h2 id=\"readable-content\">Readable Content</h2>\n<p>I adapted the fixed header concept I first developed for my <a href=\"/2014/02/17/introducing-tales/\">Tales WordPress theme</a>. It provides instant access to navigation and a subtle reminder of who I am. Importantly, it doesn’t dominate the top of every page. On larger viewports the website footer becomes a fixed sidebar off to the right. This brings my profile and recent content into view while allowing the current page to lead.</p>\n<p>Whilst tidying my web server the other day I noticed that my <a href=\"http://dbushell.com/origami.html\">original portfolio</a> from 2008 is still online. Look at how tiny that text is! My eyesight has no doubt deteriorated since, but my respect and understanding for web accessibility has increased at a far greater pace. With each iteration of my website I’ve strived to improve typography and reduce content density. I reckon this is my best iteration yet.</p>\n<h2 id=\"coming-soon-\">Coming Soon…</h2>\n<p>I’m still waiting for a few websites to launch before I update my <a href=\"/showcase/\">design portfolio</a> with more recent responsive case studies. I’m hoping for a big summer update.</p>\n<p>I’m also writing a front-end dev review to cover technical aspects of my new website. Expect that sooner!</p>\n",
  "pageExcerpt": "Spring means several things to me: Easter, the conclusion of the football league, and the annual tradition of refreshing my personal website design. This year is more pertinent than usual being one year since I started freelancing.\n\n\n\n\n\nNo More Logo\nI’ve ditched my logo. It was large and a little out-dated. I work independently, my name and […]",
  "pageTitle": "Spring Refresh – David Bushell – Web Design (UK)"
}