{
  "dateUnix": 1502791200000,
  "dateFormatted": "Tuesday 15 Aug 2017",
  "pageHeading": "#TIFU by deleting my work",
  "pagePath": "/2017/08/15/tifu-by-deleting-my-work/",
  "innerHTML": "<p>Ever get that feeling you’ve lost something?</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/scared-spongebob.gif\" alt=\"me after deleting two days’ work\"></p>\n<p>I’ve long been a paying user of CodePen. It’s nice for sharing snippets, quick mock-ups, or messing around with code. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://codepen.io/pro/projects\">CodePen Projects</a> is a newish addition. It provides a more complete development environment.</p>\n<p>A mini-project came along for a client that gave me the perfect excuse to try CodePen Projects.</p>\n<p>Development was smooth. Right up until my main JavaScript file disappeared. I can’t say for sure why. I was dragging files around. Renaming stuff. The UI started to feel a little clunky. I had several instances of the project open. All I know is my file had vanished. A bug? Most likely my own stupidity. No way of knowing for sure. All I know is there was a distinct lack of two day’s worth of JavaScript.</p>\n<p>It was good code too, I’d even commented it.</p>\n<p>The slow realisation that I may have to rewrite everything from memory was agonising. Refusing that fate, I thought long and hard…</p>\n<p>🤔</p>\n<p>Chrome’s cache!</p>\n<p>I navigated to <code>chrome://cache/</code> (in Chrome, obviously). A quick search found the JavaScript file I’d lost. I then converted the hex dump to binary (<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://stackoverflow.com/a/31616371\">this Stack Overflow answer</a> provided a solution). These hex dumps look like they can contain gzipped data, so an extra step may be necessary to decode. I didn’t have too.</p>\n<p>I’m very lucky!</p>\n<p>I’m also — for the time being — returning to my offline editor which can backup and commit to source control. I do love me some CodePen, it’s not to blame here, but for larger projects I’m not comfortable without backups.</p>\n<p>I was thinking of writing a script to make pulling files from the browser cache easier. But ensuring I’ll never need to again is time better spent.</p>\n<p>Be careful out there!</p>\n",
  "pageExcerpt": "Ever get that feeling you’ve lost something?\n\nI’ve long been a paying user of CodePen. It’s nice for sharing snippets, quick mock-ups, or messing around with code. CodePen Projects is a newish addition. It provides a more complete development environment.\nA mini-project came along for a client that gave me the perfect excuse to try CodePen Projects.\nDevelopment […]",
  "pageDesc": "I lost two days’ work 😱 (and restored it from Chrome’s cache 😅)",
  "pageTitle": "#TIFU by deleting my work – David Bushell – Web Design (UK)"
}