{
  "dateUnix": 1300139030000,
  "dateFormatted": "Monday 14 Mar 2011",
  "pageHeading": "Designing MyLifeListed",
  "pagePath": "/2011/03/14/designing-mylifelisted/",
  "innerHTML": "<p>Today I’m excited to see <a href=\"http://www.mylifelisted.com\">MyLifeListed</a> launch!</p>\n<p>We’ve been <em>very</em> busy at Base Creative designing &amp; developing the site. We’re glad to be part of such an exciting project. See for yourself:</p>\n<p><a href=\"/images/2011/03/mylifelisted.png\"><img src=\"/images/2011/03/mylifelisted-1024x671.png\" alt=\"MyLifeListed.com\"></a></p>\n<p>I’m going to write a more in-depth article on the design process of <a href=\"http://www.mylifelisted.com\">MyLifeListed</a> but since this is probably my favourite design project to date, here’s a few notes:</p>\n<h3 id=\"responsive-design-for-all-devices\">Responsive design for all devices</h3>\n<p><a href=\"http://www.mylifelisted.com\">MyLifeListed</a> was designed around a semi-fluid build allowing it to look great on iPads to large 30” monitors. It’s not 100% fluid, I set a min &amp; max width to maintain usability. I also made use of CSS media queries to prioritise content on smaller screens. The aim was to make best use of available space on multiple devices.</p>\n<p>Keeping all this in mind when designing was a challenge! You’ll notice the modular layout was very helpful, but the key is <strong>knowing how to code</strong>. It would be impossible to design such a complicated website without this knowledge.</p>\n<h3 id=\"hard-boiling-it\">Hard-boiling it</h3>\n<p>The idea of <em>“progressive enhancement”</em> is to design for a consistent experience across all browsers and then add a touch of eye-candy for the newer ones. Hardboiled design (evangelised by <a href=\"http://hardboiledwebdesign.com/samples/\">Andy Clarke</a>) says that you should take the opposite approach - design for the <strong>best</strong> possible experience, then work backwards no matter how difficult it may prove.</p>\n<p>When I started designing <a href=\"http://www.mylifelisted.com\">MyLifeListed</a> I quickly realised such a modern web app needed to push the limits of modern browsers and web standards. Why play it safe and design something that will work in IE6 through to Chrome 10 identically? If I took that approach I’d be doing a disservice to the longevity of the site.</p>\n<p>Instead, I decided to challenge my own building skills and aim for nothing but the best design and user experience. I think the result speaks for itself, it even looks great in IE7!</p>\n<h3 id=\"and-more-\">And more…</h3>\n<p>I could go on forever about the whole design process – and I will – but that’s enough for now. Make sure you signup to <a href=\"http://www.mylifelisted.com\">MyLifeListed</a> and let me know what you think!</p>\n",
  "pageExcerpt": "Today I’m excited to see MyLifeListed launch!\nWe’ve been very busy at Base Creative designing &amp; developing the site. We’re glad to be part of such an exciting project. See for yourself:\n\nI’m going to write a more in-depth article on the design process of MyLifeListed but since this is probably my favourite design project to date, […]",
  "pageTitle": "Designing MyLifeListed – David Bushell – Web Design (UK)"
}