{
  "dateUnix": 1275216537000,
  "dateFormatted": "Sunday 30 May 2010",
  "pageHeading": "Pentagram Marks",
  "pagePath": "/2010/05/30/pentagram-marks/",
  "innerHTML": "<p>I just so happened to feature the book <a href=\"http://designheroes.co.uk/link/pentagram-marks\">Pentagram Marks on Design Heroes</a> a few weeks ago. Now that I’ve recieved a copy (birthday present) I though it deserved a full review! Click above, or read below:</p>\n<h3 id=\"my-review-of-pentagram-marks-\">My review of Pentagram Marks *</h3>\n<p><img src=\"http://designheroes.co.uk/file/dhp-2614.jpg\" alt=\"Pentagram Marks\"></p>\n<p><strong>Pentagram Marks</strong> arrived in the post this week!</p>\n<p>The book is delightfully smallish in stature at an estimated 7.5 x 6 inches and the 400 page depth adds enough weight that it feels important in your hand. The cover is double folded card with a matt finish in red. I’m not going to guess a Pantone but from an artistic point of view I can see hints of blue in there. Not to get too hung up on the red but it’s obviously been carefully chosen.</p>\n<p>The title is set in<strong> Pentagram’s</strong> logo font which I believe is <em>AT Modern Twenty</em> after a few googles. The word “Marks” is printed in the slightly-blueish-red tinted slightly lighter and also subtlety debossed, which adds a bit of class.</p>\n<p>The spine is perfectly minimalist, perfect bound, sans-serif, even the publishes logo looks good. The back cover is the pure red paper stock with a small white barcode sticker in the bottom right corner. This is also a nice touch.</p>\n<p>With the exception of the single page introduction the 400 pages consist of a logo centre stage, and bottom right: <em>organisation </em>(bold), <em>year</em> [of design], <em>description of organisation</em>. The layout is simple and does the job. It’s by no means a “classic” but it’s not over-designed either. Simplicity in design is hard to master. There are no page numbers, any questionable necessity would not justify their overshadowing presence on the page. I can imagine hours of debate over the smallest layout decision. Either that, or knowing those crafty Pentagram partners they probably knocked it up in 2 hours (show offs!).</p>\n<p>There are a couple of other interesting things to note. The logos are ordered alphabetically ascending by organisation name. I would have initially expected chronological order, but the more I think about it I’m beginning to agree with this choice. Logos should be timeless so suggesting “old” and “new” is unimportant. And now I realise exactly _why _this book doesn’t need page numbers. You’re only ever going to be referencing a particular logo from its name.</p>\n<p>Another point of note is the lack of a “designer” attribute. We are therefore forced to see <strong>Pentagram </strong>as a single entity, and not a collective of ever changing partners.</p>\n<p>The logos are presented in black and white:</p>\n<p class=\"quote\">“Isolating them in black and white helps us appreciate these marks as unique formal solutions, and highlights the contrasts and occasional similarities among them.”</p>\n\n<p>To suggest that all 400 logos are classics of design would be rather silly. Some of the logos are downright awful. But then you flick past the <a href=\"http://www.vam.ac.uk/\">V&amp;A</a> logo you understand why Pentagram has published their own logo book. There are a few pleasant touches, such as Puffin Books and Penguin Books facing each other on facing pages. No sloppy editing here.</p>\n<p>I should note this is a review of the mass print paperback version. The limited 1000 print edition is at least twice as lovely. Check out the <a href=\"http://www.logodesignlove.com/pentagram-marks\">Logo Design Love - Pentagram Marks</a> blog post to see it in full-colour photo glory.</p>\n<p>You can buy <a href=\"http://www.amazon.co.uk/gp/product/1856696685\">Pentagram Marks on Amazon</a>.</p>\n<p class=\"note\">* This review was originally publishes on <a href=\"http://designheroes.co.uk/link/pentagram-marks\">Design Heroes</a>.</p>\n\n",
  "pageExcerpt": "I just so happened to feature the book Pentagram Marks on Design Heroes a few weeks ago. Now that I’ve recieved a copy (birthday present) I though it deserved a full review! Click above, or read below:\nMy review of Pentagram Marks *\n\nPentagram Marks arrived in the post this week!\nThe book is delightfully smallish in stature […]",
  "pageTitle": "Pentagram Marks – David Bushell – Web Design (UK)"
}