{
  "dateUnix": 1348612624000,
  "dateFormatted": "Tuesday 25 Sep 2012",
  "pageHeading": "What is the medium?",
  "pagePath": "/2012/09/25/what-is-the-medium/",
  "innerHTML": "<p><strong>A must read on <a href=\"http://www.alistapart.com/articles/the-web-aesthetic/\">A List Apart: The Web Aesthetic</a>, by Paul Robert Lloyd.</strong></p>\n<p>The article above is <em>jam packed</em> with goodness. I’ve been racking my brain this year trying to understand the web as a medium and Paul does a wonderfully succinct job of encapsulating that idea in a way that I’ve never quite managed.</p>\n<blockquote><p>To properly design for a medium, you need to understand it. I like to think of the web as a kind of material, with unique characteristics we can take advantage of, and limits it can reach before it breaks.</p></blockquote>\n\n\n<p>And it’s got me thinking.</p>\n<h3 id=\"access\">Access</h3>\n<p>As last year neared closing time I spent a quiet day contemplating some of the challenges I would face after the winter festivities had past. <a href=\"https://dbushell.com/2011/12/15/web-design-2012-and-beyond/\">I wrote three points</a>.</p>\n<p>_Accessibility — _in respect to devices — was the first. This one was obvious. The whole industry had become obsessed with responsive design the year before (2010). My second point, <em>Screen Resolution and Scalable Graphics</em>, was also a logical conclusion and it has featured significantly in this year’s discourse.</p>\n<h3 id=\"visuals\">Visuals</h3>\n<p>As 2012 has progressed I’ve had a growing feeling that there is something not quite right with the recent focus on “responsive images”. Paul hits the nail of the head:</p>\n<blockquote><p>In seeking design solutions to this problem, we could create an aesthetic more appropriate to the medium—and perhaps realize that the responsive image problem only exists because our design conventions remain rooted in print.</p></blockquote>\n\n\n<p>I would not go as far as to suggest images are simply wrong for the web, but trying to crowbar them in to suit an old way of design thinking does not get to the root of the problem. We do need something, be it a <a href=\"http://dvcs.w3.org/hg/html-proposals/raw-file/tip/responsive-images/responsive-images.html\">picture element</a> or not, but <strong>far less so than we think</strong>. Equally I have felt that over emphasis on content and typographic design that <a href=\"https://dbushell.com/2012/05/26/the-restriction-of-type/\">many have explored</a> leaves something to be desired. It doesn’t abuse the medium, but neither does it take advantage of it.</p>\n<h3 id=\"state\">State</h3>\n<p>The final point I made was: <em>Interactivity</em>. That I found difficult to pin down but now I feel a sense of clarity emerging. Websites are interactive in their nature, therefore whenever we try to design a single state we’re ignoring the before and after. When you begin to focus design on <em>user journeys</em> and <em>interactions</em> the print aesthetic quickly evaporates. As I’ve become more immersed in an <a href=\"https://dbushell.com/2012/09/17/agile-website-design-and-development/\">agile and iterative workflow</a> I’ve started to see websites for what they are.</p>\n<p>Websites share the content we see in printed publications, the voices we hear in advertisement, and the functionality we use in applications. We have to deliver on all of these fronts on a medium that cannot replicate any of them to their fullest. Technical limitations aside, these requirements contrast more often than they compliment.</p>\n<p>Perhaps the mistakes made time and time again in website design are not due to ignorance but to the fact that the medium is inadequate for what is being asked of it?</p>\n<p>Or on the contrary, as Paul suggests and I’m inclined to agree, perhaps we’re asking too much to begin with. Instead of trying to shape the web into something it’s not we should instead identify the true “web aesthetic”. When we try to achieve this however, we are faced with an uneasy truth; the<strong> web changes as much as it remains the same</strong>.</p>\n<p>Paul concludes his article:</p>\n<blockquote><p>As we enter the third decade of the web’s existence, we should be gaining a sense of what works, and what doesn’t. We should now have the confidence to choose which aspects of other media and platforms to take inspiration from, and which to ignore.</p></blockquote>\n\n\n<p>I agree to an extent but in terms of a true aesthetic, <em>what works and what doesn’t</em> is time sensitive. I think I’ve been missing a fourth cornerstone:</p>\n<h3 id=\"time\">Time</h3>\n<p>Can we produce a design that evolves over <em>time</em>? Website makers should already be well versed in the art of progressive enhancement. A development technique that allow us to deliver the cutting edge while still maintaining support for the past. With this we’re effectively creating a website that changes in style and functionality to suit the technology snapshot that’s viewing it. Many developers are becoming quite adept at this practice, but how many designers are questioning just how far into the future it’s possible to go?</p>\n<p>Regardless of what’s practical, the medium we’re looking for lies somewhere within this timeline. The aesthetic changes based on the limitations we’re dealt. <strong>It’s not a constant.</strong> A project’s budget ultimately defines what we can produce. User statistics define legacy support. Anything left — which is rarely much — enables future exploration.</p>\n<p>For this reason I believe we need to be much more ruthless with progression enhancement if we’re aiming to deliver an aesthetic that stands the test of time. More to the point, graceful degradation should be rapid, quickly descending into a <em>loss</em> of aesthetic. We can reach indefinitely back if we condense our historical snapshot into an <em>accessible</em> format rather than yesterday’s design. We’ve been right to honour the fundamental principle of universal access but wrong to maintain the idea of a universal aesthetic. That changes with technology and trends. Just like fashion it becomes outdated easily.</p>\n<p>If we accept <em>time</em> as a factor we can begin the understand the medium. We can find an appropriate aesthetic that evolves until the next cycle.</p>\n",
  "pageExcerpt": "A must read on A List Apart: The Web Aesthetic, by Paul Robert Lloyd.\nThe article above is jam packed with goodness. I’ve been racking my brain this year trying to understand the web as a medium and Paul does a wonderfully succinct job of encapsulating that idea in a way that I’ve never quite managed.\nTo […]",
  "pageTitle": "What is the medium? – David Bushell – Web Design (UK)"
}