{
  "dateUnix": 1349042155000,
  "dateFormatted": "Sunday 30 Sep 2012",
  "pageHeading": "Groundhog Day",
  "pagePath": "/2012/09/30/groundhog-day/",
  "innerHTML": "<p>“ahhhhhh!”</p>\n<p>— is what I <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell/status/252499830750982144\">tweeted</a> on this fine Sunday evening. (And some people choose not to follow me?) What provoked this dramatic outburst was every designers’ worst nightmare; a sudden urge to “redesign” their website.</p>\n<p><a href=\"/2009/06/06/website-update/\">June 2009</a>, <a href=\"/2009/08/26/redesign-or-realign/\">August 2009</a>, <a href=\"/2010/06/26/dbushell-v4/\">June 2010</a>, <a href=\"/2011/05/25/designing-a-new-me/\">May 2011</a>, <a href=\"/2012/02/27/spring-cleaning-redesigning-dbushell-com/\">February 2012</a>. At this point the cycle is hardly a surprise and I guess I should embrace the prospect rather than tweet about it. Last time I said:</p>\n<blockquote><p>A complete overhaul of the build and a touch of class to the design. You’re seeing it now (unless you’ve arrived here from a future redesign. In that case, how long did this one last?)</p></blockquote>\n\n\n<p>About seven months then? I’m actually <em>really</em> happy with my current iteration. It concluded an idea and style I’d be honing for several years. At some point along the journey I even stumbling upon the value of adding screenshots to each launch article (makes for a less confusing read in retrospective).</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/09/dbushell-iterations.png\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/09/dbushell-iterations.png\" alt=\"dbushell.com design iterations\"></a></p>\n\n<p>So why the change of heart?</p>\n<p>I just feel there’s something too <em>formal</em> about this design. It’s too easy. At every angle it says “blog” and that’s boring. A product rooted firmly in history. In one sense this design does a perfect job — analytics and feedback agree — and I’ll feel hard pressed to let it go, but I also sense an opportunity to do something radical, something <a href=\"/2012/09/25/what-is-the-medium/\">positively modern</a> — that I can’t ignore.</p>\n<p>Whatever _is_ next will be online soon. I’ve already built an early prototype and I like where it is going. This is my biggest platform to experiment with and I know you’ll be very vocal about the result. I look forward to that! In the meantime, tell me your personal design story. I know I’m not the only redesign addict.</p>\n",
  "pageExcerpt": "“ahhhhhh!”\n— is what I tweeted on this fine Sunday evening. (And some people choose not to follow me?) What provoked this dramatic outburst was every designers’ worst nightmare; a sudden urge to “redesign” their website.\nJune 2009, August 2009, June 2010, May 2011, February 2012. At this point the cycle is hardly a surprise and I […]",
  "pageTitle": "Groundhog Day – David Bushell – Web Design (UK)"
}