{
  "dateUnix": 1333458611000,
  "dateFormatted": "Tuesday 3 Apr 2012",
  "pageHeading": "SVG, Use it Already",
  "pagePath": "/2012/04/03/svg-use-it-already/",
  "innerHTML": "<p>Here’s the deal: there’s no reasonable excuse to avoid using SVG for vector graphics on the Web (with a PNG fallback, primarily for IE &lt; 9 and older Android).</p>\n<p>While there are legitimate design problems when using one single file with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.pushing-pixels.org/2011/11/04/about-those-vector-icons.html\">icons at multiple sizes</a>, this is not unique to SVG and in the land of — for all intents and purposes — <strong>infinite zoom levels and resolution densities</strong>, retreating back to a single “pixel-perfect” bitmap is not a better option. Cross browser support for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://my.opera.com/ODIN/blog/2009/10/12/how-media-queries-allow-you-to-optimize-svg-icons-for-several-sizes\">media queries with SVG</a> may one day solve this issue. For now, just use multiple files for an icon used at vastly different sizes (you’d have to do that anyway with bitmaps).</p>\n<p>Have a look at The Font Bureau’s type specimen for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.fontbureau.com/NHG/specimens/\">Neue Haas Grotesk</a>. A perfect example of when SVG just makes sense. Another great place to start using SVG is with a website’s logo. That little brand mark that probably reigns in the top-left corner of a website? I’m sure the client would love to see that nice and crisp. Just do it already!</p>\n<p>I know SVG is not perfect. There’s no hinting; the holy grail of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://simurai.com/post/19895985870/icon-sharpness-limbo\">pixel-perfection</a> cannot be guaranteed. There’s annoying <a href=\"/2012/03/11/svg-all-fun-and-games/\">browser bugs</a> that potentially mess up the whole scalability thing. But when you actually compare an SVG to a PNG implementation across multiple devices there’s only one winner. A bitmap offers a single point at which it isn’t blurred, vectors increase that range indefinitely.</p>\n<p>When you consider the amazing things we’ll be doing with SVG in the future — <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://blogs.adobe.com/webplatform/2012/03/30/svg-animations-css-animations-css-transitions/\">animation and scripting</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://simurai.com/post/20251013889/svg-stacks\">sprite stacks</a> to name just two — <strong>it’s time to start learning now</strong>.</p>\n<h2 id=\"fallback-techniques\">Fallback Techniques</h2>\n<p>When using SVG with a CSS <code>background-image</code> providing a fallback using the fine art of feature detection is very easy. Use <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://modernizr.com/\">Modernizr</a> to add the <code>.svg</code> class to the <code>&lt;html&gt;</code> element then you have a hook to specify both sources. If the class is added before the default styles are applied modern browsers won’t download both images or flash any content (so put Modernizr in your <code>&lt;head&gt;</code>). If you decide to go PNG by default the rare case of no JavaScript and no SVG is covered.</p>\n<p>Using SVG with <code>&lt;img&gt;</code> elements is a little trickier if you require a bitmap fallback. Start studying the latest techniques for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.alistapart.com/articles/responsive-images-how-they-almost-worked-and-what-we-need/\">responsive images</a> and their <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/adamdbradley/foresight.js\">possible solutions</a>.</p>\n<p>SVG is here and it’s widely supported.</p>\n<p>Oh! By the way, if you do know a legitimate reason to avoid SVG leave a comment :)</p>\n",
  "pageExcerpt": "Here’s the deal: there’s no reasonable excuse to avoid using SVG for vector graphics on the Web (with a PNG fallback, primarily for IE &lt; 9 and older Android).\nWhile there are legitimate design problems when using one single file with icons at multiple sizes, this is not unique to SVG and in the land of […]",
  "pageTitle": "SVG, Use it Already – David Bushell – Web Design (UK)"
}