{
  "dateUnix": 1278523348000,
  "dateFormatted": "Wednesday 7 Jul 2010",
  "pageHeading": "HTML5 for Web Designers",
  "pagePath": "/2010/07/07/html5-for-web-designers/",
  "innerHTML": "<p>The latest addition to my design book library (well, shelf) is the much anticipated <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://books.alistapart.com/\">HTML5 for Web Designers</a> by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://adactio.com/\">Jeremy Keith</a>, published by A Book Apart.</p>\n<blockquote>\n<p>The HTML5 spec is 900 pages and hard to read. HTML5 for Web Designers is 85 pages and fun to read. Easy choice.</p>\n</blockquote>\n<p>I’ve been very excited to read this book not just because of the topic and author (both exciting in their own way), but also because of the connection to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.alistapart.com/\">A List Apart</a>, perhaps <em><strong>the</strong></em> website for web designers and developers.</p>\n<p>For me the first two chapters were the most rewarding. <em>“A Brief History of Markup”</em> and <em>“The Design of HTML5”</em> give a great overview of the HTML5 language. It’s clear that Jeremy Keith has invested a lot of time following web standards and has a detailed knowledge of them.</p>\n<p>The following chapters dive into the audio/video tags, canvas, and the new form additions. If you’ve actively kept up to date with HTML5 there isn’t really much to learn here. It’s hard to recommend the book over free online resources like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://diveintohtml5.org/\">Dive Into HTML5</a> and the various excellent blog posts around (see A List Apart too). But saying that there is value in having such a reference at hand and I’d certainly pass it on to someone who has only worked in HTML 4.</p>\n<p>At £17 (that’s including shipping) I’d have to say it’s a very hefty price. The book is somewhat light on content to be fair. While I strongly value being clear and concise I think HTML5 for Web Designers has plenty of room for topics like drag and drop and browser storage which are quickly glossed over. Overall it’s well written and could be very informative depending on your current level of HTML5 understanding. I guess I probably don’t fit into the audience for this book having worked with HTML5 over the last year, though it did help reinforce a few uncertainties.</p>\n<p>The other reason I bought this book was the design by the much celebrated <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://jasonsantamaria.com/\">Jason Santa Maria</a>. The typography is outstanding! The design provides a perfect format for more to come from A Book Apart. Hopefully they’ll do a few collections because the shipping is a real killer.</p>\n",
  "pageExcerpt": "The latest addition to my design book library (well, shelf) is the much anticipated HTML5 for Web Designers by Jeremy Keith, published by A Book Apart.\n\nThe HTML5 spec is 900 pages and hard to read. HTML5 for Web Designers is 85 pages and fun to read. Easy choice.\n\nI’ve been very excited to read this book […]",
  "pageTitle": "HTML5 for Web Designers – David Bushell – Web Design (UK)"
}