{
  "pageHeading": "About David Bushell",
  "pagePath": "/about/",
  "innerHTML": "<p>Based in the UK, somewhere near Manchester, I design, build, and consult upon all things web for small businesses, start-ups, individuals, and fellow web agencies — all over the world. It’s quite a fun job if I’m honest.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/12/david-bushell1.jpg\" alt=\"David Bushell\"></p>\n<p>While I specialise in front-end development, my experience and knowledge covers the whole process. So if anyone asks, tell them <a href=\"/services/\">I make websites</a>.</p>\n<h3 id=\"my-philosophy\">My Philosophy</h3>\n<p>I create things online with longevity in mind. Designing for the future is profitable and leaves a lasting impression. Coding for performance leads to meaningful experiences and delighted users.</p>\n<p>I pride myself in a collaborative and considered process. A process that is agile and evolving. Iterative and effective. I like to give ideas an opportunity to develop. There is no <em>‘one size fits all’</em> solution but the answer is waiting to be discovered.</p>\n<h3 id=\"my-experience\">My Experience</h3>\n<p>I have over a decade of professional experience. It started, well, over a decade ago. The web and my work has changed a lot in that time.</p>\n<p>Prior to my life as a freelancer, and following graduation, I worked in London’s East End for five years at two digital agencies. I moved into a senior client-facing role taking on responsibility for most design and front-end development.</p>\n<p>During this time I worked with just about every type of client imaginable. From public sector departments, to small local businesses, and those in-between like charities and enthusiastic entrepreneurs. I found that a personable and attentive approach instilled confidence. Rather than trying to ‘sell’ a website I’d involve clients in the process to design it alongside us.</p>\n<p>In early 2013 I moved back up North to venture out as a freelancer. I kicked things off by speaking at the <a href=\"/2012/12/07/responsive-day-out/\">Responsive Day Out</a> conference in Brighton, UK. Since then I’ve continue to provide my skills to many web agencies and clients.</p>\n<p>On the web, I consider myself self-taught. Programming has fascinated me since the days of dial-up modems and floppy disks. My formal education is firmly rooted in the finer arts. I graduated with 1st class honours in Graphic Design at Cumbria University, UK.</p>\n<h3 id=\"my-work-online\">My Work Online</h3>\n<p>I write about what I do on <a href=\"/blog/\">my blog</a> and shares ideas, inspiration, and nonsense <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">@dbushell</a> on Twitter. I’ve written <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://smashingmagazine.com/author/david-bushell/\">articles</a> for industry leader <em>Smashing Magazine</em>. I host several popular open-source <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell\">projects on GitHub</a>. You can find me on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://codepen.io/dbushell/\">CodePen</a> where I play around with code.</p>\n<p>Any questions? <a href=\"/contact/\">Contact me</a>.</p>\n<hr>\n<p class=\"p--small u-dim\">On March 1st 2013 I spoke at the <a href=\"/2012/12/07/responsive-day-out/\">Responsive Day Out</a> conference in Brighton, UK. My profile photo was taken by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.flickr.com/photos/marcthiele/8519276774\">Marc Thiele</a> during my talk.</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">Follow me @dbushell</a></p>\n",
  "pageTitle": "About David Bushell – David Bushell – Web Design (UK)"
}