{
  "pageHeading": "About David Bushell",
  "pagePath": "/about/",
  "innerHTML": "<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/12/david-bushell1.jpg\" alt=\"David Bushell\"></p>\n\n<p>Based in the UK, somewhere near Manchester, I design and build websites as a freelancer for people all over the world.</p>\n<p>If I gave myself a job title I suppose it would be <em>Websitemaker</em>. It gets straight to the point. While I specialise in design and front-end, my experience and knowledge covers a whole lot more. So if anyone asks, tell them <a href=\"/services/\">I make websites</a>.</p>\n<blockquote>\n<p class=\"p--quote p--large\">What attracted ASE to David was his unique approach to understanding our requirement, and his ability to work with us in driving out the structure, design, and most importantly the key messages and calls to action that we needed from our new website.</p>\n<p class=\"p--small\"><cite>Chris King &ndash; ASE Consulting</cite></p>\n</blockquote>\n\n<h2 id=\"experience\">Experience</h2>\n<p>Prior to my freelancing life, immediately after graduation, I worked in London’s East End for five years for two digital agencies. I quickly moved into a senior client-facing role being responsible for all front-end code and design on many projects.</p>\n<p>During this time I worked with just about every client imaginable from the public sector departments to the small local businesses. I found that a personable and attentive approach to discussing a client’s business instilled trust. Rather than trying to “sell” a website design I’d involve clients in the process to design it alongside me.</p>\n<p>I went freelance early 2013 and kicked things off by speaking at the <a href=\"/2012/12/07/responsive-day-out/\">Responsive Day Out</a> conference. Since then I’ve provided my design and front-end development skills to many web agencies and clients.</p>\n<p>On the Web, I consider myself self-taught. Programming has fascinated me since the days of dial-up modems and floppy disks (this domain is over a decade old). My formal education is firmly rooted in the finer arts. I graduated with 1st class honours in Graphic Design at Cumbria University.</p>\n<p>I write about the web on <a href=\"/blog\">my blog</a> and shares ideas, inspiration, and nonsense <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">@dbushell</a>. I’ve also written <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://smashingmagazine.com/author/david-bushell/\">articles</a> for industry leader Smashing Magazine. I host several popular <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell\">projects on GitHub</a>. You can find me on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://codepen.io/dbushell/\">CodePen</a> where I play around with code.</p>\n<p>Any questions? <a href=\"/contact/\">Contact me</a>.</p>\n<h2 id=\"philosophy\">Philosophy</h2>\n<p>I create things for the web with longevity in mind. Designing for the future is profitable and leaves a lasting experience. While I’m not modest about my professional skills, what I pride myself in the most is the collaborative and thoughtful process I bring to my clients. This is the most enjoyable part of my job.</p>\n<h2 id=\"public-speaking\">Public Speaking</h2>\n<p>On March 1st 2013 I spoke at the <a href=\"/2012/12/07/responsive-day-out/\">Responsive Day Out</a> conference in Brighton, UK. My profile photo was taken by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.flickr.com/photos/marcthiele/8519276774\">Marc Thiele</a> during my talk.</p>\n<hr>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">Follow me on Twitter @dbushell</a></p>\n",
  "pageTitle": "About David Bushell – David Bushell – Web Design (UK)"
}