{
  "pagePath": "/blog/page/8/",
  "pageHeading": "Blog (page 8)",
  "excerpts": [
    {
      "id": "elbows-and-office-chairs",
      "title": "Elbows and Office Chairs",
      "href": "/2014/06/18/elbows-and-office-chairs/",
      "body": "It’s funny what you get used to.\nI migrated from an iPhone to a larger Android device many years back. Nowadays, squinting at a smaller mobile screen makes me feel a bit dizzy.\nWhen I started freelancing last year I moved in the opposite direction. At my old workplace I dual-wielded 24” monitors. Since then I’ve adapted to a single 13” MacBook […]",
      "date": 1403080210000
    },
    {
      "id": "dependency-overload",
      "title": "Dependency Overload",
      "href": "/2014/06/10/dependency-overload/",
      "body": "I employ an army of command line tools to aid my front-end development.\nTruth be told it’s a bit of an addiction. I’m constantly adding more tools that allow me to do less work. Am I in danger of overloading, of creating a system so convoluted that it evolves into a hindrance and defeats the point of its […]",
      "date": 1402408825000
    },
    {
      "id": "work-as-a-freelancer",
      "title": "Work as a Freelancer",
      "href": "/2014/06/02/work-as-a-freelancer/",
      "body": "It’s been over a year since I started freelancing and time has flown by in the most enjoyable of fashions. Work has been good and financially I hit my 12 month target — nothing specific or special; enough to get by. I didn’t expect to match my London salary nor have I but all balanced […]",
      "date": 1401726579000
    },
    {
      "id": "web-fonts-and-progressive-enhancements",
      "title": "Web Fonts & Enhancements",
      "href": "/2014/05/13/web-fonts-and-progressive-enhancements/",
      "body": "Yesterday I found myself thoroughly impressed with Laura Kalbag’s effort to ensure the Indie Tech Summit website remains well designed.\n\nIn the screenshot above you can see the page design before and after web fonts have loaded. This is a superb example of progressive enhancement.\nHad web fonts failed to load I wouldn’t have known otherwise. Of course, in comparison the preferred design look […]",
      "date": 1399976189000
    },
    {
      "id": "responsive-design-for-uwe-wittwer",
      "title": "Responsive Design for Uwe Wittwer",
      "href": "/2014/05/07/responsive-design-for-uwe-wittwer/",
      "body": "\nDavid immediately grasped our taste in design and our technical requirements for a modern, responsive design after only a short brief by mail and phone.\nKevin Mueller, Studio Manager for Uwe Wittwer\n\n\nAtelier Uwe Wittwer came to me in late 2013 requesting a new responsive design. With an ideal brief and a small but workable budget, I was […]",
      "date": 1399472897000
    },
    {
      "id": "two-week-build",
      "title": "Two Week Build",
      "href": "/2014/04/24/two-week-build/",
      "body": "From concept to launch the new version of my website clocked just over two weeks of development time. This article documents assorted aspects of that process.\nInitial Concept\n\nWhat you see above is the extent of my ’shopping for the new design. I probably wasted more time setting up those ridiculous guides than I did mocking up the visual concept. Still, for an […]",
      "date": 1398332871000
    },
    {
      "id": "spring-refresh",
      "title": "Spring Refresh",
      "href": "/2014/04/21/spring-refresh/",
      "body": "Spring means several things to me: Easter, the conclusion of the football league, and the annual tradition of refreshing my personal website design. This year is more pertinent than usual being one year since I started freelancing.\n\nNo More Logo\nI’ve ditched my logo. It was large and a little out-dated. I work independently, my name and face are my brand alongside my design aesthetic, […]",
      "date": 1398087058000
    }
  ],
  "nextPage": "/blog/page/9/",
  "prevPage": "/blog/page/7/",
  "pageTitle": "Blog (page 8) – David Bushell – Web Design (UK)"
}