{
  "pagePath": "/blog/page/8/",
  "pageHeading": "Blog (page 8)",
  "excerpts": [
    {
      "id": "css-fixed-positioning-and-mobile-zoom",
      "title": "CSS Fixed Positioning and Mobile Zoom",
      "href": "/2013/09/10/css-fixed-positioning-and-mobile-zoom/",
      "body": "The follow demo is a quick experiment! I’m not sharing code because it’s horrible and I don’t want emails asking if I’ve got it working on a Blackberry.\nMobile web browsers, unless otherwise informed, will assume a website has been designed for larger screens. They’ll render on a large canvas and zoom out. Responsive websites use […]",
      "date": 1378803681000
    },
    {
      "id": "reacting-to-the-resize",
      "title": "Reacting to the Resize",
      "href": "/2013/08/29/reacting-to-the-resize/",
      "body": "I’m building a client’s website design that is more aware of the viewport than usual. Page headers — think large typography with a background image — cover 100% of the initial view. So too does the navigation; five items presented overlaying the entire screen.\nFirst but not final\nWhen a page loads the first render — at […]",
      "date": 1377785694000
    },
    {
      "id": "responsive-design-for-kings-transfer",
      "title": "Responsive Design for King’s Transfer",
      "href": "/2013/08/09/responsive-design-for-kings-transfer/",
      "body": "The new King’s Transfer website has gone live. I worked on design and front-end development while Peter Mitchell took care of all things back-end.\nThis is my third in-depth responsive design case study and my first as a freelancer. I feel it’s my best work to-date and that’s due to a great client and a real […]",
      "date": 1376035715000
    },
    {
      "id": "progressive-viewports",
      "title": "Progressive Viewports",
      "href": "/2013/07/25/progressive-viewports/",
      "body": "Implementing off-canvas navigation requires a fair amount of effort in the realms of front-end performance and “viewport management” but the general principles are simple. Once you’ve cracked them you can create some brilliant responsive and interactive interfaces.\nViewport set-up\nI’ve decided to write a mostly high-level introduction here without getting bogged down in code. My Smashing Magazine […]",
      "date": 1374764334000
    },
    {
      "id": "open-responsibility",
      "title": "Open Responsibility",
      "href": "/2013/07/08/open-responsibility/",
      "body": "I like to be very “open”. I write about my ideas and experiences and I share code projects on GitHub. There are many reasons for this. High on that list are the improvements I gain as a professional in this industry.\nSharing Code\nSome of my projects like Pikaday are very mature. I’m keen to see them […]",
      "date": 1373281933000
    },
    {
      "id": "automated-accessibility-colour-contrast",
      "title": "Automated Accessibility: Colour Contrast",
      "href": "/2013/06/24/automated-accessibility-colour-contrast/",
      "body": "In my quest to automate my entire job I’ve moved into the realms of testing and accessibility checks. The W3C guidelines on accessibility contain a wealth of advice. Much of it would appear to be common sense. It should be a cornerstone of web design but unfortunately it’s often ignored with the focus on surface […]",
      "date": 1372089389000
    },
    {
      "id": "update-from-june-3rd",
      "title": "Update from June 3rd",
      "href": "/2013/06/20/update-from-june-3rd/",
      "body": "I received a shout-out in the “hot drama” section of Shop Talk Show (E073) — bucket list checked, I love those guys — however my point was somewhat missed I feel.\nOn June 3rd I wrote an article entitled The Raster Image Paradox which prompted a response from Tim Kadlec on Why We Need Responsive Images […]",
      "date": 1371715773000
    }
  ],
  "nextPage": "/blog/page/9/",
  "prevPage": "/blog/page/7/",
  "pageTitle": "Blog (page 8) – David Bushell – Web Design (UK)"
}