{
  "pagePath": "/blog/page/8/",
  "pageHeading": "Blog (page 8)",
  "excerpts": [
    {
      "id": "what-is-wrong-with-this-message",
      "title": "What is wrong with this message?",
      "href": "/2013/11/14/what-is-wrong-with-this-message/",
      "body": "Nobody said microcopy was easy…\nWhile catching up with my Twitter feed I follow a link to Google+ — appears to show signs of life within the tech community — and I’m greeted with this wonderful message:\n\n\n“Your profile has been suspended because it impersonates someone.”\nA straight up accusation of potentially illegal acts. There’s no ambiguity, I’m […]",
      "date": 1384434839000
    },
    {
      "id": "form-label-design",
      "title": "Form Label Design",
      "href": "/2013/11/08/form-label-design/",
      "body": "Web forms are often a tedious experience. There’s a lot to be said for keeping questions to a minimum. Do I really need to enter my name across three fields, can’t you just call me “Dave”?\nTo save space and reduce visual noise it’s become quite common to repurpose HTML placeholders. But as we should all […]",
      "date": 1383909303000
    },
    {
      "id": "browser-support-again",
      "title": "Browser Support, Again",
      "href": "/2013/11/06/browser-support-again/",
      "body": "With a high-profile portfolio of websites like Google Apps dropping support for IE9 the question of browser support inevitably resurfaces. Many will see this news as justification for their own abandonment of a legacy browser.\nAs I’ve said time and time again, external decisions and aggregated statistics are irrelevant if you have specific numbers for a […]",
      "date": 1383736927000
    },
    {
      "id": "front-end-style-guides",
      "title": "Front-end Style Guides",
      "href": "/2013/11/05/front-end-style-guides/",
      "body": "I’ve just read Front-end Style Guides written by Anna Debenham, published by Five Simple Steps. As a thorough overview of all that the title suggests the book sets a practical mindset for utilising style guides with many examples (and at £2.40; an absolute steal).\nStyle guides are critical to how I make websites.\nMy design &amp; build […]",
      "date": 1383666952000
    },
    {
      "id": "css-fixed-positioning-and-mobile-zoom",
      "title": "CSS Fixed Positioning and Mobile Zoom",
      "href": "/2013/09/10/css-fixed-positioning-and-mobile-zoom/",
      "body": "The follow demo is a quick experiment! I’m not sharing code because it’s horrible and I don’t want emails asking if I’ve got it working on a Blackberry.\nMobile web browsers, unless otherwise informed, will assume a website has been designed for larger screens. They’ll render on a large canvas and zoom out. Responsive websites use […]",
      "date": 1378803681000
    },
    {
      "id": "reacting-to-the-resize",
      "title": "Reacting to the Resize",
      "href": "/2013/08/29/reacting-to-the-resize/",
      "body": "I’m building a client’s website design that is more aware of the viewport than usual. Page headers — think large typography with a background image — cover 100% of the initial view. So too does the navigation; five items presented overlaying the entire screen.\nFirst but not final\nWhen a page loads the first render — at […]",
      "date": 1377785694000
    },
    {
      "id": "responsive-design-for-kings-transfer",
      "title": "Responsive Design for King’s Transfer",
      "href": "/2013/08/09/responsive-design-for-kings-transfer/",
      "body": "The new King’s Transfer website has gone live. I worked on design and front-end development while Peter Mitchell took care of all things back-end.\nThis is my third in-depth responsive design case study and my first as a freelancer. I feel it’s my best work to-date and that’s due to a great client and a real […]",
      "date": 1376035715000
    }
  ],
  "nextPage": "/blog/page/9/",
  "prevPage": "/blog/page/7/",
  "pageTitle": "Blog (page 8) – David Bushell – Web Design (UK)"
}