{
  "dateUnix": 1357082499000,
  "dateFormatted": "Tuesday 1 Jan 2013",
  "pageHeading": "5 Tips for Responsive Builds",
  "pagePath": "/2013/01/01/five-tips-for-responsive-builds/",
  "innerHTML": "<p>If design and content strategy stops when the build phase starts it’s time to rethink your process. The role of a modern front-end developer goes beyond following pre-defined blueprints. An iterative, agile-like approach is vital to account for responsive design challenges that inevitably arise as a website takes shape.</p>\n<p>With that in mind here are my 5 tips for responsive builds:</p>\n<h2 id=\"1-utilise-breakpoint-zero\">1. Utilise breakpoint zero</h2>\n<p>Start by writing HTML in a semantic and hierarchical order. This is dictated by content priority, and a bit of common sense. Apply the basic styles but don’t go beyond the default vertical flow. Now as you start to add layout for progressively larger viewports you can address content issues immediately. What gets shunted off screen? What elements are being orphaned? Where is context being lost as the viewport scrolls and content breaks apart? Address these issues now and after every iteration. It will only get harder to reorganise later on.</p>\n<h2 id=\"2-maintain-a-pattern-library\">2. Maintain a pattern library</h2>\n<p>This is a single page where you can dump all components: typography, menus, forms, feature boxes, content modules etc. A place where design meets implementation. It’s your website’s melting pot. A handy repository that helps keep visual design consistent and code maintainable. I’ve written previously on <a href=\"/2012/04/23/modularity-and-style-guides/\">modularity and style guides</a>. See this <a href=\"/2012/06/17/passenger-focus-responsive-web-design-case-study/\">case study</a> for an example.</p>\n<h2 id=\"3-stay-proportional-to-text\">3. Stay proportional to text</h2>\n<p>Content is king. Content is text (mostly). Every aspect of a responsive design revolves around the space available for it. A browser’s base font size is <strong>user defined</strong>. That means everything from margins to media queries should adjust accordingly. Use <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/css3-values/#relative-lengths\">relative units</a> across your CSS to maintain this relationship. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://blog.cloudfour.com/the-ems-have-it-proportional-media-queries-ftw/\">“The EMs have it”</a> by <em>Lyza Gardner</em> is an excellent guide. Using pixel units in media queries only limits a website’s responsiveness.</p>\n<h2 id=\"4-remember-what-youre-testing\">4. Remember what you’re testing</h2>\n<p>Test your build in multiple browsers as often as you save code (for me that’s every few minutes). <strong>Resize your browser</strong> across the full spectrum. Don’t mess around with novelty iframes that try to mimic viewport size for “mobile” and “tablet” — you’re only ignoring everything in-between. When it comes to testing on other devices do just that. At that point it’s about <strong>performance and usability</strong>, not media queries and layout.</p>\n<h2 id=\"5-dont-shim-old-ie\">5. Don’t shim old IE</h2>\n<p>Keep your legacy contracts pain-free. Old desktop browsers need not be fully responsive down to mobile size. Serve a <strong>separate stylesheet</strong> for Internet Explorer 8 and lower using conditional comments (hide the normal stylesheet the same way). This should contain all base styles and the contents of media queries up to a desktop viewport (but not the queries themselves). <strong>CSS preprocessors</strong> can be used to build this automatically. Finally, in this old IE stylesheet add a <strong>min-width</strong> to the root element — basically let it go as small as it can before content is squashed. Now old IE will get a semi-fluid build and you can sleep easy at night.</p>\n<p><strong>Update:</strong> <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://twitter.com/justmarkup/status/286441851190398976\">@justmarkup</a> points me to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://jakearchibald.github.com/sass-ie/\">Jake Archibald’s Sass technique</a> which is excellent.</p>\n<p>Found that useful? <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dbushell\">Follow me on Twitter</a> for regular responsive discussion.</p>\n",
  "pageExcerpt": "If design and content strategy stops when the build phase starts it’s time to rethink your process. The role of a modern front-end developer goes beyond following pre-defined blueprints. An iterative, agile-like approach is vital to account for responsive design challenges that inevitably arise as a website takes shape.\nWith that in mind here are my 5 […]",
  "pageTitle": "5 Tips for Responsive Builds – David Bushell – Web Design (UK)"
}