{
  "dateUnix": 1373281933000,
  "dateFormatted": "Monday 8 Jul 2013",
  "pageHeading": "Open Responsibility",
  "pagePath": "/2013/07/08/open-responsibility/",
  "innerHTML": "<p>I like to be very “open”. I write about my ideas and experiences and I share <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell?tab=repositories\">code projects on GitHub</a>. There are many reasons for this. High on that list are the improvements I gain as a professional in this industry.</p>\n<h2 id=\"sharing-code\">Sharing Code</h2>\n<p>Some of my projects like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/Pikaday\">Pikaday</a> are very mature. I’m keen to see them adopted and still have interest in (if not time) evolving them further. Projects like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/Nestable\">Nestable</a> are proof of concepts that I believed worthwhile enough to publish. I’m happy to share partial solutions; I’ve repurposed plenty of open code myself and saved hours of reinventing the wheel.</p>\n<p>The majority of my code can be used with the BSD &amp; MIT licenses. That means, for all intents and purposes, it’s free. I have no responsibility or control over how you use it. That also indicates I’m unlikely to respond to emails.</p>\n<h2 id=\"tech-support\">Tech Support</h2>\n<p>I have a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/Responsive-Off-Canvas-Menu\">code repository</a> that exists to support an article I wrote for Smashing Magazine on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2013/01/15/off-canvas-navigation-for-responsive-website/\">implementing off-canvas navigation</a>. This is a close look at an intricate aspect of CSS. My demo is just that; a demonstration. One example, not <em>the definitive</em> example. Certainly not a mindless plugin that will do everything tangentially related and more.</p>\n<p>I get so many emails — <em>“I’m using your plugin, how do I X?”</em> — <strong>I don’t know how to reply</strong>. It’s not a plugin. It does what it does. Now don’t get me wrong, if someone politely asks me to explain further or is not entirely sure what they’re doing is right, I’ll try and find time to answer or point them in the right direction. But the one-liners “how do I […]?” just piss me off. What am I suppose to do, Google it for you? <em>code it for you?!</em></p>\n<p>I’ve come to the conclusion that I shouldn’t feel guilty ignoring these emails. If I wanted to discourage any kind of contact I wouldn’t publish openly in the first place.</p>\n<p>There’s an etiquette when asking people to give up their time for free. I don’t know if exact rules exist but at least be specific, be polite, be succinct, be conscious of how much you’re asking for. Documents like Nicolas Gallagher’s <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/necolas/issue-guidelines\">issue guidelines</a> set out very simple and direct instructions for contribution. I need to adopt something similar. I’m sure few people will read it but at least I’d have a URL I can link.</p>\n<h2 id=\"project-legacy\">Project Legacy</h2>\n<p>On the flip side of this I have projects I once actively promoted that I no longer touch. I developed <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://socialitejs.com/\">Socialite.js</a> to stop social media buttons affecting the initial page load; a huge perceived boost in performance. Nowadays I no longer have a mandate to plaster websites in yesteryear’s marketing fad. I haven’t touched Socialite in a long time. It still works, but more and more edge cases are cropping up at the expense of frustrated developers.</p>\n<p>The BSD &amp; MIT license doesn’t make me feel any less responsible every time I ignore a new ticket in the issue tracker. Taking the project down is too extreme as I believe it can still be useful. I’ve added a notice — <em>“Socialite is no longer under active development”</em> — but is this enough?</p>\n<h2 id=\"taking-payment\">Taking Payment</h2>\n<p>I deliberate these concerns because I’m currently working on a project that I could theoretically charge for. I often buy licenses to use good code but I’ve never been on the other side. I can write a license that will ensure profitability vs time invested in support but if I struggle to handle the responsibility for free stuff, what will happen when money is involved?</p>\n<p>I’ll always share projects and maybe one day I’ll charge for them too. As funny as it sounds I just need to stop caring so much. I’m putting too much onus on myself. I’m taking the collective demand for attention and manifesting that as a single overwhelming opinion.</p>\n",
  "pageExcerpt": "I like to be very “open”. I write about my ideas and experiences and I share code projects on GitHub. There are many reasons for this. High on that list are the improvements I gain as a professional in this industry.\nSharing Code\nSome of my projects like Pikaday are very mature. I’m keen to see them adopted and still have […]",
  "pageTitle": "Open Responsibility – David Bushell – Web Design (UK)"
}