{
  "pagePath": "/blog/page/34/",
  "pageHeading": "Blog (page 34)",
  "excerpts": [
    {
      "id": "do-you-need-a-javascript-library",
      "title": "Do you need a JavaScript library?",
      "href": "/2010/06/29/do-you-need-a-javascript-library/",
      "body": "Over the last few years JavaScript has gone through a renaissance.\nFrom a buggy unpredictable add-on, to a mature superfast piece of kit, JavaScript is an integral component to any website. To prove this I’d present libraries like jQuery, Modernizr and Raphaël (to name a few of my favourites).\nBut the question of the day is: do you actually need […]",
      "date": 1277844775000
    },
    {
      "id": "finding-the-right-style",
      "title": "Finding the right style",
      "href": "/2010/06/28/finding-the-right-style/",
      "body": "At Base Creative we’re doing a series of blog posts and video blogs (“vlogs” - I’m not sure that’ll catch on) about our website design strategy. That’s the process we go through with our clients and especially the initial meetings. In my latest post I discuss a specific technique we use in the strategy meeting:\n\nOne way which […]",
      "date": 1277725107000
    },
    {
      "id": "dbushell-v4",
      "title": "dbushell.com v4",
      "href": "/2010/06/26/dbushell-v4/",
      "body": "Eagle-eyed viewers may notice that dbushell.com is looking a bit different!\nI haven’t gone for a full overhaul just a little realigning, better typography and a new logo-thingy. My old design has served me very well over the last year - it was featured on quite a few design blogs. But it was looking a bit […]",
      "date": 1277566252000
    },
    {
      "id": "designing-obama",
      "title": "Designing Obama",
      "href": "/2010/06/16/designing-obama/",
      "body": "Look what arrived today:\n\nClick here to see and read more!\n",
      "date": 1276714592000
    },
    {
      "id": "from-mays-edition",
      "title": "From May’s Edition",
      "href": "/2010/06/13/from-mays-edition/",
      "body": "If you aren’t following my other blog (Design Heroes) you missed out on all these awesome links:\nUsable Efficiency\n\nUsable Efficiency is a new video blog with the aim of helping you improve websites with very practical and knowledgeable tips. Definitely one for the RSS reader.\nPEN Giant\n\nOne of the more superficial reasons I bought my Olympus PEN […]",
      "date": 1276427926000
    },
    {
      "id": "pentagram-marks",
      "title": "Pentagram Marks",
      "href": "/2010/05/30/pentagram-marks/",
      "body": "I just so happened to feature the book Pentagram Marks on Design Heroes a few weeks ago. Now that I’ve recieved a copy (birthday present) I though it deserved a full review! Click above, or read below:\nMy review of Pentagram Marks *\n\nPentagram Marks arrived in the post this week!\nThe book is delightfully smallish in stature […]",
      "date": 1275216537000
    },
    {
      "id": "minimalist-html",
      "title": "Minimalist HTML?",
      "href": "/2010/05/22/minimalist-html/",
      "body": "As part of the ongoing Design Heroes project we’ve started to include longer reviews with juicier content! The latest feature is on web designer and strategist Giuseppe Scappaticcio and his glorious website (and it’s source!). Read the review on Design Heroes, see a snippet below:\n\n“Really conserve your HTML as if it’s a non-renewable source. Give […]",
      "date": 1274522211000
    }
  ],
  "nextPage": "/blog/page/35/",
  "prevPage": "/blog/page/33/",
  "pageTitle": "Blog (page 34) – David Bushell – Web Design (UK)"
}