{
  "pagePath": "/blog/page/34/",
  "pageHeading": "Blog (page 34)",
  "excerpts": [
    {
      "id": "london-art-fair-2010",
      "title": "London Art Fair 2010",
      "href": "/2010/01/16/london-art-fair-2010/",
      "body": "Quick blog before I attempt to visit the V&amp;A Museum for the Decode exhibition. Last night I had a brief moment to sneak round the London Art Fair at the Business Design Centre. I work inside the BDC so there wasn’t much of an excuse for missing it, although I did my best with the […]",
      "date": 1263643473000
    },
    {
      "id": "356-to-go",
      "title": "356 to go",
      "href": "/2010/01/09/356-to-go/",
      "body": "One week, or nine days to be specific, down on my daily photo project. Watch me go on Flickr and/or Posterous where I’ll be photoblogging (phlogging?) daily. I’ll be analysing the project in a more “creative” sense on this blog. So here goes.\n\nThe Challenge\nUpon starting the daily photo project I figured it’d be incredibly difficult. […]",
      "date": 1263034023000
    },
    {
      "id": "all-about-the-old-school",
      "title": "All about the Old School",
      "href": "/2010/01/06/all-about-the-old-school/",
      "body": "So far this week has very much had a retro feel to it which is a tad odd since we’ve just started a new year, but I’m not a “new year” kinda guy anyway. While I’m ploughing forward with new projects and gusto I’ve found three things that have made me more interested in looking […]",
      "date": 1262809222000
    },
    {
      "id": "frozen-and-flickr",
      "title": "Frozen and Flickr",
      "href": "/2010/01/02/frozen-and-flickr/",
      "body": "Around here it’s nearly zero and covered in snow. I decided to spend the day integrating Flickr.\n\nIf you take a look in the right-hand column of my blog (under Twitter) you should see two of my latest Flickr photos. I say “should” because I’m not 100 percent on the Flickr API I’ve been experimenting with, […]",
      "date": 1262449786000
    },
    {
      "id": "tweets-and-tweaks",
      "title": "Tweets and Tweaks",
      "href": "/2009/12/31/tweets-and-tweaks/",
      "body": "The most depressing thing about being a web designer/developer is that you spend all day making websites for other people. Your own little corner of the Internet gets neglected and all spider-webby. The web is rapidly developing with new tricks, techniques and opportunities. Rather than redesigning my whole website (which you should rarely, if ever […]",
      "date": 1262267270000
    },
    {
      "id": "happy-new-year",
      "title": "Happy New Year!",
      "href": "/2009/12/20/happy-new-year/",
      "body": "I know, I’m a few weeks early with the cheer (but this blog will have more legs).\nI’ve spent the weekend wrapping Xmas gifts for the family. As a “creative” person I’ve always felt slightly guilty about my poor wrapping skills. Last year I stepped it up a notch and use a large black marker to […]",
      "date": 1261335516000
    },
    {
      "id": "dieter-rams-design",
      "title": "Dieter Rams Design (and Apple)",
      "href": "/2009/12/05/dieter-rams-design/",
      "body": "Friday night and I’m temporarily postponing my usual drinking routine to visit an art/design exhibition at London’s Design Museum.\nAt least I thought so (they had beer there too). The main attraction was everyones favourite German industrial designer of the decade - Dieter Rams. He was the head designer at Braun between the 60s right up […]",
      "date": 1260022649000
    }
  ],
  "nextPage": "/blog/page/35/",
  "prevPage": "/blog/page/33/",
  "pageTitle": "Blog (page 34) – David Bushell – Web Design (UK)"
}