{
  "dateUnix": 1357486067000,
  "dateFormatted": "Sunday 6 Jan 2013",
  "pageHeading": "Responsive Mistakes (a mini-series)",
  "pagePath": "/2013/01/06/a-mini-series-of-responsive-mistakes/",
  "innerHTML": "<p>Last week I shared some front-end experience with <a href=\"https://dbushell.com/2013/01/01/five-tips-for-responsive-builds/\">5 tips for responsive builds</a>. It received positive feedback so I thought it’d be fun to continue with a new mini-series. This month I’ll be focusing on the <em>mistakes</em> we make. Without further ado, let’s start with the biggest:</p>\n<h2 id=\"smart-phone-tablet-desktop\">Smart Phone, Tablet, Desktop</h2>\n<p>As a composition to highlight the benefits of responsive design, or to show off one’s craftsmanship in a portfolio, this device trio is an appealing visual.</p>\n<p>And that’s all it’s good for. For one thing, it ignores every <em>other</em> device capable of displaying a website: feature phones, TVs, projectors, kiosks, ebook readers, printed paper, and even fridges, to name but a few; the list — for all intents and purposes — is endless.</p>\n<p>Designing with three distinct devices in mind is misguided (even more so if you only care for Apple products). The Web is ubiquitous and it’s our job to design for <em>what we know</em>, not what we prefer. As far as we’re concerned there are devices with varying viewport sizes and connectivity. They have different input methods, e.g. mouse, keyboard, touchscreen, touchpad, stylus, remote, gaming pad, voice, and movement sensors. What’s more, each device has a unique subset of web standards it supports and <em>many</em> other features that give us a mere fragment of a clue towards user context.</p>\n<h2 id=\"the-solution\">The solution</h2>\n<p>Acknowledge how little is known about the user’s context. Realise that <strong>trying to categorise devices is a futile exercise</strong>. As <a href=\"http://blog.cloudfour.com/responsive-design-for-apps-part-1/\">Jason Grigsby says</a>:</p>\n<blockquote><p>Any attempt to draw a line around a particular device class has as much permanence as a literal line in the sand.</p></blockquote>\n\n\n<p>Design and build for an entirely fluid viewport (<a href=\"https://dbushell.com/2012/11/19/responsive-bases-vertical-spaces/\">don’t forget height</a>). Allow content to dictate design breakpoints. Remember that responsive design is not just about fitting content into layouts that negate zooming. Consider the effects of scrolling too; how is usability affected when elements move off screen?</p>\n<p>Give affordance in your design, for example, provide a healthy amount of whitespace around interactive elements for thin pointers and fat fingers. Only get specific after <strong>feature detection </strong>and then <strong>progressively enhance</strong> from an accessible baseline.</p>\n<p>Finally, don’t get caught up in the “mobile-first” hype without thinking. Look at your website’s analytics and future projections. Optimise for <em>today</em> from a <strong>business perspective</strong>. A device-agnostic mindset is undoubtedly our best stance as designers but sometimes other factors may supersede (with caution). After all, design is not timeless and the Web evolves quickly.</p>\n<h2 id=\"coming-up-next-\">Coming up next…</h2>\n<p>Understanding what we’re actually designing for is the first hurdle. Over the next few weeks I’ll be introducing other responsive design mistakes and how to avoid them — and I’ve made/overcome a few!</p>\n<p><a href=\"http://twitter.com/dbushell\">Follow me on Twitter</a> for future updates in this series.</p>\n",
  "pageExcerpt": "Last week I shared some front-end experience with 5 tips for responsive builds. It received positive feedback so I thought it’d be fun to continue with a new mini-series. This month I’ll be focusing on the mistakes we make. Without further ado, let’s start with the biggest:\nSmart Phone, Tablet, Desktop\nAs a composition to highlight the […]",
  "pageTitle": "Responsive Mistakes (a mini-series) – David Bushell – Web Design (UK)"
}