{
  "dateUnix": 1330991356000,
  "dateFormatted": "Monday 5 Mar 2012",
  "pageHeading": "UX and Privacy",
  "pagePath": "/2012/03/05/user-experience-and-privacy-the-fickle-web/",
  "innerHTML": "<p>I bought a Samsung Galaxy Nexus — running Google’s Android 4.0, ICS — several months ago. I ditched the iPhone 4 just past half way through my contract, and you know what? This is the best <em>user experience</em> I’ve had on a phone to date.</p>\n<p>But this blog post isn’t about a phone. It’s about Google, and moreso, about <strong>User Experience</strong>. My Twitter feed lately has been negative-GOOG. Specifically: <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.google.com/policies/privacy/\">Google’s new privacy policy</a>. And this is from the same pro-Apple users who tick and confirm the iTunes Ts &amp; Cs every fucking update without reading the damn thing. Likely the same people who use Facebook day-in-day-out without ever reading <em>their</em> privacy policy either.</p>\n<p>Nobody reads a “privacy policy”. Nobody reads a “terms and conditions”. Yet now it’s Google’s turn to be the whipping post?</p>\n<p>The thing is, when <strong>User Experience</strong> (UX) is especially outstanding concerns over privacy and legal-<em>slash</em>-moral rights are low. When Apple presented the iPhone — a smartphone — into a market of “feature phones” nobody gave a shit about legal contracts or rights. When user experience — relating to usability, accessibility, and value for money — is above average <em>nobody cares</em>. But then suddenly you fuck up UX; you’re the bad guy. Sometimes you don’t even have to do anything wrong, the other guy just has to outdo you. Sometimes <em>they</em> don’t even have to do anything <em>right</em>, you just fail to meet expectations. What’s the lesson here? Provide better UX than your competition and suddenly they’re the ones screwing their customers, not you.</p>\n<p>Welcome to the fickle Web.</p>\n<p>It’s not about privacy, or morals, or human rights, legal rights, copyrights, or <em>any bloody rights</em>. <strong>It’s about perception</strong>. Show me something hot and I’ll sign a contract. But dare to disappoint me — <em>you’ve lost a customer</em>! The old adage of “the customer is always right” has never been more wrong.</p>\n",
  "pageExcerpt": "I bought a Samsung Galaxy Nexus — running Google’s Android 4.0, ICS — several months ago. I ditched the iPhone 4 just past half way through my contract, and you know what? This is the best user experience I’ve had on a phone to date.\nBut this blog post isn’t about a phone. It’s about Google, […]",
  "pageTitle": "UX and Privacy – David Bushell – Web Design (UK)"
}