{
  "dateUnix": 1297028970000,
  "dateFormatted": "Sunday 6 Feb 2011",
  "pageHeading": "A Month of Interests",
  "pagePath": "/2011/02/06/a-month-of-interests/",
  "innerHTML": "<p>If you don’t follow my <a href=\"http://designheroes.co.uk/\">Design Heroes</a> blog these are the links that I’ve found inspiring, useful or just plain funny over the last month!</p>\n<h3 id=\"foundation\">Foundation</h3>\n<p>I watch and listen to a lot of podcasts but <a href=\"http://designheroes.co.uk/link/foundation\">Foundation by Kevin Rose</a> is one of the more exciting ones to appear recently. It’s all about web start-ups and innovation online. It’s available free but I choose the small monthly subscription for early access – it’s good to support independent media! More info on <a href=\"http://kevinrose.com/blogg/2011/1/3/the-fforward-podcast-is-now-foundation-and-launches-today.html\">Foundation here</a>.</p>\n<h3 id=\"html5-logo-t-shirt\">HTML5 Logo &amp; T-Shirt</h3>\n<p><a href=\"http://designheroes.co.uk/link/w3c-html5-logo\">HTML5 gets a logo</a>! To say this wasn’t well received by the web dev community would be an understatement. Personally I don’t understand the backlash. I bought the t-shirt! It’ll be a collectors item one day.</p>\n<h3 id=\"little-big-details\">Little Big Details</h3>\n<p>Careful attention and consideration is what separates good design from outstanding design. <a href=\"http://littlebigdetails.com/\">Little Big Details</a> is a blog that celebrates the finer details in web and software design. Not every project has the time dedicated to reviewing every possible nuance, but with enough practice and understanding it’s possible to achieve something great.</p>\n<h3 id=\"the-shape-of-design\">The Shape of Design</h3>\n<p>More independent media – I’ve pledged support for Frank Chimero’s book <a href=\"http://www.kickstarter.com/projects/30453381/the-shape-of-design\">The Shape of Design</a> over at Kickstarter. You can <a href=\"http://designheroes.co.uk/link/the-shape-of-design\">watch his talk</a> on the subject from Build 2010. The project raised enough money is a matter of days and will prove to be a massive success. The last book I supported on Kickstarter was <a href=\"http://designheroes.co.uk/link/designing-obama-the-book\">Designing Obama</a> and I treasure it immensely.</p>\n<p>There’s something about designers publishing books! They don’t settle for second best.</p>\n<h3 id=\"on-more-thing-\">On more thing…</h3>\n<p>One of the exciting projects we’re working on at <a href=\"http://www.basecreative.eu\">Base Creative</a> is <a href=\"http://www.mylifelisted.com\">mylifelisted.com</a> (coming soon). Interest has been huge, I can’t wait to see it live.</p>\n<p>Thinking about it, there’s too many bookmarks to blog about here,</p>\n<p>follow me <a href=\"http://www.twitter.com/dbushell\">@dbushell</a> on Twitter!</p>\n",
  "pageExcerpt": "If you don’t follow my Design Heroes blog these are the links that I’ve found inspiring, useful or just plain funny over the last month!\nFoundation\nI watch and listen to a lot of podcasts but Foundation by Kevin Rose is one of the more exciting ones to appear recently. It’s all about web start-ups and innovation […]",
  "pageTitle": "A Month of Interests – David Bushell – Web Design (UK)"
}