{
  "dateUnix": 1291245027000,
  "dateFormatted": "Wednesday 1 Dec 2010",
  "pageHeading": "Walking on Air",
  "pagePath": "/2010/12/01/walking-on-air/",
  "innerHTML": "<p>I’m in a genuinely positive mood this evening, partially because <strong>dbushell.com</strong> survived another automatic WordPress update* but mainly because my MacBook Air arrived today!</p>\n<p>Since this is the first laptop I have ever owned I’m not going to write a comprehensive product review but I’d like to point out a few things that are brilliant:</p>\n<ul>\n<li>The multi-touch pad works amazingly well. It requires a physical click down so no amount of heavy finger tapping will trigger a click. That has plagued all my brief laptop relationships to date. I can normally click a laptop just by looking at it.</li>\n<li>The 1440x900 resolution packs an impressive 128 pixels per inch. It takes a little getting used to compared to my 24” iMac which is only 94ppi. Everything is so small and crisp!</li>\n<li>It’s fast. Zero to Photoshop faster than I can tweet about Adobe jumping the shark. The real test will be when I use it as my primary photo editor over the holidays.</li>\n</ul>\n<p>13-inch with 4GB RAM and 128GB SSD (by the way). I didn’t upgrade the storage because who needs that kind of data on a laptop? Probably me I’ll no doubt find out, but I have plenty of storage elsewhere if needed.</p>\n<p>I’ll be sure to post an update after using this for a few months. I just remembered I’m suppose to be <a href=\"https://dbushell.com/2010/11/07/the-typographic-gauntlet/\">designing a font</a>, so if you’ll excuse me.</p>\n<p class=\"medium\">* updated to 3.0.2 without bricking the whole website like 3.0 did, fun times!</p>\n\n",
  "pageExcerpt": "I’m in a genuinely positive mood this evening, partially because dbushell.com survived another automatic WordPress update* but mainly because my MacBook Air arrived today!\nSince this is the first laptop I have ever owned I’m not going to write a comprehensive product review but I’d like to point out a few things that are brilliant:\n\nThe multi-touch […]",
  "pageTitle": "Walking on Air – David Bushell – Web Design (UK)"
}