{
  "dateUnix": 1272535713000,
  "dateFormatted": "Thursday 29 Apr 2010",
  "pageHeading": "Design Heroes 2",
  "pagePath": "/2010/04/29/design-heroes-2/",
  "innerHTML": "<p>Last year I started the bookmarking website <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">Design Heroes</a> to share and remember design related links, a kind of “inspiration blog”. It has served me very well in those occasions where I can remember a resource or piece of design I want to reference but have no idea where it is. The old design worked great for that but it wasn’t very accessible to other people, so I decided to redesign it.</p>\n<p><a href=\"http://designheroes.co.uk\"><p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/dh-update.png\" alt=\"\"></p>\n</a></p>\n<h3 id=\"new-design\">New Design</h3>\n<p>The new site retains the idea of “tag filtering” but is initially presented in a more recognisable blog format. The big different is a large image assigned to every bookmark. To maintain a minimalist feel, various elements are hidden and can fade in when needed. Let me know what you think!</p>\n<p>Another cool feature I added is navigation by arrow keys (up/down). The final big change is the ability to post a comment on each bookmark. Hopefully this will make the site a lot more engaging.</p>\n<p>And finally, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dsgnheroes\">Design Heroes is on twitter!</a> So go follow.</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">http://designheroes.co.uk</a></p>\n",
  "pageExcerpt": "Last year I started the bookmarking website Design Heroes to share and remember design related links, a kind of “inspiration blog”. It has served me very well in those occasions where I can remember a resource or piece of design I want to reference but have no idea where it is. The old design worked […]",
  "pageTitle": "Design Heroes 2 – David Bushell – Web Design (UK)"
}