{
  "dateUnix": 1593684000000,
  "dateFormatted": "Thursday 2 Jul 2020",
  "pageHeading": "Hardware and Self Hosting",
  "pagePath": "/2020/07/02/hardware-home-servers-self-hosted-raspberry-pi/",
  "innerHTML": "<p>Today my main computer is a Mac Mini 2018. Quite likely the last Mac I’ll buy for day-to-day work. I’d like it to last a little longer than previous ones. Following Apple’s ARM chip announcement I have my doubts about future support.</p>\n<p>Here’s my office setup:</p>\n<p class=\"b-post__image\">\n  <img loading=\"lazy\" srcset=\"\n    /images/blog/2020/self-hosted-hardware@1x.jpg,\n    /images/blog/2020/self-hosted-hardware@2x.jpg 2x\"\n    src=\"/images/blog/2020/self-hosted-hardware@1x.jpg\"\n    alt=\"self hosted hardware\"\n    width=\"1080 \"\n    height=\"525\">\n</p>\n\n<p>I was a dual-monitor person for years. That changed when I realised how often my second screen was burning Slack. Yeah, that had to change. I now keep a tablet by my side. Saves on space and electricity.</p>\n<p>That top drawer contains a couple of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.raspberrypi.org/\">Raspberry Pis</a>. On top is an extendable stand-up desk. Cable management was tricky.</p>\n<h2 id=\"old-macs-and-linux\">Old Macs and Linux</h2>\n<p>I’ve been using Linux to rescue my old Mac Mini (2014) and older Macbook Air (2010). Both drowned in the wake of Apple’s macOS updates.</p>\n<p>Linux has given these devices new life. I was using the old Mini to dual boot Windows 10 for browser testing. After upgrading to the new Mini – notably with 32GB RAM – I can use a virtual machine for IE. I keep the laptop around for portability. It’s my second device for coding and blogging out-of-office.</p>\n<p class=\"b-post__image\">\n  <img loading=\"lazy\" srcset=\"\n    /images/blog/2020/linux-macbook-air@1x.jpg,\n    /images/blog/2020/linux-macbook-air@2x.jpg 2x\"\n    src=\"/images/blog/2020/linux-macbook-air@1x.jpg\"\n    alt=\"Linux Macbook Air\"\n    width=\"1080 \"\n    height=\"525\">\n</p>\n\n<p>I’ve hopped around half a dozen Linux distros to see what’s new. It’s been 15 years since I last used desktop Linux. I settled on a basic Arch + Gnome install on my laptop. I’ll probably stick Manjaro or Linux Mint on the old Mini.</p>\n<p>I’d seriously consider Linux fulltime if it wasn’t for Adobe software. Linux has its issues but the Apple tax is a serious cost of business I’d prefer to do without.</p>\n<h2 id=\"raspberry-pis\">Raspberry Pis</h2>\n<p>Scattered around my appartment I have an original RPi 1B (2012), a RPi 3B (2016), a RPi 4B (2019), and a RPi Zero W, if I can remember which outlet it’s plugged into. These devices have been my gateway to Linux on the server over the years and a big source of hobby projects.</p>\n<p>The <strong>Raspberry Pi 1B</strong> is hooked up to my router via Ethernet and USB power. No separate power supply. It runs <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://dietpi.com/\">DietPi</a> — overclocked, why not — and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.wireguard.com/\">WireGuard</a>. I use it as a VPN for my mobile phone to encrypt my way through dodgy networks like public WiFi. With <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://openwrt.org/\">OpenWrt</a> on my router configured with firewall rules, Fail2Ban scripts and the like, it’s as locked down as I can make it.</p>\n<p>The <strong>Raspberry Pi 3B</strong> is my go-to device for experimentation. I’ve connected a low powered 128GB SSD via a USB to SATA adapter. The speeds aren’t ideal but the drive is powered without a brick. For a while it was syncing crypto blockchains because that was a thing to do.</p>\n<p>A major bottleneck with earlier Raspberry Pi’s is their limited 100Mbit Ethernet adapter sharing a bus with the USB hub.</p>\n<h2 id=\"self-hosting\">Self Hosting</h2>\n<p>The <strong>Raspberry Pi 4</strong> is my home server / self-hosted box. I’ve recently switch to Ubuntu Server 20.04 LTS for that 64-bit OS goodness. The hardware appears to cope powering two USB 3 drives although I’ve yet to stress both at once. They are an enclosed 2TB Seagate 2.5” HDD and a 240GB WD Green M.2 SATA SDD.</p>\n<p>I’m using Docker containers to run:</p>\n<ul>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://containo.us/traefik/\">Traefik</a> reverse proxy with Let’s Encrypt for:</li>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://gitea.io\">Gitea</a> — private Git repos</li>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://pi-hole.net/\">Pi-hole</a> — DNS / tracker blocking</li>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://jellyfin.org/\">Jellyfin</a> — media server (before that Emby, before that MiniDLNA)</li>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://iot.mozilla.org/gateway/\">WebThings Gateway</a> — home IoT / automation</li>\n</ul>\n<p>I considered a Bitwarden instance but it scares me. I tried GitLab but its pricing tiers and features were confusing.</p>\n<p>Generally I find the “Internet of Things” a load of rubbish. It’s a privacy and security nightmare. Smart devices are destined to be abandonware long before their lifespan. Manufacturers insist on using their own unnecessarily cloud services for critical functionality whilst failing to provide updates.</p>\n<p>That said, I do have a few smart lights. They’re useful and I’m 90% sure they don’t have hidden spyware. I’d previously managed these with Google Home before I de-googled my life. I tried Samsung SmartThings but the UX was painful.</p>\n<p>I also tested <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.home-assistant.io/\">Home Assistant</a> for a while. It’s light-years ahead of anything else. Ultimately I found the material design web UI to be off-putting.  I prefer the much simpler Mozilla WebThings for my limited requirements. For the Elgato <em>Key Light Air</em> on my desk <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/elgato-key-light-air-adapter\">I coded my own adapter</a>.</p>\n<p>The fantastic thing about using containers is how easily I can backup the compose files and config volumes. If my RPi suffers an SD card failure I can rebuild a new one without too much pain.</p>\n<p>A couple of podcasts have really inspired these projects:</p>\n<ul>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://linuxunplugged.com/\">Linux Unplugged</a></li>\n<li><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://selfhosted.show/\">Self-Hosted</a></li>\n</ul>\n<p>Well worth a listen. Incredibly, I’ve still got idle CPU and memory on my RPi 4 for more self-hosted projects. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://twitter.com/dbushell\">@ me ideas!</a></p>\n",
  "pageExcerpt": "Today my main computer is a Mac Mini 2018. Quite likely the last Mac I’ll buy for day-to-day work. I’d like it to last a little longer than previous ones. Following Apple’s ARM chip announcement I have my doubts about future support.\nHere’s my office setup:\n\n  \n\n\nI was a dual-monitor person for years. That changed […]",
  "pageDesc": "There one where set up a local “Internet of Things”.",
  "pageTitle": "Hardware and Self Hosting – David Bushell – Web Design (UK)"
}