{
  "dateUnix": 1307620181000,
  "dateFormatted": "Thursday 9 Jun 2011",
  "pageHeading": "Design it. Build it. #DIBI",
  "pagePath": "/2011/06/09/design-it-build-it-dibi/",
  "innerHTML": "<p><strong>Location:</strong> The Sage, Gateshead.\n<strong>Event:</strong> <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.dibiconference.com/\">Design It. Build It.</a> The two-track web conference.</p>\n<p><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/06/dibi.jpg\" alt=\"The DIBI Conference\"></p>\n<p>This is my third conference of the year and I’m getting exceedingly good at it!</p>\n<p>A trip up to DIBI meant a late evening train from Kings Cross, a late night arrival to the pre-party (a bit of catching up to do) and an early-ish start. The two track line-up was split evenly between design and development (hence the conference name). Considering this is only its second year we were treating to an amazing venue and as many industry superstars as you could possibly imagine.</p>\n<p>Aside from <strong>Mike Kus’s</strong> excellent talk (I’d heard it at <a href=\"/2011/05/17/fowd-day-one-review/\">FOWD last month</a>) I was strictly there for design.</p>\n<h2 id=\"the-mechanical-revolution\">The Mechanical Revolution</h2>\n<p><strong>Inayaili de Leon</strong> started the day with a pragmatic view on how machines are intruding on our job.</p>\n<p>Analogy was drawn from the industrial revolution where the Luddites—threatened by job loss—viciously defended their hand-crafted practice. We all know how successful that was.</p>\n<p>Yaili highlighted areas (particularly with CSS authorship) in which we must accept machine-aided input or face becoming obsolete. She raised the idea that using CSS frameworks and pre-processors may become a necessity and not something to rally against from a purist view.</p>\n<p>Industrialisation and mass-production never eliminated the need for human design. Instead of holding prejudice we should take a step back and operate the machine when it helps us; embrace it and adapt it to our needs.</p>\n<p>There was a sincerity to this talk as Yaili admitted herself how difficult it can be to accept change.</p>\n<p>I’ve taken away the feeling that I should consider this more. I’ve often thought of tools like LESS CSS to be “something else to learn”, a needless complexity. I’d rather fill my head with design knowledge not machine manuals. I guess this will change as machines evolve. At present I feel sites like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://css3generator.com/\">css3generator.com</a> are sufficient for me.</p>\n<h2 id=\"design-to-where-the-web-will-be\">Design to where the web will be</h2>\n<p><strong>Faruk Ateş</strong> emphasised the importance of looking forward. The talk took a philosophical view on design and development. We must understand the web’s history but also its emerging technologies. Ideas lead to form, this is design. Form leads to product, this is development. Web browser versions don’t matter so much as capabilities.</p>\n<p>Take a step back and ask if you’re going in the right direction. By focusing up-close the bigger picture is missed. In a practical sense, less important elements of design distract from the overall purpose. Focus on content and the best possible experience should always direct the project.</p>\n<h2 id=\"visualising-design\">Visualising Design</h2>\n<p><strong>Brian Suda’s</strong> talk on data visualisation flew by in a fascinating 40 minutes. He showed how different perspectives on data can give false impressions and how detail in the wrong areas distract from data.</p>\n<p>We learned about the “data to ink/pixel ratio” where 1:1 is perfection—a seismograph being the best example; every part of the visualisation is data. Often the best graphs tell one story and <em>only</em> one story. They shouldn’t try to feed us every statistic at every angle.</p>\n<h2 id=\"one-web\">One Web</h2>\n<p><strong>Jeremy Keith</strong> stole the show for me. His talk was energetic, enthusiastic and deeply inspiring with a great mix of history, philosophy and practical knowledge. Themes included his usual advocacy of semantic HTML, progressive enhancement and responsive design, but it was the overriding idea of <em>one web</em> that gave such clarity and depth to his talk.</p>\n<p>Jeremy showed how the web started out as a new medium for print design, just as TV had started out with stage plays on screen. Only after time does the new medium mature and fine its own form.</p>\n<p><em>Universal access</em>—not just for varying abilities but for everyone in every situation—is what we must always aim for.</p>\n<p>Responsive design is not just about media queries, it’s about the mentality and idea of “one web”. The term “mobile web” is dangerous, it implies segregation. The idea of “web apps” in confusing. Most websites are a combination of a document and an app. Gradual support is a necessity and a website should not look the same on every device.</p>\n<p>His practical example of designing modular objects (text styles, buttons etc) can be used globally. Layout CSS can be kept separate, to be included in browsing environments that suit it.</p>\n<p>Web design should always be <em>content first</em>. The content should dictate the break points for media queries, not device sizes; that’s an interesting thought.</p>\n<p>The context of the users has always been important. Devices do not dictate context and we should not deny content on those assumptions, i.e. mobile does not necessarily mean on-the-go/in a rush. <strong>Ethan Marcotte</strong> also pointed out evidence for this at FOWD London, saying that a vast majority of mobile usage is at home on the sofa. We should be considering the actual capabilities of the device. Similarly we can’t assume desktops are fast and we can dump more superfluous information on the screen.</p>\n<p>If you get a chance to see Jeremy’s talk live or on video I highly recommend you watch.</p>\n<h2 id=\"what-makes-a-design-seem-intuitive\">What Makes a Design Seem Intuitive</h2>\n<p><strong>Jared Spool</strong> is a very funny man.  He demonstrated with much jest that content will lose focus to bad design. Good design is invisible like good air conditioning (no one ever mentions it when it <em>just works</em>).</p>\n<p>Through his research Jared has found that it’s not just pure novelty and it’s not just complexity that can upset a users intuition. We learned about “current knowledge” and “target knowledge” of the user, how they change, and what we can do to align them. He suggested we spend a couple of hours every month watching how users interact.</p>\n<h2 id=\"what-every-web-designer-should-know\">What every web designer should know</h2>\n<p><strong>Jeffrey Zeldman</strong> ended the day with a somewhat scattered presentation.</p>\n<p>He’s a charismatic and funny guy, though I suspect either hungover or jet-lagged (or both) for today’s performance—and I think he’d be the first to admit the talk didn’t go as planned.</p>\n<p>Despite that is was an friendly and humble ending to a great conference that connected everyone. He highlighted the core concepts and ideas that are deeply rooted in every design professional. I can see why Jeffrey is so well respected in our industry.</p>\n<h2 id=\"final-thoughts-on-dibi\">Final Thoughts on DIBI</h2>\n<p>I was surprised at the standard of DIBI’s production.</p>\n<p>The venue and set up rivalled FOWD in quality and on a purely inspiration-to-talk ratio I think DIBI actually ranked higher. <strong>Jeremy Keith’s</strong> talk was worth the trip alone, as was <strong>Ethan Marcotte’s</strong> at FOWD. <strong>Gavin Elliot</strong> and the team deserve big applause for their efforts.</p>\n<p>Speaking of <strong>Ethan Marcotte</strong>, I read the recently published <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.abookapart.com/products/responsive-web-design\">Responsive Web Design</a> on the train up to Newcastle. I’ve written so much lately on the topic that I won’t write a review. I’ll only say that it is without a doubt _the _most important book for web designers today. <strong>Read this book!</strong></p>\n<hr>\n<p>Big hello to everyone I met in person! I’m beginning to think Twitter avatars need similar requirements to passport photos. If I didn’t spot you I’ll be at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://ampersandconf.com/\">Ampersand</a> next Friday, say hello!</p>\n",
  "pageExcerpt": "Location: The Sage, Gateshead.\nEvent: Design It. Build It. The two-track web conference.\n\nThis is my third conference of the year and I’m getting exceedingly good at it!\nA trip up to DIBI meant a late evening train from Kings Cross, a late night arrival to the pre-party (a bit of catching up to do) and an early-ish […]",
  "pageTitle": "Design it. Build it. #DIBI – David Bushell – Web Design (UK)"
}