{
  "dateUnix": 1310645305000,
  "dateFormatted": "Thursday 14 Jul 2011",
  "pageHeading": "The Social Designer",
  "pagePath": "/2011/07/14/the-social-designer-google-authorship/",
  "innerHTML": "<p>Earlier this month I wrote an article about <strong>self promotion online</strong> as a designer (read <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://xheight.dbushell.com/2011/07/03/speak-to-me-self-promotion-online/\">Speak to Me</a> over at xheight). I summed it up to this sentiment:</p>\n<blockquote><p>Self promotion is not about pushing an ego onto others, it’s simply about making yourself visible and accessible.</p></blockquote>\n\n\n<p>One thing I realised quickly in my career is the importance of having a consistent public profile. There’s no point running a Tumblr blog if no one associates it with you. When <strong>Google+</strong> launched a few weeks ago I registered my usual black &amp; white headshot and made sure to link <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://plus.google.com/112664170427933857280/\">my profile</a> across the web—from Twitter to dbushell.com—BOOM! An extension to my online persona.</p>\n<h2 id=\"google-authorship\">Google Authorship</h2>\n<p>But a Google profile is more than your normal web presence:</p>\n<p class=\"small\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/07/google-social-search.png\" alt=\"Google search for &quot;Circle me&quot; showing an author profile\">Google search for “Circle me”.</p>\n\n<p>What you’re seeing in the first search result is the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.google.com/support/webmasters/bin/answer.py?answer=1229920\">Google Authorship</a> program in action. Because my blog links to my Google+ profile reciprocally, Google knows I’m the author of that page and shows my mugshot. With the right development I can link to my profile on every website I publish content for. See <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://imjustcreative.com/implementing-google-authorship-markup-on-your-website/2011/07/07/\">Graham Smith’s guide to Google Authorship</a> for a designer-friendly introduction.</p>\n<p class=\"medium\">The second search result promotes a link I’ve shared as a +1 recommendation. (It happens to be my <em>other</em> blog linking to the same article, but that’s not the point!)</p>\n\n\n\n\n<h2 id=\"open-to-the-public\">Open to the Public</h2>\n<p>No hiding now! Promoting yourself online is a big commitment. With such a strong public profile it’s a dangerous game. There’s a level of professional integrity that can be easily damaged with poorly written criticism (or a drunken tweet).</p>\n<p>In reality though, the “privacy” of the past has always been an illusion. Whatever information I make public is just that; <strong>public</strong>.  It doesn’t matter whether I whisper it in a friends ear or publish it online—it’s out there. For that reason I think this heightened level of online promotion will be a good thing. I’ll be far more conscious of what I make public and will wield a lot more power for self promotion.</p>\n<p>For those working in the web industry, is it possible to stay behind the curtain?</p>\n",
  "pageExcerpt": "Earlier this month I wrote an article about self promotion online as a designer (read Speak to Me over at xheight). I summed it up to this sentiment:\nSelf promotion is not about pushing an ego onto others, it’s simply about making yourself visible and accessible.\n\n\nOne thing I realised quickly in my career is the importance […]",
  "pageTitle": "The Social Designer – David Bushell – Web Design (UK)"
}