{
  "dateUnix": 1370274214000,
  "dateFormatted": "Monday 3 Jun 2013",
  "pageHeading": "The Raster Image Paradox",
  "pagePath": "/2013/06/03/the-raster-image-paradox/",
  "innerHTML": "<p>The recent <a href=\"http://coding.smashingmagazine.com/2013/06/02/clown-car-technique-solving-for-adaptive-images-in-responsive-web-design/\">Clown Car Technique</a> is a clever use of SVG but as with all “adaptive image” solutions for responsive web design it’s not something I’d be comfortable using.</p>\n<h2 id=\"one-image-to-rule-them-all\">One image to rule them all</h2>\n<p>When I build web pages I generally come to the conclusion that using a single image is a sensible bet. Nothing fancy, just a good ol’ accessible image element:</p>\n<pre><code class=\"language-markup\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>img</span> <span class=\"token attr-name\">src</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>handshake.jpg<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">alt</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>an ethnically diverse handshake<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n</code></pre>\n<p>Even at the possible expense of wasted bandwidth and low definition — heck, even up-scaling — this introduces less complexity and concern than any “responsive/adaptive image” technique I’ve seen to-date. They’re all hacks. They all break things. Even the web standard proposals can’t decide which image would be appropriate to load. Too many edge cases. Are users even going to notice less than perfect image definition? Does a fast connection and high pixel density mean users even want higher quality? Not likely on <a href=\"/2012/10/23/the-real-cost-of-retina/\">mobile data plans</a>.</p>\n<p>Here’s what I do. I recognise the web as it is today and design for a suitable average. This requires a bit of performance calorie counting. But guess what? The web has limitations. Sometimes I’ll opt for a technique to load variations but it’s far from a default requirement.</p>\n<h2 id=\"give-it-a-few-years\">Give it a few years</h2>\n<p>I’ve <a href=\"/2012/07/13/vector-graphics-retina-and-you/\">always hated</a> the buzzword Retina® when used in lieu of “high pixel density”. The point at which pixels become distinguishable relates directly to density and distance from the eye. Despite the advertising nothing we see today is close to perfection. The iPhone 4 first introduced Apple’s Retina screen which packed twice the number of pixels compared to past iPhones. Many other manufacturers have devices that surpass the iPhone Retina pixel density. We will see density double again soon (<a href=\"http://appleinsider.com/articles/13/05/28/rumor-apple-to-double-iphone-5s-retina-resolution-to-15m-pixels\">here’s a rumour</a>).</p>\n<p>When ultra-high pixel density screens appear on the market are we suppose to provide an “@4x” version of all raster images on the web? There’s no magic compression algorithm that will keep file size down. Are we to expect connectivity to improve at the same pace?</p>\n<p>We may find techniques of the Clown Car variety useful in small doses but regardless of what’s a hack and what’s a web standard, nothing will “solve” adaptive images. The real solution will always be a sensible medium. An intelligent consideration for budget. That solution exists today.</p>\n",
  "pageExcerpt": "The recent Clown Car Technique is a clever use of SVG but as with all “adaptive image” solutions for responsive web design it’s not something I’d be comfortable using.\nOne image to rule them all\nWhen I build web pages I generally come to the conclusion that using a single image is a sensible bet. Nothing fancy, […]",
  "pageTitle": "The Raster Image Paradox – David Bushell – Web Design (UK)"
}