{
  "pagePath": "/blog/page/25/",
  "pageHeading": "Blog (page 25)",
  "excerpts": [
    {
      "id": "dont-copy-that-floppy",
      "title": "Don’t copy that floppy!",
      "href": "/2011/06/14/dont-copy-that-floppy/",
      "body": "I’ve written a new article for Smashing Magazine entitled Understanding Copyright &amp; Licenses. It’s a primer for web designers and developers. Give it a read, let me know what you think.\n\nI do like to tackle the difficult topics. They often require a lot of research and I tend to arrive at the other end knowing […]",
      "date": 1308065447000
    },
    {
      "id": "design-it-build-it-dibi",
      "title": "Design it. Build it. #DIBI",
      "href": "/2011/06/09/design-it-build-it-dibi/",
      "body": "Location: The Sage, Gateshead.\nEvent: Design It. Build It. The two-track web conference.\n\nThis is my third conference of the year and I’m getting exceedingly good at it!\nA trip up to DIBI meant a late evening train from Kings Cross, a late night arrival to the pre-party (a bit of catching up to do) and an early-ish […]",
      "date": 1307620181000
    },
    {
      "id": "hey-i-was-reading-that",
      "title": "Hey, I was reading that…",
      "href": "/2011/06/05/hey-i-was-reading-that/",
      "body": "I’m a huge fan of web typography, but we’ll have to wait a bit longer to catch up with print.\nTwitter surged last week with the news of Futura’s arrival at Typekit.\nFutura PT’s classic design — tall ascenders, near perfect geometric shapes — make it both instantly recognizable and irrepressibly modern.\n\n\nIndeed, and browser rendering makes it […]",
      "date": 1307298695000
    },
    {
      "id": "dont-tell-me-where-to-click",
      "title": "Don’t tell me where to click",
      "href": "/2011/05/30/dont-tell-me-where-to-click/",
      "body": "\n“click here”, “read more”, “next” – a bad habit that just won’t go away, and I’m to blame as much as the next designer (at least the “more” end of the spectrum, if that will save integrity).\nWhy is “click here” so bad?\nGood link text should not be overly general; don’t use “click here.” Not only […]",
      "date": 1306756902000
    },
    {
      "id": "simplicity-in-ui-design-ia-writer-for-mac",
      "title": "Simplicity in UI - IA Writer for Mac",
      "href": "/2011/05/28/simplicity-in-ui-design-ia-writer-for-mac/",
      "body": "IA Writer for Mac looks like the sort of product I’d download immediately, and I did!\nIt has all the designer’s preferred aesthetics. It’s minimalist, typography focused and beautifully simple.\nDesigners often get a lot of heat for their style-orientated tastes but in reality most of us understand how important user interface design is; it’s far more […]",
      "date": 1306588863000
    },
    {
      "id": "designing-a-new-me",
      "title": "Designing a new me",
      "href": "/2011/05/25/designing-a-new-me/",
      "body": "I often say that aesthetics are the least important part of a website design.\nContent and functionality are miles ahead of anything else. It’s obvious really, why would people visit unless you have some substance? They’re so important that design should focus on layout and architecture and only then should aesthetics be considered.\nIt’s refreshing!\nI’ve had dbushell.com […]",
      "date": 1306318189000
    },
    {
      "id": "fowd-day-two-review",
      "title": "#FOWD Day Two Review",
      "href": "/2011/05/18/fowd-day-two-review/",
      "body": "I was a few minutes late today (apparently I didn’t have time for a tactical Maccy D’s bacon roll) which almost cost me dearly!\nA change in schedule meant Ethan Marcotte was up first with:\nResponsive Web Design\nThis was suppose to be the headline act. I think a lot of people who missed this morning (a lot […]",
      "date": 1305737155000
    }
  ],
  "nextPage": "/blog/page/26/",
  "prevPage": "/blog/page/24/",
  "pageTitle": "Blog (page 25) – David Bushell – Web Design (UK)"
}