{
  "pagePath": "/blog/page/25/",
  "pageHeading": "Blog (page 25)",
  "excerpts": [
    {
      "id": "the-social-designer-google-authorship",
      "title": "The Social Designer",
      "href": "/2011/07/14/the-social-designer-google-authorship/",
      "body": "Earlier this month I wrote an article about self promotion online as a designer (read Speak to Me over at xheight). I summed it up to this sentiment:\n\nSelf promotion is not about pushing an ego onto others, it’s simply about making yourself visible and accessible.\n\nOne thing I realised quickly in my career is the importance […]",
      "date": 1310645305000
    },
    {
      "id": "solving-a-problem-like-change",
      "title": "Solving a Problem like Change",
      "href": "/2011/07/12/solving-a-problem-like-change/",
      "body": "A while back the Gawkernetwork redesigned their line-up and the Internet revolted. It was bad, very _very _bad. The design, the usability, the technical implementation—it had people scratching their heads.\nYesterday TechCrunchlaunched a redesign and, well, it’s not quite ‘a Gawker’.\n\n\nWe used AOL Paint, which comes free on the AOL CD and has this sweet UltraLogoMatic2000 […]",
      "date": 1310471846000
    },
    {
      "id": "circle-me-google-plus",
      "title": "Circle me (Google+)",
      "href": "/2011/07/01/circle-me-google-plus/",
      "body": "Have you seen Google+?\n\nAside from making the name of their “like button” (Google+1) suddenly make a lot more sense, Google+ seems to be a very intuitive mix between Twitter &amp; Facebook. And I really like it (or +1 it, I guess).\nFor me Twitter is a broadcast and promotional tool, real conversation is very difficult. Facebook […]",
      "date": 1309520752000
    },
    {
      "id": "ampersand-conference-ampconf",
      "title": "Ampersand Conference",
      "href": "/2011/06/18/ampersand-conference-ampconf/",
      "body": "Yesterday I braved the “adverse weather conditions” to attend Ampersand, the web typography conference in Brighton. My expectations were undecided.\nI knew I didn’t want to see a show &amp; tell, nor basic print typography knowledge presented as a new web-revelation (neither is it new, nor new to the web). Thankfully I was rewarded with an […]",
      "date": 1308400740000
    },
    {
      "id": "dont-copy-that-floppy",
      "title": "Don’t copy that floppy!",
      "href": "/2011/06/14/dont-copy-that-floppy/",
      "body": "I’ve written a new article for Smashing Magazine entitled Understanding Copyright &amp; Licenses. It’s a primer for web designers and developers. Give it a read, let me know what you think.\n\n\nI do like to tackle the difficult topics. They often require a lot of research and I tend to arrive at the other end knowing […]",
      "date": 1308065447000
    },
    {
      "id": "design-it-build-it-dibi",
      "title": "Design it. Build it.",
      "href": "/2011/06/09/design-it-build-it-dibi/",
      "body": "Location: The Sage, Gateshead.\nEvent: Design It. Build It. The two-track web conference.\n\nThis is my third conference of the year and I’m getting exceedingly good at it!\nA trip up to DIBI meant a late evening train from Kings Cross, a late night arrival to the pre-party (a bit of catching up to do) and an early-ish […]",
      "date": 1307620181000
    },
    {
      "id": "hey-i-was-reading-that",
      "title": "Hey, I was reading that…",
      "href": "/2011/06/05/hey-i-was-reading-that/",
      "body": "I’m a huge fan of web typography, but we’ll have to wait a bit longer to catch up with print.\nTwitter surged last week with the news of Futura’s arrival at Typekit.\n\nFutura PT’s classic design — tall ascenders, near perfect geometric shapes — make it both instantly recognizable and irrepressibly modern.\n\nIndeed, and browser rendering makes it […]",
      "date": 1307298695000
    }
  ],
  "nextPage": "/blog/page/26/",
  "prevPage": "/blog/page/24/",
  "pageTitle": "Blog (page 25) – David Bushell – Web Design (UK)"
}