{
  "pagePath": "/blog/page/25/",
  "pageHeading": "Blog (page 25)",
  "excerpts": [
    {
      "id": "the-javascript-refresh",
      "title": "The JavaScript Refresh",
      "href": "/2011/10/16/the-javascript-refresh/",
      "body": "Those of us who care a little about progressive enhancement and accessibility will be well aware of the “JavaScript refresh”. This is when the page initially renders — visible to the user — before deferred JavaScript kicks in. Think jQuery’s $(document).ready() or similar.\nThis problem occurs from very good practices. We have to make sure pages are accessible pre-JavaScript. […]",
      "date": 1318782609000
    },
    {
      "id": "the-user-and-the-public",
      "title": "The User / The Public",
      "href": "/2011/10/16/the-user-and-the-public/",
      "body": "I’ll start by recommending the book that has influenced this article:\nPublic Parts: How Sharing in the Digital Age Improves the Way We Work and Live. Author Jeff Jarvis is an interesting guy. He’s an old school journalist who is well versed in the web and what is has to offer the future. If you want to understand “privacy” […]",
      "date": 1318723003000
    },
    {
      "id": "web-apps-and-ios5",
      "title": "Web Apps and iOS5",
      "href": "/2011/10/13/web-apps-and-ios5/",
      "body": "One less advertised feature of iOS5 is Mobile Safari CSS support for position:fixed. Much overdue, and very useful for creating “web apps” where navigation bars are fixed to the viewport’s edge (top or bottom), allowing content to scroll naturally underneath.\nSome mobile bowsers already support this (see Mobile HTML5 and When can I use…) and all modern desktop browsers […]",
      "date": 1318539515000
    },
    {
      "id": "beyond-superficial-with-css3",
      "title": "Beyond superficial with CSS3",
      "href": "/2011/10/05/beyond-superficial-with-css3/",
      "body": "Last week I wrote Building for Future Design — the notion: to advance web design we must build on solid foundations. Never forget accessibility.\nSix Revisions published the very timely article Are You Using CSS3 Appropriately? by Delwin Campbell this week in which he reaches similar conclusions to me; usability, accessibility and user experience are our main objectives.\nIt’s a very […]",
      "date": 1317855405000
    },
    {
      "id": "building-for-future-design",
      "title": "Building for Future Design",
      "href": "/2011/10/01/building-for-future-design/",
      "body": "2011 is vanishing fast!\nI’ve been busy working hard at my new home (Browser) refining my front-end coding skills.\nMy focus has been on honing the semantic and accessible nature of the websites we build. That is the underlying requirement I need to fulfil my mandate of designing superb user experiences. It’s really all about pushing website design forward. […]",
      "date": 1317474186000
    },
    {
      "id": "what-is-mobile",
      "title": "What is mobile?",
      "href": "/2011/09/14/what-is-mobile/",
      "body": "Have you ever seen someone walk down the street with a tower strapped to their back and a 24” flatscreen perched on one arm tweeting away? We can assert that anyone “mobile” is more than likely “small-screen” but there is still a strong distinction between the two. “Mobile” suggests either:\n\nuse of a specific handheld device — […]",
      "date": 1316006024000
    },
    {
      "id": "save-the-planet-with-css",
      "title": "Save the planet with CSS!",
      "href": "/2011/09/04/save-the-planet-with-css/",
      "body": "I’ve been quiet lately (big updates on the horizon) so a quick one for this evening:\nMy pre-launch checklist for website builds has always include “create print.css”. Most of the time I forget (or ignore it). It seems like the default thing to do though. Until you think about it.\nWho prints web pages?\nI do sometimes. Invoices, receipts, […]",
      "date": 1315159739000
    }
  ],
  "nextPage": "/blog/page/26/",
  "prevPage": "/blog/page/24/",
  "pageTitle": "Blog (page 25) – David Bushell – Web Design (UK)"
}