{
  "pagePath": "/blog/page/39/",
  "pageHeading": "Blog (page 39)",
  "excerpts": [
    {
      "id": "dandad-newblood-2009",
      "title": "D&AD New Blood 2009",
      "href": "/2009/06/30/dandad-newblood-2009/",
      "body": "D&amp;AD New Blood the annual exhibition for design graduates.\n\nThis years New Blood took place at Kensington Olympia a very nice space for such an exhibition. Scroll down for photos (click thumbnails for full version).\nThanks to D&amp;AD’s profile within the design and advertising industries, the exhibition is the most effective graduate recruitment fair for would-be creative […]",
      "date": 1246361278000
    },
    {
      "id": "secret-blisters",
      "title": "Secret Blisters",
      "href": "/2009/06/28/secret-blisters/",
      "body": "Secret Blisters screen print poster show at Print Club London - 35 artists, 35 limited edition prints, 35 pounds each.\nFriday night I went to Print Club London in Dalston (London E8) to see the Secret Blisters screen print gallery (photos below). I was expecting a good night but the showcase was incredible. Thankfully it was […]",
      "date": 1246188954000
    },
    {
      "id": "giant-robots-and-art",
      "title": "Giant Robots and ART",
      "href": "/2009/06/21/giant-robots-and-art/",
      "body": "Heading to the cinema to watch Transformers 2 yesterday afternoon I saw something that turned out to be far more interesting than the film. The giant  “ A  R  T  “ (pictured below) certainly caught my eye as I walked over the West India Quay bridge. After more research apparently it’s […]",
      "date": 1245585019000
    },
    {
      "id": "colour-in-the-city",
      "title": "Colour in The City",
      "href": "/2009/06/14/colour-in-the-city/",
      "body": "The City can be a bit dull at times. Let’s splash more colour around.\nFriday I walked past YCN’s new studio space and saw the window display they have up. It’s such a great installation, I’ll definitely have to return when they’re open to look inside.\n\nRead more about the YCN studio in this Creative Review article.\nAnd […]",
      "date": 1244987491000
    },
    {
      "id": "waterstones-space-opera",
      "title": "Waterstones Space Opera",
      "href": "/2009/06/09/waterstones-space-opera/",
      "body": "Waterstones book display - some very eye catching book designs.\nLondon Underground has decided to strike today for 48 hours which has slightly inconvenienced my journey to and from work. Rather than getting terribly angry about the whole situation I’m going to take it as a challenge to see more of London (probably from a bus […]",
      "date": 1244573426000
    },
    {
      "id": "readable-type",
      "title": "Readable Type",
      "href": "/2009/06/07/readable-type/",
      "body": "Readability and Legibility are words often interchanged in general conversation, however they both have a significant difference when thinking about the text we use on websites (and in all digital and printed work).\nThis article was written for a presentation at Base Creative.\nReadability\nIf we are providing a piece of textual information readability can be defined as […]",
      "date": 1244407342000
    },
    {
      "id": "website-update",
      "title": "Website Update",
      "href": "/2009/06/06/website-update/",
      "body": "dbushell.com has a brand new look!\nThe previous version of my website was created just before graduation to showcase my design portfolio. Now just over a year later I’ve finally found time to update it. The new look and layout is a lot more sophisticated and provides room for my new blog and other projects that […]",
      "date": 1244320297000
    }
  ],
  "nextPage": null,
  "prevPage": "/blog/page/38/",
  "pageTitle": "Blog (page 39) – David Bushell – Web Design (UK)"
}