{
  "dateUnix": 1262809222000,
  "dateFormatted": "Wednesday 6 Jan 2010",
  "pageHeading": "All about the Old School",
  "pagePath": "/2010/01/06/all-about-the-old-school/",
  "innerHTML": "<p>So far this week has very much had a retro feel to it which is a tad odd since we’ve just started a new year, but I’m not a “new year” kinda guy anyway. While I’m ploughing forward with new projects and gusto I’ve found three things that have made me more interested in looking backwards.</p>\n<h3 id=\"vintage-ads\">Vintage Ads</h3>\n<p>Monday I was sidetracked for hours when I stumbled upon the website <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.vintageadbrowser.com/\">Vintage Ad Browser</a>.</p>\n<p><a href=\"http://www.vintageadbrowser.com/tobacco-ads-1950s/2\"><p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/lucky-strike-ad.jpg\" alt=\"\"></p>\n</a></p>\n<p>They don’t make ‘em like that anymore!</p>\n<p>There’s probably hundreds of vintage ads in the collection. I’d take ads like this anyday over the rubbish that’s literally shouted at us on today’s TV. Ok, so the tobacco ad above probably isn’t the best example, but compared to contemporary ads I’d still call it elegant and sophisticated.</p>\n<p>Mini-rant over and on to the next link:</p>\n<h3 id=\"the-movie-title-stills-collection\">The Movie Title Stills Collection</h3>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.annyas.com/screenshots/\">The Movie title stills collection</a> does what it says on the tin. When we design a movie poster today we float the heads of the leading actors below Trajan (if the film is set in today’s world) or Papyrus (if the film is set in the past or future).</p>\n<p><a href=\"http://www.annyas.com/screenshots/\"><p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/anatomy-of-a-murder.jpg\" alt=\"\"></p>\n</a></p>\n<p>Back in the day the likes of Saul Bass were shaking things up with awesome typography.</p>\n<p>And last but not least…</p>\n<h3 id=\"the-typeface-film\">The Typeface Film</h3>\n<p>I found out via Twitter that <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://typeface.kartemquin.com\">The Typeface Film</a> is premiering in London this month at the world famous <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://stbride.org/events/typeface\">St Bride Library</a>. I’ve (hopefully) snapped up a few tickets. Check out the trailer below:</p>\n<p>The St Bride screening is on the 21st January. Check back here for a field report! So exciting.</p>\n<p>In the meantime why not <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.twitter.com/dbushell\">follow me</a> on Twitter!</p>\n<p>And keep up to date with assorted goodies at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">Design Heroes</a>.</p>\n",
  "pageExcerpt": "So far this week has very much had a retro feel to it which is a tad odd since we’ve just started a new year, but I’m not a “new year” kinda guy anyway. While I’m ploughing forward with new projects and gusto I’ve found three things that have made me more interested in looking […]",
  "pageTitle": "All about the Old School – David Bushell – Web Design (UK)"
}