{
  "dateUnix": 1331429092000,
  "dateFormatted": "Sunday 11 Mar 2012",
  "pageHeading": "SVG, all fun and games!",
  "pagePath": "/2012/03/11/svg-all-fun-and-games/",
  "innerHTML": "<p>When I wrote <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2012/01/16/resolution-independence-with-svg/\">Resolution Independence</a> for Smashing Magazine I focused almost exclusively on SVG (<em>Scalable Vector Graphics</em>) to save our souls from high-resolution hell.</p>\n<p>SVG is more than just a vector graphic format. I’m here to tell you why it’s better than sliced bread and highlight some of the problems you’ll encounter in everyday front-end usage.</p>\n<h2 id=\"features-support\">Features / Support</h2>\n<p>As amazing as SVG is (and it really is amazing) its usage is not as simply as “browser support” — another reason why you should <a href=\"/2012/03/03/forget-about-browser-support/\">forget that idea</a>. All modern browsers now <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://caniuse.com/#search=SVG\">support</a> SVG for image elements and CSS backgrounds. But “support” only extends so far. The SVG spec has a whole load of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/SVG/filters.html\">filter effects</a>, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/SVG/interact.html\">interactive events</a>, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/SVG/animate.html\">animation</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/SVG/script.html\">scripting</a> abilities. While some browsers can render basic vector graphics, not all of them offer this additional functionality. Thankfully, browsers seem to ignore what they can’t handle making graceful degradation a possibility.</p>\n<p>Even when features are available they can be notoriously slow. Applying filters is akin to Photoshopping on low memory. Browsers also have very tight “security” restrictions when using <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://developer.mozilla.org/en/SVG/SVG_as_an_Image\">SVG as an image</a> (something to remember or you’ll be scratching your head for hours wondering why the damned thing isn’t working). <strong>Inline SVG</strong> is a formidable beast. It’s XML within your HTML. It can be styled with CSS and manipulated with JavaScript just like the DOM. Unlike HTML, SVG elements can be <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.w3.org/TR/SVG/coords.html#TransformAttribute\">transformed</a> and rotated without advanced CSS3. Powerful stuff this SVG, I’m sure you’ll agree.</p>\n<h2 id=\"playing-nice\">Playing Nice</h2>\n<p>As I design &amp; build more often with SVG I come across as many bugs and inconstancies as I do delights. Most notable are those that affect <strong>scalability</strong>, the whole reason to use SVG in the first place.</p>\n<p>All the bugs I’ve come across are well known by browser developers but fixes aren’t trivial. The more interest we generate, the quicker someone will dedicate their time to fix these things. Nobody likes developing unpopular tech. So I ask please, let’s put the CSS3 down for a while and iron these suckers out! Not convinced? Try this for size:</p>\n<h3 id=\"svg-and-css-3d-transforms\">SVG and CSS 3D Transforms</h3>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://24ways.org/2010/intro-to-css-3d-transforms\">CSS 3D Transforms</a> can be stunning. They can be tacky. Whatever you think, they sure are hell are impressive. The trouble is all elements are rasterised as a flat graphic before the magic happens. (Watch <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=xuMWhto62Eo\">Webkit in Your Living Room</a> by Netflix developer Matt Seeley to understand why.) This means that anything — including SVG — that is scaled larger, or brought towards the viewport on the z-axis, will pixelate and blur.</p>\n<h3 id=\"svg-and-css-backgrounds\">SVG and CSS Backgrounds</h3>\n<p>With CSS 3D Transforms it’s fairly clear why this happens. Manipulating the DOM is an expensive hobby, doing so in 3D space is currently a pipe dream.</p>\n<p>There are, however, other situations in which this kind of <strong>early rasterisation</strong> catches us of guard. <strong>Firefox</strong> has a bug (I believe <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=600207\">this one</a>) relating to background images. I’ve uploaded a <a href=\"/demos/svg/scaling-09-03-12/\">demo and workaround</a> and a screenshot of the problem below:</p>\n<p class=\"b-post__image\"><a href=\"/demos/svg/scaling-09-03-12/\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2012/03/svg-rendering.png\" alt=\"SVG pixelated rendering in Firefox\"></a></p>\n\n<p> Blurry SVG is obviously not the desired result.</p>\n<p>Under certain conditions Firefox rasterises the graphic before applying the <code>background-size</code>. What’s the solution? Provide a bigger SVG!</p>\n<p>That doesn’t initially make sense — surely vector graphics are infinite in size by their nature? But remember that all points within an SVG file relate to an initial height &amp; width of the container. These values get translated directly into pixel units. In my Smashing Magazine article I had success changing these values to <code>em</code> units but that solution was short lived and probably ill-informed.</p>\n<p>The real problem is that my 10×10 star in this example — with points like <code>5, 8.292</code> defining it — is rasterised at 10×10 pixels and then blown up. By upping the container size and resizing all points by a factor of 10 (or even 100) I can ensure rasterisation at much large sizes. This can even be done by applying a transform like <code>transform=&quot;scale(100,100)&quot;</code> to the group, thus avoiding longer points like <code>500, 829.2</code> that would bloat file size — nifty!</p>\n<p>As with everything this workaround has its own caveats. Browsers that have implementations like Firefox will be forced to rasterise SVG files on canvases far bigger than required. <strong>Bitmap data takes up a lot of memory</strong>. This workaround doesn’t come free of charge.</p>\n<hr>\n<p>I’ll be working with SVG a lot over the next few months and will be sure to document further eyebrow raisers as I spot them!</p>\n",
  "pageExcerpt": "When I wrote Resolution Independence for Smashing Magazine I focused almost exclusively on SVG (Scalable Vector Graphics) to save our souls from high-resolution hell.\nSVG is more than just a vector graphic format. I’m here to tell you why it’s better than sliced bread and highlight some of the problems you’ll encounter in everyday front-end usage.\nFeatures […]",
  "pageTitle": "SVG, all fun and games! – David Bushell – Web Design (UK)"
}