{
  "dateUnix": 1451901600000,
  "dateFormatted": "Monday 4 Jan 2016",
  "pageHeading": "CSS Framework for PartsGiant",
  "pagePath": "/2016/01/04/css-framework-for-partsgiant/",
  "innerHTML": "<p><strong> <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> is a soon to launch e-commerce store based in Michigan, USA. </strong></p>\n<p>I was hired to build the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> front-end CSS framework and HTML templates. The work would be done in stages throughout the year. This required flexibility on my part and scalability in the codebase I developed.</p>\n<p>I’ve always championed the idea of maintainable, future-proof coding practices. With this project I’d put my own ideas to the test by building upon work I’d done months before.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-designs.png\" alt=\"PartsGiant Designs\"></p>\n\n<h2 id=\"stage-1-responsive-website\">Stage 1: Responsive Website</h2>\n<p>To kick off the project <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> provided 15 template designs and an interactive wireframe mock-up of the website.</p>\n<p>I began by doing a ‘content’ or ‘component’ inventory. Basically, this means going through the design and itemising common elements and patterns. These can be coded once and reused across multiple templates (or used as a base for more advanced components).</p>\n<p>I started coding the typographic elements. This is usually a simple task but a vital ingredient. The client gave me freedom to adapt the designs to ensure consistency. I documented each component with HTML examples to show structure and CSS class names. I find a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://csswizardry.com/2015/08/bemit-taking-the-bem-naming-convention-a-step-further/\">BEM</a>-like naming convention most usable.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-buttons.png\" alt=\"Button component - PartsGiant CSS Framework\"></p>\n\n<p>In the screenshots below you can see how the <em>Dropdown</em> component makes use of a <em>Button</em> (above). The basic <em>Dropdown</em> was inherited for more advanced versions like the cart preview. The <em>Dropdown</em> also exists as part of the <em>Search</em> component.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-dropdowns.png\" alt=\"Dropdown component - PartsGiant CSS Framework\"></p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-search.png\" alt=\"Search component - PartsGiant CSS Framework\"></p>\n\n<p>The primitive components like the <em>Button</em> allowed for rapid development of similar use cases:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-sorting.png\" alt=\"Sorting component - PartsGiant CSS Framework\"></p>\n\n<p>Products are listed across the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> website with varying amounts of content. I created one <em>Product</em> component whose children can be added or removed depending on use. The <em>Stars</em> and <em>Rating</em> sub-components were abstracted for use elsewhere.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-products.png\" alt=\"Product component - PartsGiant CSS Framework\"></p>\n\n<p>Whilst developing these components I documented them in a pattern library (or “front-end style guide” if you prefer that terminology).</p>\n<p>To complete the library I identified common layout patterns. With these I could quickly piece together each template and insert the required components. Very little additional CSS was required for individual templates. In these cases I created larger component groups rather than applying unique styles to the page.</p>\n<p>The result is a modular CSS framework with minimal repetition.</p>\n<p><strong>The final CSS stylesheet was 147KB</strong> (unminified and uncompressed). That’s very small for such a large e-commerce website.</p>\n<h2 id=\"stage-2-admin-interface\">Stage 2: Admin Interface</h2>\n<p>Later in the year I was asked by <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> to build their admin interface that would be used to manage products, customers, orders, and other content. Another 15 template wireframes were provided. The design shared the style of the main website so it made sense to built upon the CSS framework I’d already developed.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-admin.png\" alt=\"PartsGiant Admin Design\"></p>\n\n<p>I decided to keep the admin styles as a separate add-on, rather than integrating back into the main CSS to avoid unnecessary file size on the user-facing pages.</p>\n<p><strong>The final admin stylesheet was an additional 24KB</strong> (on top of the 147KB base).</p>\n<h2 id=\"stage-3-mobile-framework\">Stage 3: Mobile Framework</h2>\n<p>Although I had developed the main website with a responsive and ’mobile-first’ approach it was decided that a dedicated mobile website would allow for a more tailored experience. This also gave us an opportunity to finely tune page speed and performance for smaller screens.</p>\n<p>Usually I prefer one responsive website but for e-commerce I can understand the benefits of the mobile website approach.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/portfolio/partsgiant-mobile.png\" alt=\"PartsGiant Mobile Design\"></p>\n\n<p>Like the first two stages <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> sent me wireframes to build (around 20 this time). I branched of the main CSS framework and created a reduced version for mobile. Many of the smaller components are shared. Those not used on mobile were removed.</p>\n<p>I coded each component as a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://sass-lang.com/\">Sass</a> include (in separate files) so nothing was duplicated. An update to the <em>Button</em> for example would update both the responsive and mobile frameworks.</p>\n<p><strong>The entire mobile CSS framework was only 54KB</strong>.</p>\n<p>On the main website I’d used jQuery for interactive components. On mobile I removed this dependency; only 14KB of JavaScript was needed for the interactive components. All of which were progressively enhanced to ensure accessibility without JavaScript.</p>\n<h2 id=\"final-thoughts\">Final Thoughts</h2>\n<p>It was a joy to work with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> and I look forward to any opportunity I may receive to work with them again. Most of the work I do is maintained by the website owner once the project is over. With this project it was a nice experience to jump back into my ‘old’ code and see for myself how usable my methods are. Thankfully, they work!</p>\n<p>A big decision early on was to decide whether or not to build upon an existing ‘framework’ like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://getbootstrap.com/\">Bootstrap</a>. As of v3.3.6 Bootstrap’s base CSS is 146KB alone — my final stylesheet was only 1KB larger. Had I built upon Bootstrap it would have been upwards of 250KB. It would also have been near impossible to achieve the 54KB slimline framework I developed for mobile.</p>\n<p>Bootstrap is a good tool for prototyping but in my opinion, unnecessary and overly complicated for production. On the surface these starter frameworks look tempting, but honestly, from experience they really don’t provide much of a head start. Even before visual design is applied too many decisions have been made in the HTML &amp; CSS that require resetting. This bloats the code and is much harder to understand and maintain.</p>\n<p>Documentation is very important for a project like this. But it can be overdone. As I developed components for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.partsgiant.com/\">PartsGiant</a> I place them on a single web page to test. I added notes and code examples only for the less intuitive ones. Eventually I categorised them on multiple pages using the website navigation and layout patterns for better formatting.</p>\n<p>Documentation wasn’t actually requested by the client (they were only expecting a few comments in the stylesheet). With my approach I was able to deliver something much more readable with very little overhead. What I delivered was simply a product of my process building the CSS framework.</p>\n<p><a href=\"/contact/\">Looking for a developer/designer for your project? Get in touch!</a></p>\n",
  "pageExcerpt": " PartsGiant is a soon to launch e-commerce store based in Michigan, USA. \nI was hired to build the PartsGiant front-end CSS framework and HTML templates. The work would be done in stages throughout the year. This required flexibility on my part and scalability in the codebase I developed.\nI’ve always championed the idea of maintainable, […]",
  "pageUndated": true,
  "pageTitle": "CSS Framework for PartsGiant – David Bushell – Web Design (UK)"
}