{
  "dateUnix": 1254400790000,
  "dateFormatted": "Thursday 1 Oct 2009",
  "pageHeading": "Introducing Design Heroes",
  "pagePath": "/2009/10/01/introducing-design-heroes/",
  "innerHTML": "<p>Hero - he-ro [heer-oh] - noun, a man of distinguished courage or ability, admired for his brave deeds and noble qualities.</p>\n<p><em>I may be using the word loosely here - it’s certainly not just for men.</em></p>\n<p>I’ve created a new website called <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">Design Heroes</a>. For three reasons:</p>\n<ul>\n<li>I had the domain and wasn’t doing anything with it.</li>\n<li>I need somewhere to store all my design related links (and my browser’s bookmark menu handles large numbers about as well as a 3-bit calculator).</li>\n<li>The word “heroes” isn’t used enough when talking about good designers.</li>\n</ul>\n<h3 id=\"what-is-design-heroes-\">What is Design Heroes?</h3>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">Design Heroes</a> is a website that bookmarks design related links. Links vary in themes from inspirational portfolios to informative must-read articles. Links are tagged, and these tags can be used as filters to retrieve other relevant links. The general idea is that it should be able to organise bookmarks (without any effort).</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">Design Heroes</a> is not just another design blog–slash–aggregator, well it is (kind of), but  it aims to be more of a personal project to bookmark things I find interesting and share them with others. And more importantly it should be easier to browse than twitter. It’s for those times when I remember something I’ve seen or read months ago but can never remember the link. Hopefully you’ll find it useful too.</p>\n<p>Check out <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">www.designheroes.co.uk</a> and let me know what you think!</p>\n<h3 id=\"html5-and-css3\">HTML5 and CSS3</h3>\n<p>The site is also my first full site experiment with HTML5 and CSS3. There are some fancy features being used like <em>text-shadow</em> and <em>border-radius</em> that should degrade nicely in older browsers. I’ve tested in IE8, IE7, Firefox and Safari. I only test in IE6 if I’m being paid! It doesn’t validate yet but it will once I’ve cleaned it up a little.</p>\n<p class=\"note\">Thanks to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://dictionary.reference.com/browse/heroes\">dictionary.com</a> for the definition of “hero”!</p>\n\n",
  "pageExcerpt": "Hero - he-ro [heer-oh] - noun, a man of distinguished courage or ability, admired for his brave deeds and noble qualities.\nI may be using the word loosely here - it’s certainly not just for men.\nI’ve created a new website called Design Heroes. For three reasons:\n\nI had the domain and wasn’t doing anything with it.\nI need […]",
  "pageTitle": "Introducing Design Heroes – David Bushell – Web Design (UK)"
}