{
  "dateUnix": 1350997494000,
  "dateFormatted": "Tuesday 23 Oct 2012",
  "pageHeading": "The Real Cost of Retina",
  "pagePath": "/2012/10/23/the-real-cost-of-retina/",
  "innerHTML": "<p>When the new iPad went on sale earlier this year the interest in high-resolution website design skyrocketed. We saw an influx of half-baked “<a href=\"http://dbushell.com/2012/07/13/vector-graphics-retina-and-you/\">Retina</a>“ solutions.</p>\n<p>Alongside this the bigger picture — so to speak — of <a href=\"http://www.w3.org/community/respimg/\">responsive images</a> produced lengthy debate. We’re starting to see the fruits of that labour with a new <a href=\"http://responsiveimagescg.github.com/picture-element/\">picture element proposal</a>. This is a good thing but it’s not perfect.</p>\n<p>To accurately serve the best image we need to know:</p>\n<ul>\n<li>Screen resolution *</li>\n<li>Screen pixel density</li>\n<li>Connection bandwidth</li>\n</ul>\n<p>The first two can be achieved today with <a href=\"http://www.w3.org/TR/css3-mediaqueries/\">CSS3 media queries</a>. Understanding connection bandwidth is still a long way away (see <a href=\"http://dvcs.w3.org/hg/dap/raw-file/tip/network-api/Overview.html\">The Network Information API</a> and <a href=\"https://docs.google.com/document/d/1xCtGvPbvVLacg45MWdAlLBnuWa7sJM1cEk1lI6nv--c/mobilebasic?pli=1\">HTTP Client Hints</a>). I’ve seen responsive image implementations that claim to estimate this — they’re not good enough. And even if we achieve this trifecta we’re forgetting a forth point:</p>\n<ul>\n<li>Device bandwidth cap</li>\n</ul>\n<p>Mobile contracts have extortionate data costs (at least in the UK). It’s not getting any better. With <a href=\"http://www.theverge.com/2012/10/22/3539628/ee-lte-price-plans\">EE’s LTE pricing plan</a> you can pay £36/month for a whopping 500mb. As many have widely mocked today: at full throttle — averaging 15mbps — that allowance is going to last you a staggering five minutes or so. Just splendid.</p>\n<p>We may think that serving high-res images on a website is going to drastically enhance the experience, but are we considering the real cost? I’ll tell you one thing:</p>\n<p><strong>Please spare me your high-res “Retina-ready” images!</strong></p>\n<p>I can’t afford it. At least for the foreseeable future.</p>\n<p>Seek <a href=\"http://coding.smashingmagazine.com/2012/01/16/resolution-independence-with-svg/\">resolution independence</a> by employing a design style more suited to the <a href=\"http://dbushell.com/2012/09/25/what-is-the-medium/\">medium</a>. More visuals through CSS and SVG; less bitmap data.</p>\n<p><strong>* Update:</strong> this should actually say the size of an image’s containing element, <a href=\"http://twitter.com/paulrobertlloyd/status/260732321081200640\">thanks Paul</a>!</p>\n",
  "pageExcerpt": "When the new iPad went on sale earlier this year the interest in high-resolution website design skyrocketed. We saw an influx of half-baked “Retina“ solutions.\nAlongside this the bigger picture — so to speak — of responsive images produced lengthy debate. We’re starting to see the fruits of that labour with a new picture element proposal. […]",
  "pageTitle": "The Real Cost of Retina – David Bushell – Web Design (UK)"
}