{
  "dateUnix": 1278621823000,
  "dateFormatted": "Thursday 8 Jul 2010",
  "pageHeading": "Morning design blogs",
  "pagePath": "/2010/07/08/morning-design-blogs/",
  "innerHTML": "<p>I’d like to say I spend my mornings sat peacefully in my slippers, a nice cup of tea to hand, the sun steadily rising in my kitchen window while I casually read the latest design blogs on my MacBook Pro. I would like to say that. But most mornings are a frantic bewildered rush to get to work on time.</p>\n<p>And I don’t own a MacBook Pro or any laptop for that matter.</p>\n<p>Despite the less than ideal morning I do try and spend half an hour getting up to speed with the design world. Google Reader is my aggregator of choice. The problem with RSS readers it that everything becomes so stale, so <em>“Google”</em> in my case. Design blogs have a habit of being rather attractive. For that reason any article that grabs my attention in the RSS feed gets opened properly before reading commences.</p>\n<p>My favourite design related blog has to be <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.creativereview.co.uk/cr-blog/\">Creative Review</a>. The articles are informative and the subsequent user discussion is outstanding (for Internet standards). The CR blog never fails to provoke humour, controversy, and a touch of wit from the many commentators. If you normally blank out comments (see YouTube) this blog will return your faith in the English language.</p>\n<p>Another blog I visit often is the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.bbc.co.uk/blogs/bbcinternet/\">BBC Internet Blog</a>. It’s BBC website biased obviously (which happens to be a bloody good website and a very good investment of license fees). There are many parts of the BBC’s online world that are exceptional and their Internet blog is a great behind-the-scenes look.</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.underconsideration.com/brandnew/\">Brand New</a> needs no further praise. I drop everything I’m doing when this one updates. Hopefully I’m not sipping my tea at that exact time.</p>\n<p>When I’m interested in product and packaging design I’ll see what’s new at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.yankodesign.com\">Yanko Design</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://packaginguqam.blogspot.com\">Packaging UQAM</a> . As I’m a graphic/web designer by trade these two blogs will often induce the <em>“I wish I could do that”</em> type of design envy. For illustration, digital art and photography I check out the likes of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://cowlor.net/\">Cowlor</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.theohsnapproject.com/ohsnap_blog/\">Oh, Snap!</a></p>\n<p>Perhaps the most peculiar blog residing in my RSS reader is <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.penciltalk.org/\">Pencil Talk</a>. I don’t know why because I rarely check it, but I feel I might miss out on something ground breaking one day if I ever remove it…</p>\n<p>I carry around many of the other big name blogs which I’m sure everyone already knows about. The other 90% of my feed consists of personal blogs from other designers. I plan to do a bigger showcase of my favourites soon! After my RSS reader has had a good shake down I’ll briefly check the last 12 hours of my twitter feed. I’ll be sure to find a few gems linked there.</p>\n<p>And that’s my design morning.</p>\n",
  "pageExcerpt": "I’d like to say I spend my mornings sat peacefully in my slippers, a nice cup of tea to hand, the sun steadily rising in my kitchen window while I casually read the latest design blogs on my MacBook Pro. I would like to say that. But most mornings are a frantic bewildered rush to […]",
  "pageTitle": "Morning design blogs – David Bushell – Web Design (UK)"
}