{
  "dateUnix": 1294616151000,
  "dateFormatted": "Sunday 9 Jan 2011",
  "pageHeading": "Happy New Ye…oh",
  "pagePath": "/2011/01/09/happy-new-ye-oh/",
  "innerHTML": "<p>Ah, it’s the 9th already?</p>\n<p>I don’t do New Year’s resolutions, but I do like to look forward every now and then to consider all the amazing opportunities out there. 2011 is going to be all about pushing boundaries in life and work.</p>\n<p>(Not sure what that means in reality but I’ve plenty of time to find out.)</p>\n<p>I’m working on some amazing projects at <a href=\"http://www.basecreative.eu\">Base Creative</a>. Hope I can say more soon! In the meantime, here’s a little web app I’m launching this week - <a href=\"http://kwib.it\">Kwibit</a> - it has a tagline that goes something like this <em>“collect and share your moments of inspiration”</em>.</p>\n<p>Things are so busy right now I’m losing track of days but that’s all good. Currently reading <a href=\"http://hardboiledwebdesign.com/samples/\">Hardboiled Web Design</a>. I was reluctant to buy it after feeling a bit empty finishing other much-tweeted about web dev books, but after the first few chapters I’m loving the style and even more so the message.</p>\n<p>I’m a little annoyed after copying the PDF to my Kindle. In fit-to-screen mode the text is far to small. Zooming means the page gets chopped in half vertically. I guess that’s hardboiled design! Any Kindle pros know if you can separate the text and drop the graphics/grid layout? Leave a comment!</p>\n<p>By the way, if you’re wondering what happened to my font design project I lost the rhythm and decided to put it on hold.</p>\n<p>My <strong>Link of the Month</strong> (a new feature sponsored by <a href=\"http://designheroes.co.uk\">Design Heroes</a>) is <a href=\"http://wordmark.it/\">Wordmark.it</a> - if you understand what it does you’ll cry with joy, I did.</p>\n<p>Happy January folks!</p>\n",
  "pageExcerpt": "Ah, it’s the 9th already?\nI don’t do New Year’s resolutions, but I do like to look forward every now and then to consider all the amazing opportunities out there. 2011 is going to be all about pushing boundaries in life and work.\n(Not sure what that means in reality but I’ve plenty of time to find […]",
  "pageTitle": "Happy New Ye…oh – David Bushell – Web Design (UK)"
}