{
  "dateUnix": 1399976189000,
  "dateFormatted": "Tuesday 13 May 2014",
  "pageHeading": "Web Fonts & Enhancements",
  "pagePath": "/2014/05/13/web-fonts-and-progressive-enhancements/",
  "innerHTML": "<p>Yesterday I found myself thoroughly impressed with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://laurakalbag.com/\">Laura Kalbag’s</a> effort to ensure the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://indietech.org/summit/\">Indie Tech Summit</a> website remains well designed.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2014/05/indie-tech-web-fonts.png\" alt=\"Indie Tech Summit web fonts\"></p>\n\n<p>In the screenshot above you can see the page design before and after web fonts have loaded. This is a superb example of <strong>progressive enhancement</strong>.</p>\n<p>Had web fonts failed to load I wouldn’t have known otherwise. Of course, in comparison the preferred design look so much nicer, but what’s important is that should this not be available, nothing looks noticeably broken.</p>\n<p>Laura is able to control the design this way because the web fonts are loaded via JavaScript and CSS has been written to address both scenarios.</p>\n<h2 id=\"asynchronicity\">Asynchronicity</h2>\n<p>By themselves web fonts aren’t dependant on JavaScript but many font providers require it to control usage and deter theft. Regardless, given their relatively large download size and our desire for progressive enhancement, I find asynchronous JavaScript loading to be a useful practice.</p>\n<p>In my <a href=\"/2014/05/07/responsive-design-for-uwe-wittwer/\">latest portfolio piece</a> I too have taken advantage of web font loading in order to improve the website’s typography:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2014/05/uwe-wittwer-kerning.png\" alt=\"Uwe Witter typography design\"></p>\n\n<p>As illustrated in the screenshot above, with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://typekit.com/fonts/futura-pt\">Futura PT from Typekit</a> spacing between letters — particularly the “w” and “e” — is uneven and requires manual adjustment. Without JavaScript to load and detect font availability I’d be stuck with bad kerning. In which case I’d rather see the more generic system font.</p>\n<p>Usually I’ll strive for simplicity wherever possible. In this case I wish a single <code>@font-face</code> CSS declaration was enough without messing around with JavaScript. Such is life as a front-end developer I suppose. It’s rarely simple but that’s ok. We first understand the problem then we decide the most appropriate solution. If that includes prioritising design integrity, even better.</p>\n",
  "pageExcerpt": "Yesterday I found myself thoroughly impressed with Laura Kalbag’s effort to ensure the Indie Tech Summit website remains well designed.\n\n\nIn the screenshot above you can see the page design before and after web fonts have loaded. This is a superb example of progressive enhancement.\nHad web fonts failed to load I wouldn’t have known otherwise. Of […]",
  "pageTitle": "Web Fonts & Enhancements – David Bushell – Web Design (UK)"
}