{
  "dateUnix": 1321001916000,
  "dateFormatted": "Friday 11 Nov 2011",
  "pageHeading": "The Good, the Bad, and the Logo",
  "pagePath": "/2011/11/11/the-good-the-bad-and-the-logo/",
  "innerHTML": "<p>Back in <strong>June 2010</strong> I wrote about <a href=\"/2010/06/30/using-svg-logos/\">using SVG</a> for your logo. When I realigned my website earlier this year (see: <a href=\"/2011/05/25/designing-a-new-me/\">Designing a new me</a>) I reverted back to the typical PNG and used the <code>-webkit-min-device-pixel-ratio</code> to provide a high-res version.</p>\n<p>Well 17 months ago I wasn’t as sharp as I am today with front-end standards and for whatever reason I settled on using the <code>&lt;object&gt;</code> and <code>&lt;embed&gt;</code> elements… what was I smoking? Well anyway, it didn’t occur to me that you can provide an SVG file as the source of an <code>&lt;img&gt;</code> element or as a background image in CSS — and I’ve now done just that, look up! <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://caniuse.com/#search=SVG\">Browser support</a> is pretty much across the board.</p>\n<p>Now because SVG scales by nature it is resolution independent, meaning I no longer require a media query for the @2x high-res PNG version (that only the iPhone 4 could see). If your logo resizes at different breakpoints (mine gets smaller below 480px) simply allow the <code>&lt;img&gt;</code> to scale. Or if you’re using a background image in CSS apply a <code>[background-size](http://www.css3.info/preview/background-size/)</code> in each media query in which it resizes.</p>\n<p>I’m using the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://html5boilerplate.com/docs/The-markup/#ie-html-tag-classes\">conditional comments trick</a> around my <code>&lt;html&gt;</code> element so that Internet Explorer versions below 9 can fallback to a PNG instead of SVG. All very simple and clean! I should probably use a JavaScript test to cover all bases.</p>\n<p>I do plan to realign/redesign my website again early next year. I’m also well aware I’ve made a few mistakes in my current markup and CSS — that’s a weasely disclaimer because I’m about to get very deep…</p>\n<h2 id=\"the-h1-debate\">The H1 Debate</h2>\n<p>You may have noticed my logo is actually a CSS background applied to the document’s first <code>&lt;h1&gt;</code>.</p>\n<p>Many professional developers and semantic purists including <strong>Harry Roberts</strong> — whom I very much respect — will argue that <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://csswizardry.com/2010/10/your-logo-is-an-image-not-a-h1/\">you’re logo is not a <code>&lt;h1&gt;</code></a>. I agree with everything Harry says regarding his approach, which <em>is</em> perfectly fine, but there is an alternative. To make sense of that, allow me to explain!</p>\n<p>I could say that in my case I don’t even have a “logo”, more of a stylised typographic illustration of my main heading “David Bushell does design”. I could also, in theory, achieve that style using CSS3 and not require an image replacement technique at all thus taking myself out of the equation, but I digress.</p>\n<p>My choice relates to the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2011/08/16/html5-and-the-document-outlining-algorithm/\">document outline</a> and the decision to make the website’s name a consistent top-level heading on every page across the site. (Whether I’ve got my document outline perfect is another debate.)</p>\n<p>I’d much prefer search engines, assistive technologies, and everything else to see the top-level <code>&lt;h1&gt;</code> as the first piece of content in the document rather than an image (like a logo). For this reason the logo is relegated to the realm of “style” and is not a piece of content whose value would be questionable in pole position. This trade off is based on what I consider a more appropriate content hierarchy. I could lead with the <code>&lt;h1&gt;</code> and continue with an <code>&lt;img&gt;</code> for the logo, but again, it really isn’t a valuable piece of content at that prominence. The heading serves to communicate ownership, the logo is merely branding.</p>\n<p>If I were to remove the website’s name as the top level <code>&lt;h1&gt;</code> and instead use the page’s first heading — e.g. this article’s title “The Good, the Bad, and the Logo” — I may need to promote my logo back into semantic document content and, of course, use an <code>&lt;img&gt;</code> element. Or I could make it visible elsewhere with CSS.</p>\n<p>Whether the logo needs to be <em>content</em> is secondary to the question: *<em>what should the document’s top level <code>&lt;h1&gt;</code> be? The website’s name, or the page heading? *</em>I know developers, SEO optimists, and others who provide arguments for both cases. (I know many <em>more</em> web practitioners who have no idea of what I’m talking about.) My document’s <code>&lt;header role=&quot;banner&quot;&gt;</code> (including the navigation &amp; advertisement) is site-wide, where as my page heading refers to the main <code>&lt;article role=&quot;main&quot;&gt;</code> below.</p>\n<p>Content and users come before SEO, in fact, they influence SEO (not vice-versa). On the majority of websites I build I believe that the website’s name should lead the content on every page. Whether you use multiple <code>&lt;h1&gt;</code> elements as HTML5 allows, or a <code>&lt;h1&gt;</code> and <code>&lt;h2&gt;</code> for legacy purposes, there is value in having the textual website name lead the content in the semantic markup and document outline. Much more value than an image for branding purposes; this can be applied with other branded styles in CSS. Once we’ve established that, applying it as a background image to the first <code>&lt;h1&gt;</code> is irrelevant to the semantic document, as are the brand colours etc.</p>\n<p><strong>I don’t believe a logo needs to be content</strong>. While your logo is an image in one sense, it doesn’t have to be an <code>&lt;img&gt;</code> in the document. It should never need to be an <code>&lt;img&gt;</code> nested inside a <code>&lt;h1&gt;</code> either. I am willing to be persuaded on what the <code>&lt;h1&gt;</code> should be, but that’s a separate debate in my eyes.</p>\n<p>There are semantics, and then there are HTML semantics. A “logo” can be interpreted in different ways that don’t necessarily conflict with properly built websites.</p>\n<hr>\n<p>Finally, what about logos made purely out of “CSS”? No. Never. That is absolutely, categorically, <em><strong>illogical</strong></em>. As a quirky esoteric challenge then sure, knock yourself out — but in practice? Don’t even joke about it!</p>\n<p>I hope you’ve enjoyed this article!</p>\n",
  "pageExcerpt": "Back in June 2010 I wrote about using SVG for your logo. When I realigned my website earlier this year (see: Designing a new me) I reverted back to the typical PNG and used the -webkit-min-device-pixel-ratio to provide a high-res version.\nWell 17 months ago I wasn’t as sharp as I am today with front-end standards […]",
  "pageTitle": "The Good, the Bad, and the Logo – David Bushell – Web Design (UK)"
}