{
  "dateUnix": 1360228167000,
  "dateFormatted": "Thursday 7 Feb 2013",
  "pageHeading": "On Responsive Navigation and Rendering",
  "pagePath": "/2013/02/07/on-responsive-navigation-and-rendering/",
  "innerHTML": "<p>When I launched my <a href=\"http://dbushell.com/2013/02/04/a-new-home/\">new website</a> earlier this week I implemented the <a href=\"http://coding.smashingmagazine.com/2013/01/15/off-canvas-navigation-for-responsive-website/\">off-canvas navigation</a> technique I’d written about for Smashing Magazine. It uses silky smooth CSS transitions and looks great on mobile (if I do say so myself).</p>\n<p>A small problem came when I set a high breakpoint. The navigation is always off-canvas up to a width of 60em (that’s normally 960px). While it’s possible to make the nav element fixed or fluid width — I opted for 70% — it looked awkward on tablet size screens. It’s very wide and the menu items are small resulting in masses of whitespace. Some whitespace is good, but this just looked unfinished.</p>\n<p>Not any more! I’ve added an intermediate state:</p>\n<p class=\"b-post__image\"><img src=\"/images/2013/02/responsive-navigation.png\" alt=\"responsive navigation\"></p>\n\n\n\n\n<h2 id=\"the-app-screen-\">The “app screen”</h2>\n<p>I’m experimenting with an intermediate state that essentially mimics the app screen we know and love. It utilises the available space for big touch-friendly buttons. This breakpoint sits between 40–60em. I quite like this design. It does feels a bit unusual initally, but then I guess it is — what do you think? <a href=\"http://twitter.com/dbushell\">Give me a tweet</a>.</p>\n<h2 id=\"a-note-about-css-transforms\">A note about CSS transforms</h2>\n<p>One of the issues with this CSS transitions/transforms is text rendering.</p>\n<p>When a web browser renders a page it starts drawing pixels to a single bitmap layer. Separate render layers may be created for things like <code>&lt;canvas&gt;</code>, <code>&lt;video&gt;</code>, transparency, masking, and other CSS filters. These layers are then composited.</p>\n<p>Say for example you do:</p>\n<pre><code class=\"language-css\"><span class=\"token selector\">.flyout</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token property\">transform</span><span class=\"token punctuation\">:</span> <span class=\"token function\">translate3d</span><span class=\"token punctuation\">(</span>-100%, 0, 0<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n    <span class=\"token property\">transition</span><span class=\"token punctuation\">:</span> transform 500ms ease<span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n<span class=\"token selector\">.flyout.is-active</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token property\">transform</span><span class=\"token punctuation\">:</span> <span class=\"token function\">translate3d</span><span class=\"token punctuation\">(</span>0, 0, 0<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n</code></pre>\n<p>Web browsers paint the <code>.flyout</code> element on its own render layer. After certain effects are applied these layers can be re-composited without having to touch the DOM or recalculate layout (an expensive performance hit). In certain situations, like CSS 3d transforms, the layers are rendered once then shipped over to the GPU for future composites. This hardware acceleration is an amazing speed boost. If the viewport resizes, or any other element changes, it’s probable that much of the page layout has to be recalculated (producing fresh render layers).</p>\n<p>That’s a very high-level overview and I’ve probably got some terminology wrong, but it gives you an idea of what’s happening.</p>\n<p>On standard definition displays you’ll likely notice the quality of text rendering diminishes. Sub-pixel antialiasing is lost because text is rasterised on the layer and then moved about before the final composition. Text becomes slightly blurry — at least, less perfect than we’re used to seeing.</p>\n<p>This side-effect is less noticeable during animation and on high pixel density screens. Which will be the standard in a few years. Hopefully. Who am I kidding…</p>\n<p>Anyway, I don’t think it’s a game changer. It’s still far better than what users will see on older PCs without ClearType.</p>\n<p class=\"p--small\"><em>iPad Mini PSD by <a href=\"http://dribbble.com/shots/841755-iPhones-iPad-minis-PSD\">Anton Kudin</a> and Nokia Lumia 920 by <a href=\"http://dribbble.com/shots/780376-lumia-920-yellow\">Matias Gallipoli</a></em></p>\n\n",
  "pageExcerpt": "When I launched my new website earlier this week I implemented the off-canvas navigation technique I’d written about for Smashing Magazine. It uses silky smooth CSS transitions and looks great on mobile (if I do say so myself).\nA small problem came when I set a high breakpoint. The navigation is always off-canvas up to a […]",
  "pageTitle": "On Responsive Navigation and Rendering – David Bushell – Web Design (UK)"
}