{
  "dateUnix": 1321053927000,
  "dateFormatted": "Friday 11 Nov 2011",
  "pageHeading": "In Favour of Semantics",
  "pagePath": "/2011/11/11/in-favour-of-semantics/",
  "innerHTML": "<p>The true value of a website is its content.</p>\n<p><em>Data</em> — until semantics and presentation turn it into <em>information</em>. If that value is true we can therefore infer that semantics reign supreme in front-end website production.</p>\n<p>The thing is, not all content is created equally. There needs to be a pragmatic interpretation of how content is represented. For most users of a web browser its all about what is <em>visible</em>. For those using screen readers it’s all about what is <em>audible</em>.</p>\n<p>We have multiple layers of content, and multiple presentations of the same content. We have semantic information that can be aggregated from HTML alone and visual content that offers support for visual users (which make up the majority of users, but not everyone). The visual style applied with CSS often changes content into a different form. For example, it can change a simple hyperlink into a visual button with a graphical icon. That icon would have little value in the raw HTML where a link will suffice. We can also provide multiple versions of the same content, e.g. a video or animation with an alternative description, or better yet, a more thorough written transcript. In this case both versions of the content can be marked up in HTML and prove useful.</p>\n<p>The whole reason for HTML semantics is to supply meaning in one specific regard when the content is accessed in its rawest state. It’s an <em>accessible baseline</em>. We can use CSS or JavaScript to enhance that content in presentation — a second level.</p>\n<p>There is nothing wrong with being a purist in terms of HTML semantics. That’s commendable. That’s future proofing your content, which is why I strongly disagree with the notions suggested in <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2011/11/11/our-pointless-pursuit-of-semantic-value/\">Divya Manian’s Smashing Magazine article</a>. You just have to realise that semantic HTML is just the first layer of accessible content.</p>\n<p>Website design is moving more and more towards visual, interactive presentation of content. That makes the accessible semantic HTML layer all the more important.</p>\n",
  "pageExcerpt": "The true value of a website is its content.\nData — until semantics and presentation turn it into information. If that value is true we can therefore infer that semantics reign supreme in front-end website production.\nThe thing is, not all content is created equally. There needs to be a pragmatic interpretation of how content is represented. […]",
  "pageTitle": "In Favour of Semantics – David Bushell – Web Design (UK)"
}