{
  "pagePath": "/blog/page/11/",
  "pageHeading": "Blog (page 11)",
  "excerpts": [
    {
      "id": "on-browser-support",
      "title": "On Browser Support",
      "href": "/2013/04/26/on-browser-support/",
      "body": "The recently launched jQuery 2.0 leaves behind support for IE6–8. This has lead to some interesting opinions on what browsers we should be supporting. Here’s my take:\nDefining support\nSupporting a browser to me does not mean that a website will be identical in form and function. That is a fool’s errand leading to an unmanageable mess […]",
      "date": 1366979829000
    },
    {
      "id": "ember-data-and-mongodb",
      "title": "Ember Data and MongoDB",
      "href": "/2013/04/25/ember-data-and-mongodb/",
      "body": "Macaque lives! If you’ve been following my recent blog posts —\n\nPart 1: Macaque: A New Project\nPart 2: Test Driven Development\nPart 3: Prototyping\n\n— you’ll know I’m building a to-do app with Node and Ember. Macaque’s development has reached the point where I can use the app itself for issue and feature tracking. If you want to […]",
      "date": 1366912828000
    },
    {
      "id": "prototyping",
      "title": "Prototyping",
      "href": "/2013/04/18/prototyping/",
      "body": "A couple of weeks ago I embarked upon a new side quest: make a list app and use as much JavaScript in the stack as possible. Fighting adversity, I’ve made progress:\n\n\n\nTwitter Bootstrap is a great UI toolkit for prototypes. Don’t let it seduce you, my underlying code ain’t pretty!\n\n\n\n\nLearning Curve\nAfter the excitement of last weekend’s […]",
      "date": 1366314337000
    },
    {
      "id": "test-driven-development",
      "title": "Test Driven Development",
      "href": "/2013/04/14/test-driven-development/",
      "body": "I’ve been hacking away at my side project Macaque today. It’s quickly becoming the world’s most over-engineered to-do app. At the moment it’s categorising primates:\n\n\nIsn’t it beautiful?\nAs you can see, my big ideas for Macaque focus on design but I am building it end-to-end. For the supporting back-end I’ve spent the weekend writing and testing […]",
      "date": 1365968197000
    },
    {
      "id": "macaque-a-new-project",
      "title": "Macaque: A New Project",
      "href": "/2013/04/07/macaque-a-new-project/",
      "body": "Today I started a new project. Macaque will be a personal to-do or list app. Sounds simple, right? Unlike my other side projects I’m coding and designing in public from day one.\nThis project exists because:\n\nI want to learn more Node and Ember\nI’ve failed to find a list app I like (oh lord, please don’t suggest […]",
      "date": 1365370539000
    },
    {
      "id": "the-flat-build-2",
      "title": "The Flat Build (2)",
      "href": "/2013/04/05/the-flat-build-2/",
      "body": "My article The Flat Build was a slow burner but it has picked up steam recently and for the first time in like, forever, I’m building a pre-designed* website without having design influence. This has proven to be a good opportunity to refine and expand upon my flat build workflow (again).\nI’m aware I’m reinventing more […]",
      "date": 1365157578000
    },
    {
      "id": "on-responsive-layout-and-grids",
      "title": "On Responsive Layout and Grids",
      "href": "/2013/03/19/on-responsive-layout-and-grids/",
      "body": "I often get asked which responsive grid system I use. This is a very frustrating question because it implies a requirement where I have none. With the myriad solutions presented I can’t blame people for thinking they have a choice to make.\nThis article is my response to that question.\nAnatomy of a grid system\nResponsive grid systems […]",
      "date": 1363692826000
    }
  ],
  "nextPage": "/blog/page/12/",
  "prevPage": "/blog/page/10/",
  "pageTitle": "Blog (page 11) – David Bushell – Web Design (UK)"
}