{
  "pagePath": "/blog/page/11/",
  "pageHeading": "Blog (page 11)",
  "excerpts": [
    {
      "id": "the-raster-image-paradox",
      "title": "The Raster Image Paradox",
      "href": "/2013/06/03/the-raster-image-paradox/",
      "body": "The recent Clown Car Technique is a clever use of SVG but as with all “adaptive image” solutions for responsive web design it’s not something I’d be comfortable using.\nOne image to rule them all\nWhen I build web pages I generally come to the conclusion that using a single image is a sensible bet. Nothing fancy, just a […]",
      "date": 1370274214000
    },
    {
      "id": "stifling-web-design",
      "title": "Stifling Web Design",
      "href": "/2013/05/15/stifling-web-design/",
      "body": "The only way to truly experience and evaluate a website design is in a web browser. That sounds obvious but it bears repeating. While this fact can’t be denied it is often conceptual design mock-ups that take responsibility for critique and direction. The assumption being that as a more efficient intermediate they’re good enough.\nHigh-fidelity design […]",
      "date": 1368628092000
    },
    {
      "id": "freelance-life",
      "title": "Freelance Life",
      "href": "/2013/05/09/freelance-life/",
      "body": "May is my 4th month working self-employed. When I set out in February I didn’t have many goals other than to escape London and enjoy things a lot more.\nHalf Marathon\nAt the end of May I’m attempting the Edinburgh half marathon — 21 kilometres of pain! For whatever reason I was fed up last August and figured […]",
      "date": 1368098492000
    },
    {
      "id": "origin",
      "title": "Origin",
      "href": "/2013/04/30/origin/",
      "body": "I’ve written loads about my flat build process, automation, browser support — in fact, if you follow me on Twitter you’ll know I can’t shut up about the Web. What I’ve been lacking is a canonical resource for my work beyond theoretical writing and live production examples. Despite web standards being open they aren’t always easy to reverse engineer.\nWhat […]",
      "date": 1367334428000
    },
    {
      "id": "on-browser-support",
      "title": "On Browser Support",
      "href": "/2013/04/26/on-browser-support/",
      "body": "The recently launched jQuery 2.0 leaves behind support for IE6–8. This has lead to some interesting opinions on what browsers we should be supporting. Here’s my take:\nDefining support\nSupporting a browser to me does not mean that a website will be identical in form and function. That is a fool’s errand leading to an unmanageable mess of polyfills […]",
      "date": 1366979829000
    },
    {
      "id": "ember-data-and-mongodb",
      "title": "Ember Data and MongoDB",
      "href": "/2013/04/25/ember-data-and-mongodb/",
      "body": "Macaque lives! If you’ve been following my recent blog posts —\n\nPart 1: Macaque: A New Project\nPart 2: Test Driven Development\nPart 3: Prototyping\n\n— you’ll know I’m building a to-do app with Node and Ember. Macaque’s development has reached the point where I can use the app itself for issue and feature tracking. If you want to see my plans […]",
      "date": 1366912828000
    },
    {
      "id": "prototyping",
      "title": "Prototyping",
      "href": "/2013/04/18/prototyping/",
      "body": "A couple of weeks ago I embarked upon a new side quest: make a list app and use as much JavaScript in the stack as possible. Fighting adversity, I’ve made progress:\n\nTwitter Bootstrap is a great UI toolkit for prototypes. Don’t let it seduce you, my underlying code ain’t pretty!\nLearning Curve\nAfter the excitement of last weekend’s test driven […]",
      "date": 1366314337000
    }
  ],
  "nextPage": "/blog/page/12/",
  "prevPage": "/blog/page/10/",
  "pageTitle": "Blog (page 11) – David Bushell – Web Design (UK)"
}