{
  "dateUnix": 1281647277000,
  "dateFormatted": "Thursday 12 Aug 2010",
  "pageHeading": "Summer of Design Heroes",
  "pagePath": "/2010/08/12/summer-of-design-heroes/",
  "innerHTML": "<p>The trouble with writing for two design blogs is that all the positive stuff tends to drift towards one of them (especially when it’s called <a href=\"http://designheroes.co.uk/\">Design Heroes</a>).</p>\n<p>So in an effort to balance the love I present a run down of all the brilliant creativity I’ve been blogging about over the last few months.</p>\n<h3 id=\"favourites-of-june\">Favourites of June</h3>\n<p><a href=\"http://vimeo.com/12112529\">Hayaku: A Time Lapse Journey Through Japan</a> - In the summer of 2009 Brad Kremer shot a series of time lapse videos around Japan’s urban and rural areas. The result is this stunning, beautiful and tranquil video.</p>\n<p><a href=\"http://www.mcsweeneys.net/links/monologues/15comicsans.html\">I’M COMIC SANS, ASSHOLE</a> - Mike Lacher delivers an hilarious monologue embodying everyone’s favourite typeface, Comic Sans.</p>\n<p><a href=\"http://www.retinart.net\">Retinart</a> - The blog of Alex Charchar, an Australian graphic designer with a passion for exploring and reflecting upon creativity.</p>\n<h3 id=\"favourites-of-july\">Favourites of July</h3>\n<p><a href=\"http://midcenturymodernist.com\">The Mid-Century Modernist</a> - a website dedicated to the inspiration of the modernist art movement between 1945 and 1970. The latest update is a great feature on the TV show Mad Men.</p>\n<p><a href=\"http://designfabulous.blogspot.com\">Andrew Kim</a> - An incredibly talented young product design student. I predict a very bright future for this kid! The next Jony Ive?</p>\n<p><a href=\"http://www.yiyinglu.com/\">Yiying Lu</a> - graphic designer and illustrator, famous for creating the twitter “fail whale”. Her work maintains a level of sophistication while remaining colour and full of life.</p>\n<h3 id=\"favourites-of-august-so-far-\">Favourites of August (so far)</h3>\n<p><a href=\"http://twentyfivethree.com/\">Bradley Castaneda</a> - a US designer and photographer from the greater Seattle area demonstrating professional talent in both photography and graphic design - one of the exceptional few!</p>\n<p><a href=\"http://www.christianknopf.de\">Christian Knopf</a> - the fantastic multi-discipline portfolio of a German based art director and designer. His website is a perfect example of combining Flash and web standards to create a visual and accessible portfolio.</p>\n<h3 id=\"and-a-shout-out-to-\">And a shout out to…</h3>\n<p>This summer has also been a wonderful few months for my personal website (dbushell.com). I’ve been featured on many websites including <a href=\"http://thecssawards.com/\">The CSS Awards</a>, <a href=\"http://webcreme.com/\">Web Creme</a>, <a href=\"http://thedesigninspiration.com/\">The Design Inspiration</a> and <a href=\"http://www.designshack.co.uk\">Design Shack</a> to name drop a few!</p>\n<p>You can follow my daily design blogging at <a href=\"http://designheroes.co.uk\">DesignHeroes.co.uk</a> (and <a href=\"http://twitter.com/dbushell\">@dbushell</a>).</p>\n",
  "pageExcerpt": "The trouble with writing for two design blogs is that all the positive stuff tends to drift towards one of them (especially when it’s called Design Heroes).\nSo in an effort to balance the love I present a run down of all the brilliant creativity I’ve been blogging about over the last few months.\nFavourites of June\nHayaku: […]",
  "pageTitle": "Summer of Design Heroes – David Bushell – Web Design (UK)"
}