{
  "pagePath": "/blog/page/35/",
  "pageHeading": "Blog (page 35)",
  "excerpts": [
    {
      "id": "minimalist-html",
      "title": "Minimalist HTML?",
      "href": "/2010/05/22/minimalist-html/",
      "body": "As part of the ongoing Design Heroes project we’ve started to include longer reviews with juicier content! The latest feature is on web designer and strategist Giuseppe Scappaticcio and his glorious website (and it’s source!). Read the review on Design Heroes, see a snippet below:\n\n“Really conserve your HTML as if it’s a non-renewable source. Give […]",
      "date": 1274522211000
    },
    {
      "id": "7-things-i-hate-about-website-design",
      "title": "7 things I hate about…",
      "href": "/2010/05/09/7-things-i-hate-about-website-design/",
      "body": "Website Design and Development!\nI started writing a blog about all the cool things being a web designer has to offer, i.e. ever changing technologies (slicker browsers, screens with pixels pushed closer together, HTML5, CSS3 with shadows and rounded corners everywhere etc). But then I figured people have already done a better job than I could […]",
      "date": 1273422270000
    },
    {
      "id": "design-heroes-2",
      "title": "Design Heroes 2",
      "href": "/2010/04/29/design-heroes-2/",
      "body": "Last year I started the bookmarking website Design Heroes to share and remember design related links, a kind of “inspiration blog”. It has served me very well in those occasions where I can remember a resource or piece of design I want to reference but have no idea where it is. The old design worked […]",
      "date": 1272535713000
    },
    {
      "id": "photos-from-back-home",
      "title": "Photos from back home",
      "href": "/2010/04/27/photos-from-back-home/",
      "body": "Living in London has its advantages, but the environment and fresh air aren’t on that list.\nI was beginning to forget what the colour green looked like! That’s why it’s nice to return home from time to time. This time I returned home with my new camera which has sadly been in storage more often than […]",
      "date": 1272377039000
    },
    {
      "id": "reading-month",
      "title": "Reading Month",
      "href": "/2010/04/12/reading-month/",
      "body": "It’s been over a month since my last blog post. What’s going on?\nA combination of very busy work and moving flat has meant my iMac and camera have both been boxed up. They now take centre stage on my new desk and it’s about time to rev up the personal project machine once again. But […]",
      "date": 1271106209000
    },
    {
      "id": "its-all-over",
      "title": "It’s all over!",
      "href": "/2010/03/07/its-all-over/",
      "body": "I started the daily photo project back on the 1st January (obviously) with plans to take a photo every day until 2011. Things were going well, that is until day 61. About 12 minutes after midnight I realised in a state of panic/relief that Day 60 did not have a photo.\nIt’s surprising just how disappointing […]",
      "date": 1267961340000
    },
    {
      "id": "1000-cranes",
      "title": "1000 Cranes",
      "href": "/2010/02/18/1000-cranes/",
      "body": "A new project!\nThe other week I was indirectly reminded (via twitter, obviously) about a previous obsession with Origami. To satisfy a sudden resurging demand to fold everything in half I picked up a few sheets of origami paper - and that was that.\nWell today a package arrived from Hong Kong along with a horrifying flash-back […]",
      "date": 1266521182000
    }
  ],
  "nextPage": "/blog/page/36/",
  "prevPage": "/blog/page/34/",
  "pageTitle": "Blog (page 35) – David Bushell – Web Design (UK)"
}