{
  "pagePath": "/blog/page/35/",
  "pageHeading": "Blog (page 35)",
  "excerpts": [
    {
      "id": "happy-new-year",
      "title": "Happy New Year!",
      "href": "/2009/12/20/happy-new-year/",
      "body": "I know, I’m a few weeks early with the cheer (but this blog will have more legs).\nI’ve spent the weekend wrapping Xmas gifts for the family. As a “creative” person I’ve always felt slightly guilty about my poor wrapping skills. Last year I stepped it up a notch and use a large black marker to […]",
      "date": 1261335516000
    },
    {
      "id": "dieter-rams-design",
      "title": "Dieter Rams Design (and Apple)",
      "href": "/2009/12/05/dieter-rams-design/",
      "body": "Friday night and I’m temporarily postponing my usual drinking routine to visit an art/design exhibition at London’s Design Museum.\nAt least I thought so (they had beer there too). The main attraction was everyones favourite German industrial designer of the decade - Dieter Rams. He was the head designer at Braun between the 60s right up […]",
      "date": 1260022649000
    },
    {
      "id": "bring-on-2010",
      "title": "Bring on 2010!",
      "href": "/2009/11/23/bring-on-2010/",
      "body": "How can November be nearly over already?\nOne minute I’m writing a review on Dropbox and then the next minute (figuratively speaking) it’s almost 3 weeks later! Time flies when you’re absolutely rammed at work. That’s a good thing because Base Creative has some great design and development to showcase in the New Year. The bad […]",
      "date": 1258983470000
    },
    {
      "id": "dropbox",
      "title": "Dropbox",
      "href": "/2009/11/05/dropbox/",
      "body": "Dropbox is the hottest Internet service available to date (according to my very reliable and much trusted twitter feed).\nI’m generally very sceptical about anything modern that changes my routine so it’s taken me a while to give this one a go. Simply, Dropbox is:\n“software that syncs your files online and across your computers”\n\n\nI’m sure it’s […]",
      "date": 1257426742000
    },
    {
      "id": "barcamp-london-in-review",
      "title": "Barcamp London in Review",
      "href": "/2009/10/26/barcamp-london-in-review/",
      "body": "BarCamp London 7 is a free-to-attend weekend unconference for designers, developers and geeks of all types.\nSounds like a fun weekend eh?\nI didn’t know anything about BarCamp until a week or so before but it sounded very interesting so I thought why not? My boss (Iain Scott) was also lucky enough to grab a ticket in […]",
      "date": 1256589264000
    },
    {
      "id": "typotheque-offer-web-licenses",
      "title": "Typotheque offer web licenses",
      "href": "/2009/10/20/typotheque-offer-web-licenses/",
      "body": "Good news everybody!\nThe Typotheque font foundry are now offering web licenses with a hosted service similar to Typekit (read my review on Typekit.)\n“The Typotheque Web Font Service enables you to use custom fonts in your website using the @font-face rule in CSS. Just add a line of code to your page and get it working […]",
      "date": 1256068254000
    },
    {
      "id": "search-design-heroes",
      "title": "Search Design Heroes",
      "href": "/2009/10/18/search-design-heroes/",
      "body": "If you visit Design Heroes you’ll notice an extra tab in the top menu called “Extras”. This page will include new and experimental features that are added as the site grows.\nThe latest feature is a keyword search. Design Heroes is normally browsed by selecting the tags (listed on the left-hand side) but I think a […]",
      "date": 1255881037000
    }
  ],
  "nextPage": "/blog/page/36/",
  "prevPage": "/blog/page/34/",
  "pageTitle": "Blog (page 35) – David Bushell – Web Design (UK)"
}