{
  "pagePath": "/blog/page/35/",
  "pageHeading": "Blog (page 35)",
  "excerpts": [
    {
      "id": "olympus-e-p1",
      "title": "Olympus E-P1",
      "href": "/2010/02/14/olympus-e-p1/",
      "body": "Ever since I started the daily photo project I’ve been looking to buy a digital camera. The iPhone’s camera has been surprisingly good but it doesn’t hold up to serious goat photography (scroll down).\n[photo was lost to time…]\nMy choice came down to a toss up between the Olympus E-P1 (above) and the Panasonic Lumix GF1. […]",
      "date": 1266164566000
    },
    {
      "id": "in-search-of-atlantis",
      "title": "In search of Atlantis",
      "href": "/2010/02/07/in-search-of-atlantis/",
      "body": "Every get that feeling you’re out of the loop? People know something you don’t?\nI’ve been in London for closer to 2 years now, so it was starting to get slightly embarrassing that the nearest arts superstore I could recommend was over 200 miles away. Thankfully I’d heard rumours that the east-end housed my answer (evidence […]",
      "date": 1265558354000
    },
    {
      "id": "first-thursday",
      "title": "First Thursday",
      "href": "/2010/02/04/first-thursday/",
      "body": "Man, this month has been hectic!\n[photo was lost to time…]\nWhen I’m not at work I’m busy trying to finish an in-depth article on the future of interactive design (featuring the iPad :-). The delay might be a good thing because there has been a some excellent articles on the subject in the past couple days […]",
      "date": 1265323486000
    },
    {
      "id": "week-in-film",
      "title": "Week in Film",
      "href": "/2010/01/26/week-in-film/",
      "body": "So this arrived from the States today:\n[photo was lost to time…]\nLemonade Movie (more info here).\nIt’s the feel-good movie of the recession, following 16 creative-types who were laid off and decided to embrace a life they were missing. Odd coincidence that the UK recession died today. The press will have to find another source of fear […]",
      "date": 1264509543000
    },
    {
      "id": "conundrums-by-harry-pearce",
      "title": "Conundrums",
      "href": "/2010/01/19/conundrums-by-harry-pearce/",
      "body": "Look what arrived today!\nTypographic Conundrums by Harry Pearce.\n[photo was lost to time…]\nThis awesome little book is full of typographic conundrums that need to be visually decoded into revealing a common saying or phrase. Very clever in their wit and simplicity.\nI was lucky enough to attend Cumbria University where Harry Pearce was asked to give a […]",
      "date": 1263908368000
    },
    {
      "id": "decode",
      "title": "V&A Decode",
      "href": "/2010/01/17/decode/",
      "body": "Yesterday I visited the V&amp;A Decode exhibition.\nThe exhibition describes itself as “bringing clarity to digital information in a visual way”. The brochure explains the three areas that are explored: “Code”, “Interactivity”, and “Network”.\n[photo was lost to time…]\nYawn. Decode was so lame I can’t even be bothered to write this blog. To say I spent 40 […]",
      "date": 1263727141000
    },
    {
      "id": "london-art-fair-2010",
      "title": "London Art Fair 2010",
      "href": "/2010/01/16/london-art-fair-2010/",
      "body": "Quick blog before I attempt to visit the V&amp;A Museum for the Decode exhibition. Last night I had a brief moment to sneak round the London Art Fair at the Business Design Centre. I work inside the BDC so there wasn’t much of an excuse for missing it, although I did my best with the […]",
      "date": 1263643473000
    }
  ],
  "nextPage": "/blog/page/36/",
  "prevPage": "/blog/page/34/",
  "pageTitle": "Blog (page 35) – David Bushell – Web Design (UK)"
}