{
  "pagePath": "/blog/page/32/",
  "pageHeading": "Blog (page 32)",
  "excerpts": [
    {
      "id": "the-typographic-gauntlet",
      "title": "The Typographic Gauntlet",
      "href": "/2010/11/07/the-typographic-gauntlet/",
      "body": "I love typography!\nTo celebrate my love I have set myself a new challenge: design 6 fonts in 12 months.\nMy last “creative challenge” was to fold 1000 origami cranes before the end of 2010. I think I’ve done about 100 so far (having folded nothing since March). Some may say I set the bar too high on that […]",
      "date": 1289173153000
    },
    {
      "id": "book-review-just-my-type",
      "title": "Book Review: Just My Type",
      "href": "/2010/10/25/book-review-just-my-type/",
      "body": "If you’ve been following my Design Heroes blog you’ll know I’ve recently been impressed with two (1, 2) different excerpts from Simon Garfield’s new book Just My Type.\nSo much so that I purchased and read it as fast as humanly possible.\nThe book starts with a chapter on Comic Sans, illustrating the significant impact a font can have. It […]",
      "date": 1288039937000
    },
    {
      "id": "design-is-not-doomed",
      "title": "Design is not doomed",
      "href": "/2010/10/14/design-is-not-doomed/",
      "body": "I’ve been suspiciously silent on this blog lately.\nNot sure what’s wrong with me! I’m still blogging daily at designheroes.co.uk. That’s where I post all my inspiration, interests and opinions on the latest design news &amp; events. I’ve also been rapidly developing LoveDsgn which has gone from a small to monumentally massive project in the space of […]",
      "date": 1287079537000
    },
    {
      "id": "a-future-of-engineered-design",
      "title": "A Future of Engineered Design?",
      "href": "/2010/09/21/a-future-of-engineered-design/",
      "body": "Did you hear? Print is dead!\nThat’s what they’ve been saying for years, decades even. The decline in newspaper sales is often the evidence for such a statement, citing that ‘digital/social/new media’ is what the kids are craving. I’ve always felt that the bullshit and lies printed on the front page (and every page thereafter) is […]",
      "date": 1285108285000
    },
    {
      "id": "think-different",
      "title": "Think Different",
      "href": "/2010/09/06/think-different/",
      "body": "I stumbled across one of Apple’s classic ad campaigns. Watch Jobs pitch it below:\nFound this via Young Guns vs. Old Ones.\nInspiring, and a masterpiece of advertisement.\nMakes me wonder how differently Apple were thinking when they announced Ping their new social network for music.\nDespite championing HTML5 it would seem Apple have now decided a web browser […]",
      "date": 1283784836000
    },
    {
      "id": "do-you-love-design",
      "title": "Do you Love Design?",
      "href": "/2010/09/02/do-you-love-design/",
      "body": "Before I get into the meaty part of this post I’d like to share this by Kyle Steed:\n\nHomer’s “Iliad” and “Odyssey” are epic. Beowulf is epic. The design you saw last night on Dribbble is not epic.\n\nFunny and true. I’m guilty of this myself, despite vowing a very long time ago never to write a blog titled […]",
      "date": 1283417680000
    },
    {
      "id": "web-fonts-just-got-interesting",
      "title": "Web Fonts just got interesting",
      "href": "/2010/08/19/web-fonts-just-got-interesting/",
      "body": "Around this time last year I was blogging about the then-new Typekit service and the news of Typotheque offering web licenses. I enquired as to when (or whether) the big font foundries would embrace the new world of web fonts. Or if they would sit back and watch the licensing nightmare unfold.\nWell, this month has answered a few of […]",
      "date": 1282221600000
    }
  ],
  "nextPage": "/blog/page/33/",
  "prevPage": "/blog/page/31/",
  "pageTitle": "Blog (page 32) – David Bushell – Web Design (UK)"
}