{
  "pagePath": "/blog/page/32/",
  "pageHeading": "Blog (page 32)",
  "excerpts": [
    {
      "id": "designing-obama",
      "title": "Designing Obama",
      "href": "/2010/06/16/designing-obama/",
      "body": "Look what arrived today:\n\nClick here to see and read more!\n",
      "date": 1276714592000
    },
    {
      "id": "from-mays-edition",
      "title": "From May’s Edition",
      "href": "/2010/06/13/from-mays-edition/",
      "body": "If you aren’t following my other blog (Design Heroes) you missed out on all these awesome links:\nUsable Efficiency\n\nUsable Efficiency is a new video blog with the aim of helping you improve websites with very practical and knowledgeable tips. Definitely one for the RSS reader.\nPEN Giant\n\nOne of the more superficial reasons I bought my Olympus PEN […]",
      "date": 1276427926000
    },
    {
      "id": "pentagram-marks",
      "title": "Pentagram Marks",
      "href": "/2010/05/30/pentagram-marks/",
      "body": "I just so happened to feature the book Pentagram Marks on Design Heroes a few weeks ago. Now that I’ve recieved a copy (birthday present) I though it deserved a full review! Click above, or read below:\nMy review of Pentagram Marks *\n\nPentagram Marks arrived in the post this week!\nThe book is delightfully smallish in stature […]",
      "date": 1275216537000
    },
    {
      "id": "minimalist-html",
      "title": "Minimalist HTML?",
      "href": "/2010/05/22/minimalist-html/",
      "body": "As part of the ongoing Design Heroes project we’ve started to include longer reviews with juicier content! The latest feature is on web designer and strategist Giuseppe Scappaticcio and his glorious website (and it’s source!). Read the review on Design Heroes, see a snippet below:\n“Really conserve your HTML as if it’s a non-renewable source. Give […]",
      "date": 1274522211000
    },
    {
      "id": "7-things-i-hate-about-website-design",
      "title": "7 things I hate about…",
      "href": "/2010/05/09/7-things-i-hate-about-website-design/",
      "body": "Website Design and Development!\nI started writing a blog about all the cool things being a web designer has to offer, i.e. ever changing technologies (slicker browsers, screens with pixels pushed closer together, HTML5, CSS3 with shadows and rounded corners everywhere etc). But then I figured people have already done a better job than I could […]",
      "date": 1273422270000
    },
    {
      "id": "design-heroes-2",
      "title": "Design Heroes 2",
      "href": "/2010/04/29/design-heroes-2/",
      "body": "Last year I started the bookmarking website Design Heroes to share and remember design related links, a kind of “inspiration blog”. It has served me very well in those occasions where I can remember a resource or piece of design I want to reference but have no idea where it is. The old design worked […]",
      "date": 1272535713000
    },
    {
      "id": "photos-from-back-home",
      "title": "Photos from back home",
      "href": "/2010/04/27/photos-from-back-home/",
      "body": "Living in London has its advantages, but the environment and fresh air aren’t on that list.\nI was beginning to forget what the colour green looked like! That’s why it’s nice to return home from time to time. This time I returned home with my new camera which has sadly been in storage more often than […]",
      "date": 1272377039000
    }
  ],
  "nextPage": "/blog/page/33/",
  "prevPage": "/blog/page/31/",
  "pageTitle": "Blog (page 32) – David Bushell – Web Design (UK)"
}