{
  "pagePath": "/blog/page/32/",
  "pageHeading": "Blog (page 32)",
  "excerpts": [
    {
      "id": "a-future-of-engineered-design",
      "title": "A Future of Engineered Design?",
      "href": "/2010/09/21/a-future-of-engineered-design/",
      "body": "Did you hear? Print is dead!\nThat’s what they’ve been saying for years, decades even. The decline in newspaper sales is often the evidence for such a statement, citing that ‘digital/social/new media’ is what the kids are craving. I’ve always felt that the bullshit and lies printed on the front page (and every page thereafter) is […]",
      "date": 1285108285000
    },
    {
      "id": "think-different",
      "title": "Think Different",
      "href": "/2010/09/06/think-different/",
      "body": "I stumbled across one of Apple’s classic ad campaigns. Watch Jobs pitch it below:\nFound this via Young Guns vs. Old Ones.\nInspiring, and a masterpiece of advertisement.\nMakes me wonder how differently Apple were thinking when they announced Ping their new social network for music.\nDespite championing HTML5 it would seem Apple have now decided a web browser […]",
      "date": 1283784836000
    },
    {
      "id": "do-you-love-design",
      "title": "Do you Love Design?",
      "href": "/2010/09/02/do-you-love-design/",
      "body": "Before I get into the meaty part of this post I’d like to share this by Kyle Steed:\n\nHomer’s “Iliad” and “Odyssey” are epic. Beowulf is epic. The design you saw last night on Dribbble is not epic.\n\nFunny and true. I’m guilty of this myself, despite vowing a very long time ago never to write a blog titled […]",
      "date": 1283417680000
    },
    {
      "id": "web-fonts-just-got-interesting",
      "title": "Web Fonts just got interesting",
      "href": "/2010/08/19/web-fonts-just-got-interesting/",
      "body": "Around this time last year I was blogging about the then-new Typekit service and the news of Typotheque offering web licenses. I enquired as to when (or whether) the big font foundries would embrace the new world of web fonts. Or if they would sit back and watch the licensing nightmare unfold.\nWell, this month has answered a few of […]",
      "date": 1282221600000
    },
    {
      "id": "summer-of-design-heroes",
      "title": "Summer of Design Heroes",
      "href": "/2010/08/12/summer-of-design-heroes/",
      "body": "The trouble with writing for two design blogs is that all the positive stuff tends to drift towards one of them (especially when it’s called Design Heroes).\nSo in an effort to balance the love I present a run down of all the brilliant creativity I’ve been blogging about over the last few months.\nFavourites of June\nHayaku: A Time Lapse […]",
      "date": 1281647277000
    },
    {
      "id": "using-photoshop-like-a-real-web-design",
      "title": "Photoshop like a Real Designer",
      "href": "/2010/07/29/using-photoshop-like-a-real-web-design/",
      "body": "There has been a lot of debate recently in the web design social networks about whether a web designer should be able to code. I didn’t contribute much to the question because the answer is obviously yes, but I did think long and hard about my own practices.\nToday Smashing Magazine published a great article by […]",
      "date": 1280403884000
    },
    {
      "id": "stop-being-a-designer-from-hell",
      "title": "Stop being a Designer from Hell",
      "href": "/2010/07/17/stop-being-a-designer-from-hell/",
      "body": "There’s more to being a professional designer than pushing around pixels. I realise the truth behind this more and more every day. I’d estimate I spend somewhere between 10–25% of my week interacting with clients. This relationship dictates everything I do in my job. If I want to enjoy it and produce design to be […]",
      "date": 1279368508000
    }
  ],
  "nextPage": "/blog/page/33/",
  "prevPage": "/blog/page/31/",
  "pageTitle": "Blog (page 32) – David Bushell – Web Design (UK)"
}