{
  "dateUnix": 1431338400000,
  "dateFormatted": "Monday 11 May 2015",
  "pageHeading": "WordPress to Metalsmith",
  "pagePath": "/2015/05/11/wordpress-to-metalsmith/",
  "innerHTML": "<p>It’s a busy work schedule that is usually to blame for my lack of written output on this blog. That was not the case last month!</p>\n<h2 id=\"downtime\">Downtime</h2>\n<p>As you may have noticed, my website has been going offline frequently. Not good. After several failed attempts to fix the — admittedly self-inflicted — issue I decided a full nuking of my VPS was the only solution.</p>\n<p>I use <a href=\"http://MAMP.info\">MAMP</a> for local WordPress / PHP development. That is where I “backed up” my WordPress install. Before hitting the button of no return I had the foresight to create a static copy of my website using Wget, a technique I’ve used before to <a href=\"/2012/03/20/preserving-the-web/\">preserve old websites</a>. The day was getting late by the time the new server was configured. I uploaded the static copy and made a task to re-install WordPress later that week.</p>\n<p>That was the plan until I saw the state of the database. At almost seven years old, and seeing as many redesigns in that time, it had grown into a 60MB behemoth.</p>\n<p>A good opportunity to try something new, don’t you think?</p>\n<h2 id=\"metalsmith\">Metalsmith</h2>\n<p>Last summer I wrote my own Node script for a basic <a href=\"http://mustache.github.io/\">Mustache</a> templating engine (see: <a href=\"/2014/07/09/how-i-built-a-static-site-generator/\">How I built a Static Site Generator</a>). This was a fun project and has proven useful in many of my front-end dev jobs. It’s not really a static site generator though. Suitable only for a handful of templates and placeholder content.</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/metalsmith.png\" alt=\"Metalsmith\"></p>\n\n<p>I considered using <a href=\"http://jekyllrb.com\">Jekyll</a> to rebuild my site but I was keen to keep my <a href=\"https://github.com/dbushell/dbushell-Origin\">Grunt workflow</a> for assets. That’s when I remembered <a href=\"http://www.metalsmith.io/\">Metalsmith</a>:</p>\n<blockquote>\n<p>An extremely simple, pluggable static site generator.</p>\n</blockquote>\n<p>Metalsmith reads files from a directory, passes them through a chain of plugins, and outputs a build. Best of all, it’s all JavaScript / Node.</p>\n<p>The first step was to prepare my content.</p>\n<h2 id=\"markdown\">Markdown</h2>\n<p>WordPress can export content as XML. Which is nice but XML hasn’t been “cool” for a long time. After some trial and error I found <a href=\"https://github.com/thomasf/exitwp\">Exitwp</a> by Thomas Frössman. Exitwp is a Python script that converts WordPress XML to <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> files with a YAML header.  The format of choice for static site generators.</p>\n<p>I had to modify the script several times to get the output I wanted. A tedious task for one not fond of, or indeed familiar with, Python. Following a final hour of manual editing, I had a directory of <strong>254 articles</strong> in Markdown format.</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/metalsmith-markdown.png\" alt=\"dbushel.com articles in markdown files\"></p>\n\n<h2 id=\"handlebars-templates\">Handlebars Templates</h2>\n<p>With content ready, step two was to convert my WordPress theme to <a href=\"http://handlebarsjs.com/\">Handlebars</a>. I’d already written a basic Mustache version of my templates so this didn’t take long. I did need to write several helper functions to replicate WordPress functionality.</p>\n<p>A basic example uses <a href=\"http://momentjs.com/\">Moment.js</a> to format dates:</p>\n<pre><code class=\"language-javascript\">Handlebars.registerHelper(&#39;moment&#39;, function(date, format) {\n    return Moment(date).format(format);\n});\n</code></pre>\n<p>Using this in templates I can write:</p>\n<pre><code class=\"language-javascript\">{{ moment date &#39;dddd DD MM YYYY&#39; }}\n</code></pre>\n<p>— <code>date</code> references the YAML metadata heading the relevant Markdown file. Which itself remains in ISO date format (e.g. <code>2015-03-18 10:50:59+00:00</code>).</p>\n<h3 id=\"excerpts\">Excerpts</h3>\n<p>I wrote an excerpt helper for my <a href=\"/blog/\">blog index</a> similar to the WordPress function. This outputs up to 55 words of content without formatting.</p>\n<pre><code class=\"language-javascript\">Handlebars.registerHelper(&#39;excerpt&#39;, function(contents) {\n    if (typeof contents !== &#39;string&#39;) return &#39;&#39;;\n    var text = striptags(contents),\n        words = text.split(&#39; &#39;);\n    if (words.length &gt;= 55) {\n        text = words.slice(0, 55).join(&#39; &#39;) + &#39; [&amp;hellip;]&#39;;\n    }\n    return new Handlebars.SafeString(&#39;&lt;p&gt;&#39; + text + &#39;&lt;/p&gt;&#39;);\n});\n</code></pre>\n<p>I prefer to configure Handlebars myself but an alternate approach would be to use the <a href=\"https://github.com/segmentio/metalsmith-excerpts\">Metalsmith excerpts plugin</a>. This dynamically adds excerpt metadata prior to templating so <code>{{ this.excerpt }}</code> is available — whereas my approach requires <code>{{ excerpt this.contents }}</code></p>\n<p>I could also manually write excerpts in my Markdown content if I really cared, but who reads excerpts? I’d wager most of my blog readers hit the article page directly via social media or search. An auto-generated excerpt works just fine for me.</p>\n<h2 id=\"sitemap\">Sitemap</h2>\n<p>With content and templates in place my website could be built once again. I checked a couple of file diffs with my local WordPress install to ensure both were generating effectively the same HTML.</p>\n<p>Now all that was missing was an XML sitemap. To generate this I wrote a Metalsmith plugin inspired by ExtraHop’s <a href=\"https://github.com/ExtraHop/metalsmith-sitemap\">metalsmith-sitemap</a>. A simple solution that uses Handlebars to populate XML templates:</p>\n<pre><code class=\"language-markup\">&lt;url&gt;\n    &lt;loc&gt;{{loc}}&lt;/loc&gt;{{#if lastmod}}\n    &lt;lastmod&gt;{{lastmod}}&lt;/lastmod&gt;{{/if}}{{#if changefreq}}\n    &lt;changefreq&gt;{{changefreq}}&lt;/changefreq&gt;{{/if}}{{#if priority}}\n    &lt;priority&gt;{{priority}}&lt;/priority&gt;{{/if}}\n&lt;/url&gt;\n</code></pre>\n<p>The entries are compiled into a single <code>sitemap.xml</code> file which is added to the Metalsmith files list. This in theory would then flow through the other Metalsmith plugins, if the sitemap plugin wasn’t the last one.</p>\n<h2 id=\"the-final-build\">The Final Build</h2>\n<p>My final Metalsmith plugin order runs as following:</p>\n<ul>\n<li><a href=\"https://github.com/segmentio/metalsmith-drafts\">metalsmith-<strong>drafts</strong></a>\n<br><span class=\"p--small p--light\">remove markdown files marked as draft</span></li>\n<li><em>dbushell-metalsmith-<strong>markup</strong></em>\n<br><span class=\"p--small p--light\">clean up intermediate code due to imperfect WordPress conversion</span></li>\n<li><a href=\"https://github.com/segmentio/metalsmith-markdown\">metalsmith-<strong>markdown</strong></a>\n<br><span class=\"p--small p--light\">convert Markdown content to HTML</span></li>\n<li><a href=\"https://github.com/segmentio/metalsmith-collections\">metalsmith-<strong>collections</strong></a>\n<br><span class=\"p--small p--light\">create two group for all blog posts and “From the Blog…” list</span></li>\n<li><a href=\"https://github.com/blakeembrey/metalsmith-pagination\">metalsmith-<strong>pagination</strong></a>\n<br><span class=\"p--small p--light\">generate pages for my <a href=\"/blog/\">blog index</a></span></li>\n<li><a href=\"https://github.com/segmentio/metalsmith-permalinks\">metalsmith-<strong>permalinks</strong></a>\n<br><span class=\"p--small p--light\">combined with <a href=\"https://github.com/ericgj/metalsmith-branch\">metalsmith-branch</a></span></li>\n<li><em>dbushell-metalsmith-<strong>sitemap</strong></em></li>\n</ul>\n<p>As you can see, I’m not using Metalsmith to process any assets. I have an existing <a href=\"https://github.com/dbushell/dbushell-Origin\">Grunt workflow</a> to handle them.  I’ve <a href=\"https://github.com/dbushell/dbushell-com\">uploaded my website source</a> to Github for anyone interested. Both Metalsmith and Grunt build tasks have been combined.</p>\n<p>There’s still a little work to do for deployment, but if you’re reading this article, I’ve got things running smoothly enough!</p>\n<p>There are plenty of Grunt plugins out there that could recreate what I’ve done with Metalsmith but I do like its focus as <q>an extremely simple, pluggable static site generator</q>. It does that very well.</p>\n<p>Now that I’m writing in Markdown format I get to use the lovely <a href=\"https://ia.net/writer/mac\">IA Writer Pro</a>.</p>\n",
  "pageExcerpt": "It’s a busy work schedule that is usually to blame for my lack of written output on this blog. That was not the case last month!\nDowntime\nAs you may have noticed, my website has been going offline frequently. Not good. After several failed attempts to fix the — admittedly self-inflicted — issue I decided a full […]",
  "pageTitle": "WordPress to Metalsmith – David Bushell – Web Design (UK)"
}