{
  "dateUnix": 1257426742000,
  "dateFormatted": "Thursday 5 Nov 2009",
  "pageHeading": "Dropbox",
  "pagePath": "/2009/11/05/dropbox/",
  "innerHTML": "<p>Dropbox is the hottest Internet service available to date (according to my very reliable and much trusted twitter feed).</p>\n<p>I’m generally very sceptical about anything modern that changes my routine so it’s taken me a while to give this one a go. Simply, <a href=\"https://www.getdropbox.com/referrals/NTI4MDcyMTc5\">Dropbox</a> is:</p>\n<p class=\"quote\">“software that syncs your files online and across your computers”</p>\n\n\n<p>I’m sure it’s not a revolutionary piece of kit but it’s packaged up in a sexy 2.0 website that’s far too cool to explain anything to you and just gives you the option to login, download or get lost. Not wanted to feel like a stiff, I downloaded.</p>\n<p>For the last 5 years I’ve been carrying around a 2GB USB stick formatted to the ancient language of FAT32 (because _”_I’m a PC” at work and a Mac at home). I’ve rarely needed to carry around or transfer more than 2GB of files at a time so I’ve never felt the need to upgrade the routine. Then I found out <em>“there’s an app for that”</em>. You see, Apple have hypnotised me into buying any and every thing they’re flogging. By proxy Dropbox is now a must have item.__</p>\n<p>The installation is painless (even on a PC) and is over in seconds. A folder called <em>My Dropbox</em> appears in the <em>My Documents</em> folder. On a Mac it appears in your <em>User</em> folder. (And of course on the iPhone it’s an app.) Now here’s the magic part. Anything I put in that folder using any device will appear on all other devices!</p>\n<p>I’ve thrown my USB stick under a bus.</p>\n<p>The folders and files in your Dropbox all have a little icon addition indicating their status. A ticked green circle means it’s synced. A blue arrow circle means it’s syncing. Syncing is handled automatically so there is no actions required from the user after saving a file. Dropbox also keeps multiple backups of each file that you can browse and revert to through the web interface. You can login and manage your Dropbox in a browser anywhere. That means accessing your files on devices you don’t want to sync too. You even get a public folder where anyone can access its files online.</p>\n<p>It’s all incredibly slick and requires no effort.</p>\n<p>The iPhone app is great because it means the end of transferring photos via Bluetooth, an email attachment, or thankfully, no more syncing with iTunes. I prefer manage my own photo folder with no frills or thrills. The app’s other killer feature is viewing documents. Supported file formats are .jpg, .tiff, .gif, .mp3, .aiff, .m4a, .wav, .mov, .mp4, .m4v, .doc, .docx, .ppt, .pptx, .xls, .xlsx, .pdf, .key, .pages, .numbers, .htm, .html, .txt, .rtf, and finally .vcf. That’s awesome. Excel doesn’t even work on my PC! Who would have thought viewing files would be exciting in 2009?</p>\n<p>The best thing of all - the 2GB account is <strong>free</strong>! 50GB is $9.99 a month and 100GB is $19.99 a month, but I’ll never need that kind of space.</p>\n<p><a href=\"https://www.getdropbox.com/referrals/NTI4MDcyMTc5\">Signup to Dropbox now!</a> - and I’ll a few more MB for referring :)</p>\n",
  "pageExcerpt": "Dropbox is the hottest Internet service available to date (according to my very reliable and much trusted twitter feed).\nI’m generally very sceptical about anything modern that changes my routine so it’s taken me a while to give this one a go. Simply, Dropbox is:\n“software that syncs your files online and across your computers”\n\n\nI’m sure it’s […]",
  "pageTitle": "Dropbox – David Bushell – Web Design (UK)"
}