{
  "dateUnix": 1335174328000,
  "dateFormatted": "Monday 23 Apr 2012",
  "pageHeading": "Modularity and Style Guides",
  "pagePath": "/2012/04/23/modularity-and-style-guides/",
  "innerHTML": "<p>Last week I wrote about <a href=\"/2012/04/18/scoping-typography-css/\">scoping typographic styles</a> to introduce the concept of <strong>modularity</strong> in CSS. In that example, I removed the common globally defined text styles — for paragraphs, headings and lists etc — and scoped them with a <code>.text</code> class to be applied to any block of text-based content. This technique gives us more control and less conflicts.</p>\n<p>It’s one of many techniques I use in front-end website development. Below I’ll introduce a few more and how I link them together for the ultimate <em>Power Up</em> ★</p>\n<p><em><strong>Disclaimer:</strong> there’s no holy grail to building a website!</em></p>\n<h2 id=\"modularity\">Modularity</h2>\n<p>If you’re familiar with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://smacss.com/\">SMACSS</a>, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/stubbornella/oocss/wiki\">OOCSS</a> or <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2012/04/16/a-new-front-end-methodology-bem/\">BEM</a> you’ll understand the concept of creating reusable “blocks” or “modules”. These are patterns, both visually and in code, that can be reused and expanded upon when building web pages. Done right, time and complexity are significantly reduced. If you tackle each page one at a time, element by element, you end up repeating the same code over and over again. Methodologies like modularity solve the repetition problem exponentially as a website grows.</p>\n<p>Before you get modular you need something to build.</p>\n<h2 id=\"style-guides\">Style Guides</h2>\n<p><strong><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://24ways.org/2011/front-end-style-guides\">Style guides</a></strong> (or pattern libraries) are the <em>perfect</em> place to start a website build and a modular base. They bridge the gap between design and development. They’re somewhat similar to a traditional brand guidelines but contain less fluff &amp; nonsense and 100% practical code examples.</p>\n<p>A good style guide starts with the basics like typography (see above) and moves onto more complex arrangements of content and UI elements, like navigation and form constructs.</p>\n<p><strong>The benefits of building a style guide first are enormous:</strong></p>\n<ul>\n<li>It shows the design elements you have at your disposal.</li>\n<li>Its shows the design elements you <em>lack</em>.</li>\n<li>It defines the modular HTML/CSS building blocks for the whole website.</li>\n<li>It provides an accessible baseline on which to build upon.</li>\n<li>It allows you to test code early in browsers and on devices.</li>\n<li>Oh, and it leaves a design &amp; build blueprint for future development.</li>\n</ul>\n<p>Building the guide highlights weaknesses in a design (before it’s too late) and sets  you on the path to build simplicity. Just throw all the elements onto one very long page; don’t waste too much time formatting it. The benefits are so incredible — I feel embarrassed for not utilising the style guide sooner! I use to consider them as <em>additional</em> work but actually it results in far less. Whether you choose to expose and bill the style guide to the client is a question for another day. If you’re a developer just do it anyway; it’ll make your life a whole lot easier.</p>\n<p>What’s next? Continue building the website, you’ve already started.</p>\n<p>At this point you’ll have written a whole lotta CSS and HTML. In fact, if your style guide is comprehensive enough you’ll have written the vast majority of it! Save that as your <code>base.css</code> or <code>global.css</code> and you could pretty much mark up the rest of the website with a vertical layout, i.e. the initial “mobile”/small-screen breakpoint, or <em>breakpoint zero</em> (since more capable small-screen devices may get advanced interactive layout beyond this).</p>\n<p><em><strong>Remember:</strong> the usability of a responsive design is directly proportional to the quality, planning, and arrangement of content. Don’t dismiss a technique that takes advantage of screen size for a problem it never claims to solve.</em></p>\n<p>The next step is to provide layout (at progressively wider sizes using media queries if you’re going responsive). I use a combination of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://adactio.com/journal/4494/\">global and layout css</a> (also seen in the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://goldilocksapproach.com/\">Goldilocks Approach</a>)  and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://nicolasgallagher.com/mobile-first-css-sass-and-ie/\">“Mobile First” CSS</a> with legacy IE support. The reason I go further with a separate IE stylesheet is so <code>layout.css</code> doesn’t need to be afraid of advanced styling. It also means I can throw in the occasional <code>max-width</code> media query without issues. Yes, they’re legal.</p>\n<p>And that’s it for now. I won’t go too far into how to actually structure your HTML &amp; CSS. There’s too many factors to set out a single system. If you want to dabble with CSS pre-processors that’s great; whatever suits you. I have my own theories I may share soon — I’m not one for conforming to the general consensus! — but that’s for another day :)</p>\n<p>On a similar topic, have a read of  Paul Robert Lloyd’s <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.netmagazine.com/tutorials/build-responsive-site-week-designing-responsively-part-1\">Build a responsive site in a week: designing responsively (part 1)</a> over at .net magazine. I’m liking the cut of his jib.</p>\n",
  "pageExcerpt": "Last week I wrote about scoping typographic styles to introduce the concept of modularity in CSS. In that example, I removed the common globally defined text styles — for paragraphs, headings and lists etc — and scoped them with a .text class to be applied to any block of text-based content. This technique gives us more control […]",
  "pageTitle": "Modularity and Style Guides – David Bushell – Web Design (UK)"
}