{
  "dateUnix": 1246564688000,
  "dateFormatted": "Thursday 2 Jul 2009",
  "pageHeading": "The Art of Nadeem Chughtai",
  "pagePath": "/2009/07/02/the-art-of-nadeem-chughtai/",
  "innerHTML": "<p><img src=\"/images/blog/nadeem-chughtai.jpg\" alt=\"Art of Nadeem Chughtai photographed at Absorb Studios, London\"></p>\n<p>Last Friday I visited the <a href=\"/2009/06/28/secret-blisters/\">Secret Blisters</a> screen print poster show and I also had the opportunity to pop into <a href=\"http://www.absorb-arts.co.uk/index.php\">Absorb Art Studios</a> who had a summer gallery showing next door. There were several artists that stood out, the first of which I’d like to share on this blog is Nadeem Chughtai.</p>\n<p class=\"quote\">“The character I use was created as my tool to express what I wanted to say. It can be any one of us, it just represents the human species”</p>\n\n<p>What I really like about his work in the use of bright, colourful light to cast these ominous human-like shapes into shadow. I see them and slow moving, pondering figures as if they’re in some kind off purgatory. The sense of emotion is very powerful, is it coincidence most of these figures are looking/walking towards the light? It’s as if time has stopped still and they are exploring the deepest of thoughts.</p>\n<p>The mix of cartoon styled beings and realistic light and shadow really do create something to marvel over. The lighting very much reflects Chughtai’s background in film sets. Don’t take my camera phone’s word, see more photos at <a href=\"http://www.nadeemchughtai.com\">Nadeem Chughtai’s official website</a>.</p>\n",
  "pageExcerpt": "\nLast Friday I visited the Secret Blisters screen print poster show and I also had the opportunity to pop into Absorb Art Studios who had a summer gallery showing next door. There were several artists that stood out, the first of which I’d like to share on this blog is Nadeem Chughtai.\n“The character I use […]",
  "pageTitle": "The Art of Nadeem Chughtai – David Bushell – Web Design (UK)"
}