{
  "dateUnix": 1326741891000,
  "dateFormatted": "Monday 16 Jan 2012",
  "pageHeading": "Resolution Independence!",
  "pagePath": "/2012/01/16/resolution-independence/",
  "innerHTML": "<p>One of my thoughts for <a href=\"/2011/12/15/web-design-2012-and-beyond/\">Web Design: 2012 and Beyond</a> concerned the issues of <strong>screen resolution</strong> and the necessity for <strong>scalable graphics</strong> on the web. As part of that thinking I’ve written a piece for Smashing Magazine entitled <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2012/01/16/resolution-independence-with-svg/\">Resolution Independence with SVG</a>:</p>\n<blockquote>\n<p>When we look at the breadth of Web-enabled devices, responsive design is sure to provide a better user experience. Scrolling horizontally, panning and zooming the viewport have their place in user interface design, but forcing the user to do these things just to navigate a website quickly becomes tedious. Fitting the website to the viewport is about more than just layout: it’s also about resolution. In this article, I’ll demonstrate why SVG is a perfect addition to future-friendly Web development.</p>\n</blockquote>\n<p>I go on to demonstrate how SVG can be used in place of normal image techniques. I first experimented with <a href=\"/2010/06/30/using-svg-logos/\">using SVG logos</a> in 2010 but browser support was very limiting back then. Towards the end of 2011 I had <a href=\"/2011/11/11/the-good-the-bad-and-the-logo/\">another look at SVG logos</a> and was surprised by the progress — that led to this article!</p>\n<p>Of course, I’m not the only one considering these challenges. It’s great to see other designers/developers like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://laurakalbag.com/\">Laura Kalbag</a> realising the same potential (check out her site for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://futureinsightslive.com/\">Future Insights</a> for SVG icons). I expect such practice will become common place soon. Other techniques also exist for scalable graphics, many using CSS alone (I’ve listed a few in <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://coding.smashingmagazine.com/2012/01/16/resolution-independence-with-svg/\">my article</a>). 300 pixel-per-inch tablets and laptops within a year or two? Make sure your websites are ready.</p>\n<p><em><strong>* Update 19th Jan:</strong> I’m honoured! My article was featured in Peter Cooper’s <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://html5weekly.com/archive/21.html\">HTML Weekly</a> and received a shout out from Paul Irish in the brilliant new <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://shoptalkshow.com/episodes/002-with-paul-irish/\">ShopTalk podcast</a>.</em></p>\n",
  "pageExcerpt": "One of my thoughts for Web Design: 2012 and Beyond concerned the issues of screen resolution and the necessity for scalable graphics on the web. As part of that thinking I’ve written a piece for Smashing Magazine entitled Resolution Independence with SVG:\n\nWhen we look at the breadth of Web-enabled devices, responsive design is sure to provide a better […]",
  "pageTitle": "Resolution Independence! – David Bushell – Web Design (UK)"
}