{
  "dateUnix": 1371715773000,
  "dateFormatted": "Thursday 20 Jun 2013",
  "pageHeading": "Update from June 3rd",
  "pagePath": "/2013/06/20/update-from-june-3rd/",
  "innerHTML": "<p>I received a shout-out in the “hot drama” section of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://shoptalkshow.com/episodes/073-with-val-head/\">Shop Talk Show (E073)</a> — bucket list <em>checked</em>, I love those guys — however my point was somewhat missed I feel.</p>\n<p>On June 3rd I wrote an article entitled <a href=\"/2013/06/03/the-raster-image-paradox/\">The Raster Image Paradox</a> which prompted a response from Tim Kadlec on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://timkadlec.com/2013/06/why-we-need-responsive-images/\">Why We Need Responsive Images</a> — which I agree with 100% — and also Shop Talk Show host Dave Rupert who wrote <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://daverupert.com/2013/06/ughck-images/\">“Ughck. Images.”</a></p>\n<p>Both of whom make perfectly valid points around two contradictory concerns. The concept of a responsive image implementation in the browser would allow two main abilities:</p>\n<ul>\n<li>To serve smaller images to smaller screens to save bytes downloaded</li>\n<li>To serve high definition images to high-PPI screens for better visual quality</li>\n</ul>\n<p>These ideas are often at odds. No technology can find the appropriate line between performance and quality. This is a human decision that we should already be making <em>today</em>.</p>\n<p>Let’s say a responsive image patch lands in the next set of browser updates — what’s changed? We’ll have more flexibility sure, but when we weigh up the pros and cons we’ll end right back in the middle. I guess it’s fair to say I’m “throwing in the towel” — but only on a silver bullet.</p>\n",
  "pageExcerpt": "I received a shout-out in the “hot drama” section of Shop Talk Show (E073) — bucket list checked, I love those guys — however my point was somewhat missed I feel.\nOn June 3rd I wrote an article entitled The Raster Image Paradox which prompted a response from Tim Kadlec on Why We Need Responsive Images […]",
  "pageTitle": "Update from June 3rd – David Bushell – Web Design (UK)"
}