{
  "dateUnix": 1445335200000,
  "dateFormatted": "Tuesday 20 Oct 2015",
  "pageHeading": "Accelerated Mobile Pages",
  "pagePath": "/2015/10/20/accelerated-mobile-pages/",
  "innerHTML": "<p>The <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.ampproject.org/\">AMP Project</a> is an initiative by Google to improve the “mobile web”.</p>\n<p>Accelerated Mobile Pages are an alternate version of their corresponding, canonical web page. They’re still HTML but limited — <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/ampproject/amphtml/blob/master/spec/amp-html-format.md\">check the spec</a>. The best way to understand Accelerated Mobile Pages is to see them in action:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/amphtml-bbc-news.png\" alt=\"BBC News article responsive and AMP page designs\"></p>\n<p>The BBC News website has implemented AMP, screenshotted above (left: responsive page, right: AMP alternative). The responsive page is 410KB with 68 requests, the AMP page is 115KB and 4 requests. The AMP page content is stripped back to the bare minimum for a <em>single article</em>. The responsive page has a menu, footer, and several featured &amp; related article components.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/amphtml-the-guardian.png\" alt=\"The Guardian news article responsive and AMP page designs\"></p>\n<p>The Guardian’s AMP pages have a bit more content including a list of related articles just above a footer. The responsive page is 454kb with 67 requests, the AMP page is 127kb and 8 requests. So very similar to BBC News.</p>\n<p>I’ve attempted to implement AMP on my own blog:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/amphtml-dbushell.png\" alt=\"dbushell.com blog article responsive and AMP page designs\"></p>\n<p>As you can see above, there’s very little visual difference (header, footer, and web fonts are gone). In this example my responsive page is 405KB with 8 requests, the AMP page is 48KB and 2 requests. The vast majority of page weight on my website belongs to images. I compress them well but I’m a bit lazy with serving smaller versions, opting to scale down instead. “Responsive images” are on my to-do list.</p>\n<h2 id=\"who-sees-amp-\">Who sees AMP?</h2>\n<p>It’s important to note that AMP is not intended to be a separate m. website in disguise. Responsive design is still “best practice”. You don’t redirect mobile users to AMP pages and not every page should have an AMP alternative. AMP is best suited to single article content.</p>\n<p>So when do users see an AMP page? Well <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.youtube.com/watch?v=i2_lAEzmOPo\">Google search results</a> may integrate them soon as demoed in this video. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://blog.twitter.com/2015/introducing-accelerated-mobile-pages-0\">Twitter are also onboard</a> saying, <q>Over the coming months, we plan to help surface more AMP content in Tweets, making it even easier for our users to browse the mobile web.</q></p>\n<p>We know that speed is a critical factor when deciding whether to read or abandon a website. Especially when casually browsing social media links. AMP gives the ability to preview even lighter versions of web page content in these scenarios.</p>\n<p>That said, if Twitter insists on wrapping all URLs with a t.co redirect the whole initiative is pointless on their part. I can’t be the only one that finds t.co links take <em>forever</em> to resolve, can I?!</p>\n<h2 id=\"my-thoughts\">My Thoughts</h2>\n<p>Google are well known for abandoning projects. <a href=\"/2011/07/14/the-social-designer-google-authorship/\">Google Authorship</a> comes to mind. However, with big players like The Guardian, BBC News, Twitter, and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://vip.wordpress.com/2015/10/07/mobile-web/\">WordPress</a> already on board, it’ll be very interesting to see just how prevalent AMP becomes.</p>\n<p>As to how AMP will affect the web, that depends upon how user agents make use of AMP, and we’re seeing little of that at present.</p>\n<p>It also depends upon how websites respect the format. Say Google prioritise AMP-lified content in search results. Now the SEO / marketing people get a whiff and AMP is adopted quickly. These same people look at their simple AMP pages and ask: <em>“Where is the conversion? Where is the call to action?”</em> and before long AMP pages are full of links encouraging users to visit the full website or download the app which they can use to access the same content as the website but inside a lovely walled garden. Then <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://wtfmobileweb.com/\">WTF Mobile Web</a> in inundated with fresh content.</p>\n<p>We’ll see. I feel quite positive about this project but I’m sure many will fear Google’s influence on the web as they tighten their grip. Is the future ‘Accelerated Mobile Websites’? I doubt even Google are big enough to force that, but if they can, it’ll be one step at a time.</p>\n<p>I’m going to dress up as Google for Halloween.</p>\n",
  "pageExcerpt": "The AMP Project is an initiative by Google to improve the “mobile web”.\nAccelerated Mobile Pages are an alternate version of their corresponding, canonical web page. They’re still HTML but limited — check the spec. The best way to understand Accelerated Mobile Pages is to see them in action:\n\nThe BBC News website has implemented AMP, screenshotted […]",
  "pageTitle": "Accelerated Mobile Pages – David Bushell – Web Design (UK)"
}