{
  "dateUnix": 1261335516000,
  "dateFormatted": "Sunday 20 Dec 2009",
  "pageHeading": "Happy New Year!",
  "pagePath": "/2009/12/20/happy-new-year/",
  "innerHTML": "<p>I know, I’m a few weeks early with the cheer (but this blog will have more legs).</p>\n<p>I’ve spent the weekend wrapping Xmas gifts for the family. As a “creative” person I’ve always felt slightly guilty about my poor wrapping skills. Last year I stepped it up a notch and use a large black marker to write the gift recipients in perfectly handwriting 72pt Helvetica. No one noticed.</p>\n<p>This year I’m back in DCM (don’t care mode) but I did buy some glittery wrapping paper. I’m covered in the bloody stuff now. A lot of designers enjoy making their own Christmas cards and paper. If I think of a witty idea I’ll blog it for next year. I wonder if anyone has done Pantone wrapping paper yet? Alternatively I could go “green” and refuse to wrap my plastic packaged gifts with dead trees. But then it wouldn’t be a surprise.</p>\n<p>So wrapping hasn’t been successful, but it has been a great year working at Base Creative. January will see a few more websites launched which we’re all very proud of. And there’s already exciting new projects in the pipeline.</p>\n<p>I’ve decided to make some end-of-year resolutions. (Different than new year resolutions in that I don’t plan to ignore them come February.)</p>\n<ul>\n<li><strong>Blog more!</strong> There is so much web and design related stuff I should be writing about. I actually have a long list of good topics I’d like to share.</li>\n<li><strong>Personal projects.</strong> This year I updated my website and launched <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.designheroes.co.uk\">Design Heroes</a>. Next year I’m going to be doing a lot more!</li>\n<li><strong>Buy a new lightbulb.</strong> I’m sat in the dark here.</li>\n</ul>\n<p>That’s all for now folks.</p>\n<p>Oh go on then, just time for a small rant.</p>\n<p>Use to be that a man could walk into Top Shop or River Island and buy a <strong>£20</strong> gift voucher and in exchange hand over <strong>£20</strong> and a small amount of embarrassment from unsuccessfully trying to avoid eye-contact with the women sizing up bras. Now a <strong>£20</strong> gift voucher costs <strong>£25</strong> (TWENTY FIVE QUID!) at Top Shop. Greedy bastards!</p>\n<p>I was light-headed from all the perfume in the air. Had I been more alert I would have phoned the police. To be fair whoever figured out they could charge £25 for £20 is genius.</p>\n<p>Happy Christmas and a Merry New Year :)</p>\n<p>Your presents with the Royal Mail, so I hesitate to say “it’s in the post”.</p>\n",
  "pageExcerpt": "I know, I’m a few weeks early with the cheer (but this blog will have more legs).\nI’ve spent the weekend wrapping Xmas gifts for the family. As a “creative” person I’ve always felt slightly guilty about my poor wrapping skills. Last year I stepped it up a notch and use a large black marker to […]",
  "pageTitle": "Happy New Year! – David Bushell – Web Design (UK)"
}