{
  "pagePath": "/blog/",
  "pageHeading": "Blog",
  "excerpts": [
    {
      "id": "pwa-web-crypto-encryption-auto-sign-in-redux-persist",
      "title": "PWA Encryption and Auto Sign-in",
      "href": "/2020/06/08/pwa-web-crypto-encryption-auto-sign-in-redux-persist/",
      "body": "Mute Swan is a progressive web app I’ve been coding for my own amusement. It’s a playground for me to mess around with experimental web standards. Also to remind myself to buy milk.\n\n  \n\n\nI’ve recently implemented hidden Dropbox backup and sync functionality. With that in place I decided that my grocery list was of […]",
      "date": 1591610400000
    },
    {
      "id": "bubblewrap-twa-pwa-apps-android-studio",
      "title": "Bubblewrap Apps in Android Studio",
      "href": "/2020/06/01/bubblewrap-twa-pwa-apps-android-studio/",
      "body": "Bubblewrap is a convenient tool to generate an Android app from a Progressive Web App. I used it to bundle my PWA recently.\nIt’s run from the command line:\nbubblewrap init --manifest \"https://muteswan.app/manifest.webmanifest\"\nBubblewrap generates the build config and assets for the app. Continuing with bubblewrap build results in an .apk if you’ve installed the Android build tools.\nI […]",
      "date": 1591005600000
    },
    {
      "id": "wordpress-gutenberg-react-acf-example-blocks",
      "title": "WordPress Gutenberg Example Blocks",
      "href": "/2020/05/08/wordpress-gutenberg-react-acf-example-blocks/",
      "body": "Following my last article I’ve published a new GitHub repo:\nWordPress Gutenberg Example Blocks\nIn there I’ve coded examples of Gutenberg block development wrapped up in a tidy WordPress plugin you can try out.\nI start with the most basic block possible. I follow with iterations of more advanced functionality. I’ve kept the boilerplate and dependencies to a […]",
      "date": 1588932000000
    },
    {
      "id": "wordpress-gutenberg-react-and-advanced-custom-fields",
      "title": "WordPress Gutenberg: React & Advanced Custom Fields (ACF)",
      "href": "/2020/04/24/wordpress-gutenberg-react-and-advanced-custom-fields/",
      "body": "The new WordPress Gutenberg editor has been in release for over a year. Post content is composed of “blocks”. Everything is a block. From the humble paragraph to the more advanced gallery and video embed — all blocks.\nThere are two common methods to create Gutenberg blocks.\nThe first is to follow the offical handbook. Blocks and […]",
      "date": 1587722400000
    },
    {
      "id": "debugging-a-todo-app",
      "title": "Debugging a Todo App",
      "href": "/2020/03/27/debugging-a-todo-app/",
      "body": "So lately I’ve been boasting about how easy it is to build Progressive Web Apps. I’ve been dogfooding my glorified todo app Mute Swan for weeks thinking it was perfect (bug-free) and quite possibly a game changer, if I dare say.\nAs it turns out these things are not so easy to test. This week I […]",
      "date": 1585303200000
    },
    {
      "id": "bundle-a-pwa-as-an-android-app",
      "title": "Bundle a PWA as an Android App",
      "href": "/2020/03/05/bundle-a-pwa-as-an-android-app/",
      "body": "A Progressive Web App (PWA) is a website with a few extra pieces.\nPWAs can be installed or bookmarked from the browser using “Add to Home Screen”. On Android 9 doing this via Firefox (v68, left) and Chrome (v80, right) gives two different results on my Samsung S8:\n\n  \n\n\nThe Firefox icon isn’t desirable. Although the […]",
      "date": 1583402400000
    },
    {
      "id": "http-security-headers-and-inline-resources",
      "title": "HTTP Security Headers and Inline Resources",
      "href": "/2020/02/28/http-security-headers-and-inline-resources/",
      "body": "As it turns out, HTTPS is not the end-all to securing a website.\nMozilla Observatory and Security Headers both scan HTTP headers and report back on adherence to, or lack thereof, best practices.\nIn my case dbushell.com gets a big fat “F”. I’m hosting on GitHub Pages so there is not much I can do except use […]",
      "date": 1582884000000
    }
  ],
  "nextPage": "/blog/page/2/",
  "prevPage": null,
  "pageTitle": "Blog – David Bushell – Web Design (UK)"
}