{
  "pagePath": "/blog/",
  "pageHeading": "Blog",
  "excerpts": [
    {
      "id": "debugging-a-todo-app",
      "title": "Debugging a Todo App",
      "href": "/2020/03/27/debugging-a-todo-app/",
      "body": "So lately I’ve been boasting about how easy it is to build Progressive Web Apps. I’ve been dogfooding my glorified todo app Mute Swan for weeks thinking it was perfect (bug-free) and quite possibly a game changer, if I dare say.\nAs it turns out these things are not so easy to test. This week I […]",
      "date": 1585303200000
    },
    {
      "id": "bundle-a-pwa-as-an-android-app",
      "title": "Bundle a PWA as an Android App",
      "href": "/2020/03/05/bundle-a-pwa-as-an-android-app/",
      "body": "A Progressive Web App (PWA) is a website with a few extra pieces.\nPWAs can be installed or bookmarked from the browser using “Add to Home Screen”. On Android 9 doing this via Firefox (v68, left) and Chrome (v80, right) gives two different results on my Samsung S8:\n\n  \n\n\nThe Firefox icon isn’t desirable. Although the […]",
      "date": 1583402400000
    },
    {
      "id": "http-security-headers-and-inline-resources",
      "title": "HTTP Security Headers and Inline Resources",
      "href": "/2020/02/28/http-security-headers-and-inline-resources/",
      "body": "As it turns out, HTTPS is not the end-all to securing a website.\nMozilla Observatory and Security Headers both scan HTTP headers and report back on adherence to, or lack thereof, best practices.\nIn my case dbushell.com gets a big fat “F”. I’m hosting on GitHub Pages so there is not much I can do except use […]",
      "date": 1582884000000
    },
    {
      "id": "docker-wordpress-portless-localhost-domains",
      "title": "Docker, WordPress, and Portless Localhost Domains",
      "href": "/2020/02/07/docker-wordpress-portless-localhost-domains/",
      "body": "The Docker life chooses you. I bet a lot of developers have had a similar introduction. You’re brought onto a project and it’s like; “Hey we’re using Docker, just run ‘docker-compose up’.“ they say, “Sure, I know Docker,“ you shrug. Then you spend the better part of the week debugging.\nI’ve worked on maybe two dozen […]",
      "date": 1581069600000
    },
    {
      "id": "building-a-pwa-with-netlify-functions",
      "title": "Building a PWA with Netlify Functions",
      "href": "/2020/01/27/building-a-pwa-with-netlify-functions/",
      "body": "A couple of weeks ago I took Netlify for a spin. I found the platform to be much easier to use than I’d anticipated. I was keen to test more features.\nNetlify Functions provide back-end functionality through API endpoints. They’re powered by AWS Lambda. I’m using AWS for my contact form. It took me forever to […]",
      "date": 1580119200000
    },
    {
      "id": "a-morning-with-vuejs",
      "title": "A Morning with Vue.js",
      "href": "/2020/01/23/a-morning-with-vuejs/",
      "body": "I’m a React person but I’m not devoted to it. Honest! Earlier this week I found a morning to flirt with Vue.js.\n\nMy intention was to pen an article comparing the two frameworks. Upon reflection it feels somewhat pointless. Like React, Vue is primarily “focused on the view layer”. And like React, Vue does a pretty […]",
      "date": 1579773600000
    },
    {
      "id": "netlify-first-impressions",
      "title": "Netlify: First Impressions",
      "href": "/2020/01/15/netlify-first-impressions/",
      "body": "Netlify is hot right now. It’s been hot for a while. It’s on my list of tech I pretend to know when people ask. I assume it handles static site hosting and deployment.\n\nJAMstack is a popular/confusing term covering static sites and the new tech surrounding them. I’ve long adhered to such a philosophy for personal […]",
      "date": 1579082400000
    }
  ],
  "nextPage": "/blog/page/2/",
  "prevPage": null,
  "pageTitle": "Blog – David Bushell – Web Design (UK)"
}