{
  "dateUnix": 1304442473000,
  "dateFormatted": "Tuesday 3 May 2011",
  "pageHeading": "Why I’ll never be out of a job",
  "pagePath": "/2011/05/03/why-ill-never-be-out-of-a-job/",
  "innerHTML": "<p>The 15th Annual <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.webbyawards.com/\">Webby Awards</a> winners were announced today.</p>\n<p>Now, I’m not one to be cynical (and I’ve pledged to <a href=\"/2011/04/24/design-and-enjoy-it/\">avoid negativity</a>) but I’m completely perplexed at some of the design related choices. Many of the awards are purely content based which I’m not interested in, but this won <strong>Best Navigation/Structure</strong>:</p>\n<p><a href=\"http://www.hidden-heroes.net/\"><p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/webbyawards.png\" alt=\"Webby Awards - Best Navigation/Structure - Screenshot 1\"></p>\n</a></p>\n<p>The Webby Awards winner for Best Navigation/Structure.</p>\n<p>I’m seriously stunned!</p>\n<p>Now forgetting the fact that this website is 100% Flash and takes literally <em>minutes</em> to load – it has one of <strong>the worst</strong> pieces of “navigation” and “structure” I have ever seen.</p>\n<p>Here is what’s wrong:</p>\n<ul>\n<li>An instruction is required to explain how to navigation the website.</li>\n<li>The “<em>Enter Exhibition</em>“ button is disabled on load.</li>\n<li>Users have to first click on coloured bars with 90° vertical text labels (on hover).</li>\n<li>Nothing noticeable happens when a bar is clicked, though when you move your cursor away the label is persistent.</li>\n<li>Finally, “<em>Enter Exhibition</em>“ has to be clicked (now enabled, by the way).</li>\n</ul>\n<p>No matter which bars you’ve previously clicked, you are then presented with this:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/webby2.png\" alt=\"Webby Awards - Best Navigation/Structure - Screenshot 2\"></p>\n<blockquote>\n<p>I can’t actually link to this page because the website is developed in Flash (poorly).</p>\n</blockquote>\n<p>Once loaded an animated cursor proceeds to demonstrate how you’re suppose to drag the next part of the “<em>Best Navigation/Structure</em>“ into view. Blink and you’ll miss it. <strong>And you <em>will</em> miss it</strong>, because it took five minutes to load and you’ve clicked to another tab, or given up entirely.</p>\n<p>Is <strong>usability</strong> not the number one criteria for <em>“Best Navigation/Structure</em>“? Let’s see what the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.webbyawards.com/entries/criteria.php\">Webby Awards</a> says about this:</p>\n<blockquote>\n<p>Sites with good structure and navigation are consistent, intuitive and transparent. They allow you to form a mental model of the information provided, where to find things, and what to expect when you click. Good navigation gets you where you want to go quickly and offers easy access to the breadth and depth of the site’s content.</p>\n</blockquote>\n<p>Now I ask openly – what part of that criteria is reflected in the winning site above? None at all. It has a closer resemblance to a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.amazon.co.uk/Vinci-Code-Dan-Brown/dp/0552149519/\">Dan Brown</a> novel.</p>\n<p>What about <strong>accessibility</strong>? Surely awarding winning navigation &amp; structure should be accessible to those with disabilities? This website is an insult to that idea.</p>\n<p>Thankfully the “<em>People’s Voice</em>“ award for “<em>Best Navigation/Structure</em>“ went to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.zappos.com\">Zappos</a>, a website that does a very good job of organising its content. Clearly most people have common sense, faith in humanity restored as they say.</p>\n<p>With websites like this I’ll never be out of a job :)</p>\n",
  "pageExcerpt": "The 15th Annual Webby Awards winners were announced today.\nNow, I’m not one to be cynical (and I’ve pledged to avoid negativity) but I’m completely perplexed at some of the design related choices. Many of the awards are purely content based which I’m not interested in, but this won Best Navigation/Structure:\n\n\nThe Webby Awards winner for Best […]",
  "pageTitle": "Why I’ll never be out of a job – David Bushell – Web Design (UK)"
}