{
  "dateUnix": 1356212688000,
  "dateFormatted": "Saturday 22 Dec 2012",
  "pageHeading": "A Responsive Off-Canvas Menu",
  "pagePath": "/2012/12/22/a-responsive-off-canvas-menu-with-css-transforms-and-transitions/",
  "innerHTML": "<p>Have a play with my <a href=\"https://dbushell.com/demos/viewport/menu1/\">responsive off-canvas menu</a>. I hadn’t intended this to go viral (I’m well aware of the issues!) but since it has I decided to write a proper introduction.</p>\n<p class=\"b-post__image\"><a href=\"https://dbushell.com/demos/viewport/menu1/\"><img src=\"/images/2012/12/off-canvas-menu.png\" alt=\"A Responsive Off-Canvas Menu\"></a></p>\n\n<p>A couple of things to note — this was purely a technical demo to see the performance of CSS transforms &amp; transitions (I’ve built <a href=\"https://dbushell.com/2012/05/15/pageshift-removing-the-refresh/\">experimental monstrosities</a> in the past so I felt obliged to do good). The general idea is nothing new. It lacks accessible foundations and unfortunately, as many have fed back, there are rendering issues that cause flickering in some browsers.</p>\n<p>This is part of my research for an upcoming <strong>Smashing Magazine</strong> article and my talk at <a href=\"https://dbushell.com/2012/12/07/responsive-day-out/\">Responsive Day Out</a>. In both I’ll be examining design patterns we can use to improve <strong>responsive design</strong> and silence the critics.</p>\n<p>We need to embrace the viewport and do more than stack content vertically; one very long scroll is no better UX than a zoomed out, fixed-width format.</p>\n<p>To take responsive design — or simply web design — into new territory we need sound implementation; hence the experimentation above. More to come! For now I’ll point to Siddharth Rao’s article on <a href=\"http://dev.opera.com/articles/view/css3-vs-jquery-animations/\">CSS3 vs jQuery Animations</a> and Brad Frost’s <a href=\"http://bradfrost.github.com/this-is-responsive/patterns.html\">Responsive Patterns</a> for further inspiration.</p>\n<p>See you next year!</p>\n",
  "pageExcerpt": "Have a play with my responsive off-canvas menu. I hadn’t intended this to go viral (I’m well aware of the issues!) but since it has I decided to write a proper introduction.\n\n\nA couple of things to note — this was purely a technical demo to see the performance of CSS transforms &amp; transitions (I’ve built […]",
  "pageTitle": "A Responsive Off-Canvas Menu – David Bushell – Web Design (UK)"
}