{
  "pagePath": "/blog/page/20/",
  "pageHeading": "Blog (page 20)",
  "excerpts": [
    {
      "id": "pageshift-removing-the-refresh",
      "title": "Pageshift",
      "href": "/2012/05/15/pageshift-removing-the-refresh/",
      "body": "It’s 2012, why are we still seeing websites assemble like Optimus Prime?\nIn January I wrote Web Design: 2012 and Beyond to highlight points of interest for the coming year. On interactivity I asked, “Is the page reload a thing of the past?”. ‘Web apps’ are all the rage, and while we shouldn’t be trying to copy native […]",
      "date": 1337119848000
    },
    {
      "id": "were-hiring",
      "title": "We’re Hiring!",
      "href": "/2012/05/15/were-hiring/",
      "body": "\nWe’re hiring at Browser. If you like making stuff for the Web you’ll fit right in. The roles that need filling are a Junior Digital Designer/Developer (1 year’s experience needed) and an Intern Digital Designer (no experience, but lots of skills and ambition).\nHit the website for more info and contact details.\nRecruitment agencies, try: +44 (0) 8705 244622.\n",
      "date": 1337065744000
    },
    {
      "id": "paydirt-youre-doing-it-wrong",
      "title": "Paydirt: You’re Doing It Wrong",
      "href": "/2012/05/08/paydirt-youre-doing-it-wrong/",
      "body": "\nWe don’t spend hours debugging obscure IE bugs…\n\nNeither do I, yet my websites work just fine in Internet Explorer.\nJust over a month after the last “we’re dropping IE support” publicity stunt, another tech start-up has successfully hit pay dirt with the exact same bullshit (read: actively blocking IE).\nI realise that by sharing this link bait I’m feeding the trolls, […]",
      "date": 1336511221000
    },
    {
      "id": "smashing-book-3",
      "title": "Smashing Book 3",
      "href": "/2012/05/07/smashing-book-3/",
      "body": "As an occasional writer for Smashing Magazine — that’s a disclaimer (and an honour!) — I’ve had the pleasure of reading the latest publication, Smashing Book #3 - Redesign The Web.\nHere’s my honest opinion on why this book is worth buying:\nOn Business\nBook #3 opens with wise words from Paul Boag on the reality of web design as […]",
      "date": 1336398706000
    },
    {
      "id": "hacking-it-right",
      "title": "Hacking it Right",
      "href": "/2012/05/03/hacking-it-right/",
      "body": "Developing with open web standards that are to be interpreted by literally hundreds of variations in device and browser can be tricky, but the biggest problem is often not the browser interpreting the code, but the developer writing it. Many so called “bugs” are the product of bad code and wrong expectations; don’t blame the machine.\nA […]",
      "date": 1336082878000
    },
    {
      "id": "notes-from-user-testing",
      "title": "Notes From User Testing",
      "href": "/2012/04/30/notes-from-user-testing/",
      "body": "Last week Browser hosted a UAT session for our latest website development (launching soon!)\nMost website designs — or any design for that matter — do not go through this sort of testing but it’s well worth the effort when done right. It’s exciting and a bit scary to be sat there with your clients while […]",
      "date": 1335770434000
    },
    {
      "id": "modularity-and-style-guides",
      "title": "Modularity and Style Guides",
      "href": "/2012/04/23/modularity-and-style-guides/",
      "body": "Last week I wrote about scoping typographic styles to introduce the concept of modularity in CSS. In that example, I removed the common globally defined text styles — for paragraphs, headings and lists etc — and scoped them with a .text class to be applied to any block of text-based content. This technique gives us more control […]",
      "date": 1335174328000
    }
  ],
  "nextPage": "/blog/page/21/",
  "prevPage": "/blog/page/19/",
  "pageTitle": "Blog (page 20) – David Bushell – Web Design (UK)"
}