{
  "pagePath": "/blog/page/20/",
  "pageHeading": "Blog (page 20)",
  "excerpts": [
    {
      "id": "dropping-ie-support",
      "title": "Dropping IE Support",
      "href": "/2012/04/02/dropping-ie-support/",
      "body": "Yesterday TechCrunch reported on the start-up 4ormat and their decision to drop support for Internet Explorer entirely. Their logic behind this seems simple enough; developing for IE users did not equate to profit.\n\nSupporting variants of IE can easily increase design work by 30% to 100%, but complex features can easily double (or even triple) development time. It […]",
      "date": 1333373071000
    },
    {
      "id": "introducing-shiro",
      "title": "Introducing Shiro",
      "href": "/2012/03/27/introducing-shiro/",
      "body": "Update — March 19th, 2013: please read this article for updates!\nI’ve always taken a very liberal/aggressive approach to progressive enhancement. Older browsers get accessible content but layout is limited and aesthetic styles are better lost completely than hacked on with nasty techniques.\nEvery website is different of course. When I redesigned my personal website I had a large […]",
      "date": 1332836102000
    },
    {
      "id": "the-mobile-fallacy",
      "title": "The Mobile Fallacy",
      "href": "/2012/03/23/the-mobile-fallacy/",
      "body": "Brad Frost wrote an excellent overview of Content Parity saying “it’s alright to optimize the presentation of content as long as the content remains accessible in some way, shape or form”. This is so vital to understand when designing for the Web across multiple devices. There are still far too many designers equating mobile with ‘on […]",
      "date": 1332502608000
    },
    {
      "id": "preserving-the-web",
      "title": "Preserving the Web",
      "href": "/2012/03/20/preserving-the-web/",
      "body": "Before I ramble on, if you haven’t seen Jeremy Keith’s talk on time, networks and history, may I point you to his article: Of Time And The Network. You can also watch his talk from Webstock ‘12 on Vimeo.\nIn regards to our content he says:\n\nPublish it. Publish it on the network. Put it out there, using standardised […]",
      "date": 1332277791000
    },
    {
      "id": "the-lovedsgn-story",
      "title": "The LoveDsgn Story",
      "href": "/2012/03/18/the-lovedsgn-story/",
      "body": "Zero to 200,000 page views and 1000 members in less than 30 days. A brand new domain, no advertising.\nThat’s the sort of website launch our clients convince themselves of but never see. Nobody is talking about a website they’ve never heard of, nobody is searching for something they didn’t know existed. And yet I sat […]",
      "date": 1332082842000
    },
    {
      "id": "ideas-of-march",
      "title": "Ideas of March",
      "href": "/2012/03/16/ideas-of-march/",
      "body": "If you haven’t read an Ideas of March post yet they all start by explaining what an Ideas of March post is. I’m just going to link to Chris Shiflett’s 2012 update.\nI believe I’m suppose to write about writing. When I started this blog in 2008 post-graduation it began as a tiny link hidden away in the […]",
      "date": 1331935405000
    },
    {
      "id": "svg-all-fun-and-games",
      "title": "SVG, all fun and games!",
      "href": "/2012/03/11/svg-all-fun-and-games/",
      "body": "When I wrote Resolution Independence for Smashing Magazine I focused almost exclusively on SVG (Scalable Vector Graphics) to save our souls from high-resolution hell.\nSVG is more than just a vector graphic format. I’m here to tell you why it’s better than sliced bread and highlight some of the problems you’ll encounter in everyday front-end usage.\nFeatures / Support\nAs […]",
      "date": 1331429092000
    }
  ],
  "nextPage": "/blog/page/21/",
  "prevPage": "/blog/page/19/",
  "pageTitle": "Blog (page 20) – David Bushell – Web Design (UK)"
}