{
  "dateUnix": 1318539515000,
  "dateFormatted": "Thursday 13 Oct 2011",
  "pageHeading": "Web Apps and iOS5",
  "pagePath": "/2011/10/13/web-apps-and-ios5/",
  "innerHTML": "<p>One less advertised feature of iOS5 is Mobile Safari CSS support for <strong><code>position:fixed</code></strong>. Much overdue, and very useful for creating “web apps” where navigation bars are fixed to the viewport’s edge (top or bottom), allowing content to scroll naturally underneath.</p>\n<p>Some mobile bowsers already support this (see <a href=\"http://mobilehtml5.org/\">Mobile HTML5</a> and <a href=\"http://caniuse.com/#search=position\">When can I use…</a>) and all modern <a href=\"http://www.quirksmode.org/css/contents.html\">desktop browsers</a> do (as you would probably expect).</p>\n<p>The term “web app” is rather irrelevant, a website is a <em>website</em>, though functionality based mobile — <em>ahem, small screen</em> — websites are where this fixed positioning technique can be handy; it replicates the design paradigm that many native apps employ.</p>\n<p>In the past we’ve had to either:</p>\n<ol>\n<li>Use JavaScript to regularly reposition elements accordingly based on the documents scroll offset (to keep them in view). Very noticeably laggy and thus unacceptable.</li>\n<li>Use <strong><code>position:absolute</code></strong> (top &amp; bottom) on all containing elements so that the document is never larger than the viewport, then re-implement scrolling on the main container with JavaScript and touch event listeners. This is <em>OK</em> — Google’s Ryan Fioravanti <a href=\"http://code.google.com/mobile/articles/webapp_fixed_ui.html\">explains how</a> — but it does cause gotchas with form elements, and trying to re-implement the smooth, native scrolling of the iPhone seems silly.</li>\n</ol>\n<p>The lack of fixed positioning in Mobile Safari is a real headache for creating web apps. Matteo Spinelli — <em>the developer of <a href=\"http://cubiq.org/iscroll-4\">iScroll</a></em> — knows this <a href=\"http://cubiq.org/ios5-the-first-true-web-app-ready-platform\">all too well</a>. He envisions a future where most “native apps” are simply wrappers for responsive websites. A distinctly advantageous method:</p>\n<blockquote><p>Web apps are much more than position:fixed or webGL. You can update them on the fly, build your own business model on them, ask for a subscription fee, have your users pay for additional features, or make them completely free.</p></blockquote>\n\n\n<p>And most importantly, the same app or website can be made accessible on all web devices, just like a good website should. There are many disadvantages of course, but those are for another article :)</p>\n<h2 id=\"maintaining-legacy-support\">Maintaining legacy support</h2>\n<p>Should we rejoice in the fact that iOS5 now supports <strong><code>position:fixed</code></strong>?</p>\n<p>Yes, but we’re not quite home free. We still have to support the non-upgraders, the pre-iOS5 users. The trouble is that there’s no easy way to check browser support for fixed positioning. Keep an eye on the <a href=\"https://github.com/Modernizr/Modernizr/issues/167\">Modernizr discussion</a> for the latest developments.</p>\n<p>Once a trustworthy test is established we can start implementing the fixed positioning technique and use the old JavaScript method as a fallback. Let’s not forget older devices. Calling a website a “web app” does not make it excusable to only support one or two devices (in my opinion). We’re talking about graceful degradation as usual.</p>\n<p>It’s worth noting that iOS5 has also added support for <strong><code>overflow:scroll</code></strong> and <strong><code>-webkit-overflow-scrolling:touch</code></strong>, meaning that other native style interactions can be replicated a lot easier.</p>\n<p>I’ve designed and built <a href=\"https://dbushell.com/showcase/my-life-listed/\">mobile specific</a> websites before, as well as many more fully responsive websites. With techniques like this I can see a future where responsive website designs can deliver a natively styled and packaged “web app” that is also accessible on normal mobile &amp; desktop web browsing.</p>\n<p>A preferable future, I’m sure you’ll agree.</p>\n",
  "pageExcerpt": "One less advertised feature of iOS5 is Mobile Safari CSS support for position:fixed. Much overdue, and very useful for creating “web apps” where navigation bars are fixed to the viewport’s edge (top or bottom), allowing content to scroll naturally underneath.\nSome mobile bowsers already support this (see Mobile HTML5 and When can I use…) and all […]",
  "pageTitle": "Web Apps and iOS5 – David Bushell – Web Design (UK)"
}