{
  "dateUnix": 1332836102000,
  "dateFormatted": "Tuesday 27 Mar 2012",
  "pageHeading": "Introducing Shiro",
  "pagePath": "/2012/03/27/introducing-shiro/",
  "innerHTML": "<p><strong>Update — March 19th, 2013:</strong> <a href=\"/2013/03/19/on-responsive-layout-and-grids/\">please read this article for updates!</a></p>\n<p>I’ve always taken a very liberal/aggressive approach to progressive enhancement. Older browsers get accessible content but layout is limited and aesthetic styles are better lost completely than hacked on with nasty techniques.</p>\n<p>Every website is different of course. When I redesigned my <a href=\"https://dbushell.com/2012/03/03/forget-about-browser-support/\">personal website</a> I had a large list of “required” standards to see the optimal version. That’s cool; my audience is on the cutting edge of browser tech. I wasn’t too worried about delivering complex layout to old versions of IE. Our latest project at <a href=\"http://www.browserlondon.com/\">Browser</a> sees an audience that is almost <strong>50% Internet Explorer — </strong>and a great many lower than version 8. (I spat my coffee out too.)</p>\n<p>We’ve designed a bold visual style that looks very modern but won’t depend on any fancy CSS. Great, but what about layout? Producing a basic linear format for such a large percentage of visitors isn’t the “best possible experience” I like to take about. I’ve been working on a solution…</p>\n<h2 id=\"hello-shiro\">Hello Shiro</h2>\n<p>To solve this little conundrum I’ve been experimenting with a basic responsive grid that can transform into a fixed-width layout in IE6–8 (which don’t support media queries). All with a tiny 1000 byte JavaScript shim. Shiro is a building block for your mobile-first build, it won’t fix further IE bugs but it’s a nice start.</p>\n<p><a href=\"http://shiro.dbushell.com/\">Visit the Shiro preview</a> and have a hack around.</p>\n<p>Here’s what it looks like in IE6:</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/03/shiro-ie6.png\"><img src=\"/images/2012/03/shiro-ie6.png\" alt=\"Shiro in IE6\"></a></p>\n\n<p>PS, I will be dogfooding this in the coming weeks so expect updates!</p>\n",
  "pageExcerpt": "Update — March 19th, 2013: please read this article for updates!\nI’ve always taken a very liberal/aggressive approach to progressive enhancement. Older browsers get accessible content but layout is limited and aesthetic styles are better lost completely than hacked on with nasty techniques.\nEvery website is different of course. When I redesigned my personal website I had […]",
  "pageTitle": "Introducing Shiro – David Bushell – Web Design (UK)"
}