{
  "dateUnix": 1332082842000,
  "dateFormatted": "Sunday 18 Mar 2012",
  "pageHeading": "The LoveDsgn Story",
  "pagePath": "/2012/03/18/the-lovedsgn-story/",
  "innerHTML": "<p><strong>Zero to 200,000</strong> page views and 1000 members in less than 30 days. A brand new domain, no advertising.</p>\n<p>That’s the sort of website launch our clients convince themselves of but never see. Nobody is talking about a website they’ve never heard of, nobody is searching for something they didn’t know existed. And yet I sat astounded seeing these numbers in front of my eyes. It might not have been the seven-digit figures we expect today’s silicon start-ups to achieve but it was enough to sustain a healthy community.</p>\n<h2 id=\"launch-growth\">Launch &amp; Growth</h2>\n<p>I quietly launched <a href=\"http://lovedsgn.com\">lovedsgn.com</a> in <strong>July 2010</strong> following up with a simple question: <a href=\"https://dbushell.com/2010/09/02/do-you-love-design/\">Do you Love Design?</a> I never really explained what LoveDsgn was for — honestly, I didn’t know myself — but it had something to do with writing and blogging.</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/03/lovedsgn-version-1.png\"><img src=\"/images/2012/03/lovedsgn-version-1.png\" alt=\"LoveDsgn version 1\"></a></p>\n\n<p>I wanted a platform for designers to share their thoughts. Even the poorest of writers are capable of sharing incredible design insights but without some kind of natural filter the gems go undiscovered. That sounds quite harsh, I know back then most of my articles were rather drab — I like to think I’ve improved — but when/if I shine, I’d like to be noticed too. <em>That</em> was what LoveDsgn was originally about. I Just didn’t know how to achieve that vague goal.</p>\n<blockquote><p>The focus is on typography and writing on creativity […] Ultimately the site is curated by the members and they’ll dictate the content and features to come.</p></blockquote>\n\n\n<p>LoveDsgn soared in popularity and version 1 was quickly replaced in <strong>October 2010</strong> with something far more robust and — unfortunately — more graphical. August to November was mayhem. 9am–6pm I worked a full time job, in the evenings 7pm–1am and weekends I worked on LoveDsgn.</p>\n<p>I was inundated with feature requests and advertising opportunities. In an effort to make the home page more appealing I added and mandated imagery to accompany each post. By choosing the 640×360 resolution I was able to allow members to embed YouTube and Vimeo videos for motion graphic design.</p>\n<p>I added voting, following, revisions, search, tagging, social buttons, comments — all the “must have” features a social website needs.</p>\n<p class=\"b-post__image\"><img src=\"/images/2012/03/1097.png\" alt=\"LoveDsgn home page redesign\"></p>\n\n<p>When I was not building I was encouraging community growth on other social networks, primarily Facebook and Twitter, and the monthly newsletter. It was a whirlwind few months of countless iteration and an ever increasing user count. From day one and for a long time LoveDsgn thrived.</p>\n<p>Over the Christmas and New Year entering 2011 LoveDsgn peaked at over <strong>30,000 unique visitors</strong> per month. A height it would never see again. Come March 2011 — exactly a year ago — all stats were clearly on the decline.</p>\n<p class=\"b-post__image\"><a href=\"/images/2012/03/lovedsgn-stats1.png\"><img src=\"/images/2012/03/lovedsgn-stats1.png\" alt=\"LoveDsgn visitor stats\"></a></p>\n\n<p>What had gone wrong?</p>\n<h2 id=\"mistakes\">Mistakes</h2>\n<p>The biggest mistake I made was to forget the core idea that had initially inspired LoveDsgn. This was suppose to be a place to promote the <em>written work</em> of designers. Visiting the website in 2011 you’d have never of known that.</p>\n<p>Before I knew it I had created a <a href=\"http://dribbble.com\">Dribbble</a> clone. The front page started to fill with popular brand logo redesigns. What’s worse, the site was being used as a gateway to Dribbble — <em>“anybody got an invite?”</em> — the only cure was zealous moderation and strongly worked “guidelines”. That didn’t go down well with some users.</p>\n<p>By <strong>February 2011</strong> I was tired. I stopped developing new features and I reined in my community engagement. At the time I naively believed that I had reached a self-sustaining level. Truthfully, I wanted to step back and focus on other projects. Aside from my own time LoveDsgn had cost very little, maybe $50 a month which I earned back several-fold in advertising revenue. Only now do I realise how expensive my own time was. In August 2011 LoveDsgn saw it’s first “official” birthday. I was too busy elsewhere to realise.</p>\n<p>LoveDsgn had lost its way. It had gone from an exciting prospect to yet another portfolio and inspiration gallery.</p>\n<h2 id=\"closing-time\">Closing Time</h2>\n<p>As I drifted away so did many once-dedicated members. It’s now nearing closing time, March 2012, and a realisation hits me. <em>I have not visited my own website in months</em>. I lost my desire to create. No amount of money would have encouraged me to grind on. The site is closing with just over 3000 members but I have over 2000 unanswered invitation requests in my inbox. I feel ashamed that I have let down a community but for all my concerns I have simply lost interest.</p>\n<p>For everyone who has used LoveDsgn I thank you. I am eternally grateful for your enthusiasm and dedication. I am sorry to close the website but I sincerely hope you have gained something from it. Be it inspiration, exposure, or simply enjoyment, I hope your time has been rewarded.</p>\n<p>When this month is out LoveDsgn will be gone.</p>\n<p>If there’s one thing I’ve learnt it’s the amazing opportunity that the Web presents as a platform for creativity and communication. My contribution may be disappearing in the form of LoveDsgn but I’ll still be around myself. If you have an idea that excites you then let it lead you.</p>\n<p>I never did like the missing vowels.</p>\n",
  "pageExcerpt": "Zero to 200,000 page views and 1000 members in less than 30 days. A brand new domain, no advertising.\nThat’s the sort of website launch our clients convince themselves of but never see. Nobody is talking about a website they’ve never heard of, nobody is searching for something they didn’t know existed. And yet I sat […]",
  "pageTitle": "The LoveDsgn Story – David Bushell – Web Design (UK)"
}