{
  "dateUnix": 1290456967000,
  "dateFormatted": "Monday 22 Nov 2010",
  "pageHeading": "The Visual Hierarchy",
  "pagePath": "/2010/11/22/the-visual-hierarchy/",
  "innerHTML": "<p>I’ve written a little web design article for <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.basecreative.eu/news/david-bushell/2010/11/22/the-visual-hierarchy\">Base Creative</a>.</p>\n<p>Here’s a snippet:</p>\n<blockquote>There is more to design than making things look attractive and truth be told that’s the easy part. In regards to web design the actual aesthetics of a website have very little bearing on its success. Style is superficial and becomes more subjective the heavier it is applied. […] a website user will make a split second reaction concerning their interest in a website. Therefore it is very wise to plan the structure of content. We must acknowledge what the user is looking for and make sure they see it.</blockquote>\n\n\n<p>Read the juicy parts of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.basecreative.eu/news/david-bushell/2010/11/22/the-visual-hierarchy\">The Visual Hierarchy</a> over on the Base Creative blog.</p>\n<h3 id=\"more-\">More!</h3>\n<p>I realise I don’t blog enough about website design! Should I be writing more? I’m rather pleased with this article and plan to turn it into a mini-series.</p>\n<p>I blog at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">Design Heroes</a> daily with interesting bookmarks. It has a small following on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://twitter.com/dsgnheroes\">twitter</a> and RSS but I continue it as a personal reference most importantly. Perhaps I could be doing more there? Sometimes I have a lot to say, other times I don’t.</p>\n<p>Anyway, hope some of you find my latest article useful!</p>\n",
  "pageExcerpt": "I’ve written a little web design article for Base Creative.\nHere’s a snippet:\nThere is more to design than making things look attractive and truth be told that’s the easy part. In regards to web design the actual aesthetics of a website have very little bearing on its success. Style is superficial and becomes more subjective the […]",
  "pageTitle": "The Visual Hierarchy – David Bushell – Web Design (UK)"
}