{
  "pagePath": "/blog/page/31/",
  "pageHeading": "Blog (page 31)",
  "excerpts": [
    {
      "id": "do-you-love-design",
      "title": "Do you Love Design?",
      "href": "/2010/09/02/do-you-love-design/",
      "body": "Before I get into the meaty part of this post I’d like to share this by Kyle Steed:\n\nHomer’s “Iliad” and “Odyssey” are epic. Beowulf is epic. The design you saw last night on Dribbble is not epic.\n\nFunny and true. I’m guilty of this myself, despite vowing a very long time ago never to write a […]",
      "date": 1283417680000
    },
    {
      "id": "web-fonts-just-got-interesting",
      "title": "Web Fonts just got interesting",
      "href": "/2010/08/19/web-fonts-just-got-interesting/",
      "body": "Around this time last year I was blogging about the then-new Typekit service and the news of Typotheque offering web licenses. I enquired as to when (or whether) the big font foundries would embrace the new world of web fonts. Or if they would sit back and watch the licensing nightmare unfold.\nWell, this month has […]",
      "date": 1282221600000
    },
    {
      "id": "summer-of-design-heroes",
      "title": "Summer of Design Heroes",
      "href": "/2010/08/12/summer-of-design-heroes/",
      "body": "The trouble with writing for two design blogs is that all the positive stuff tends to drift towards one of them (especially when it’s called Design Heroes).\nSo in an effort to balance the love I present a run down of all the brilliant creativity I’ve been blogging about over the last few months.\nFavourites of June\nHayaku: […]",
      "date": 1281647277000
    },
    {
      "id": "using-photoshop-like-a-real-web-design",
      "title": "Photoshop like a Real Designer",
      "href": "/2010/07/29/using-photoshop-like-a-real-web-design/",
      "body": "There has been a lot of debate recently in the web design social networks about whether a web designer should be able to code. I didn’t contribute much to the question because the answer is obviously yes, but I did think long and hard about my own practices.\nToday Smashing Magazine published a great article by […]",
      "date": 1280403884000
    },
    {
      "id": "stop-being-a-designer-from-hell",
      "title": "Stop being a Designer from Hell",
      "href": "/2010/07/17/stop-being-a-designer-from-hell/",
      "body": "There’s more to being a professional designer than pushing around pixels. I realise the truth behind this more and more every day. I’d estimate I spend somewhere between 10–25% of my week interacting with clients. This relationship dictates everything I do in my job. If I want to enjoy it and produce design to be […]",
      "date": 1279368508000
    },
    {
      "id": "on-design-blogging",
      "title": "On design blogging",
      "href": "/2010/07/12/on-design-blogging/",
      "body": "I’ve never liked the term “blogging”. It sounds a bit buzzy but I guess it’s becoming more acceptable these days. I still refuse to use the word “tweeting” in real life conversation without following it up with “I can’t believe I said that”. Ignoring the vocabulary blogging and tweeting have become a big part of […]",
      "date": 1278967233000
    },
    {
      "id": "morning-design-blogs",
      "title": "Morning design blogs",
      "href": "/2010/07/08/morning-design-blogs/",
      "body": "I’d like to say I spend my mornings sat peacefully in my slippers, a nice cup of tea to hand, the sun steadily rising in my kitchen window while I casually read the latest design blogs on my MacBook Pro. I would like to say that. But most mornings are a frantic bewildered rush to […]",
      "date": 1278621823000
    }
  ],
  "nextPage": "/blog/page/32/",
  "prevPage": "/blog/page/30/",
  "pageTitle": "Blog (page 31) – David Bushell – Web Design (UK)"
}