{
  "pagePath": "/blog/page/31/",
  "pageHeading": "Blog (page 31)",
  "excerpts": [
    {
      "id": "happy-new-ye-oh",
      "title": "Happy New Ye…oh",
      "href": "/2011/01/09/happy-new-ye-oh/",
      "body": "Ah, it’s the 9th already?\nI don’t do New Year’s resolutions, but I do like to look forward every now and then to consider all the amazing opportunities out there. 2011 is going to be all about pushing boundaries in life and work.\n(Not sure what that means in reality but I’ve plenty of time to find […]",
      "date": 1294616151000
    },
    {
      "id": "2010-in-design",
      "title": "2010 in Design",
      "href": "/2010/12/14/2010-in-design/",
      "body": "Funny how things never turn out how you expect them to.\nRewind a year and I find myself planning a big twenty-ten. After completing a very solid year in my pro web design career, 2010 was suppose to be all about exploring past passions in art and crafts. Replacing the mouse with a paint brush and […]",
      "date": 1292365598000
    },
    {
      "id": "walking-on-air",
      "title": "Walking on Air",
      "href": "/2010/12/01/walking-on-air/",
      "body": "I’m in a genuinely positive mood this evening, partially because dbushell.com survived another automatic WordPress update* but mainly because my MacBook Air arrived today!\nSince this is the first laptop I have ever owned I’m not going to write a comprehensive product review but I’d like to point out a few things that are brilliant:\n\nThe multi-touch pad works amazingly […]",
      "date": 1291245027000
    },
    {
      "id": "the-visual-hierarchy",
      "title": "The Visual Hierarchy",
      "href": "/2010/11/22/the-visual-hierarchy/",
      "body": "I’ve written a little web design article for Base Creative.\nHere’s a snippet:\n\nThere is more to design than making things look attractive and truth be told that’s the easy part. In regards to web design the actual aesthetics of a website have very little bearing on its success. Style is superficial and becomes more subjective the heavier […]",
      "date": 1290456967000
    },
    {
      "id": "when-free-fonts-arent-free",
      "title": "When Free Fonts Aren’t Free",
      "href": "/2010/11/18/when-free-fonts-arent-free/",
      "body": "Font Squirrel is one of the best online resources for finding high quality (and almost free) fonts. I do rate it very highly, and @font-face generator is the work of magic elves in my opinion.\n\n“Font Squirrel is your best resource for FREE, hand-picked, high-quality, commercial-use fonts. Even if that means we send you elsewhere to […]",
      "date": 1290090331000
    },
    {
      "id": "the-typographic-gauntlet",
      "title": "The Typographic Gauntlet",
      "href": "/2010/11/07/the-typographic-gauntlet/",
      "body": "I love typography!\nTo celebrate my love I have set myself a new challenge: design 6 fonts in 12 months.\nMy last “creative challenge” was to fold 1000 origami cranes before the end of 2010. I think I’ve done about 100 so far (having folded nothing since March). Some may say I set the bar too high on that […]",
      "date": 1289173153000
    },
    {
      "id": "book-review-just-my-type",
      "title": "Book Review: Just My Type",
      "href": "/2010/10/25/book-review-just-my-type/",
      "body": "If you’ve been following my Design Heroes blog you’ll know I’ve recently been impressed with two (1, 2) different excerpts from Simon Garfield’s new book Just My Type.\nSo much so that I purchased and read it as fast as humanly possible.\nThe book starts with a chapter on Comic Sans, illustrating the significant impact a font can have. It […]",
      "date": 1288039937000
    }
  ],
  "nextPage": "/blog/page/32/",
  "prevPage": "/blog/page/30/",
  "pageTitle": "Blog (page 31) – David Bushell – Web Design (UK)"
}