{
  "dateUnix": 1579082400000,
  "dateFormatted": "Wednesday 15 Jan 2020",
  "pageHeading": "Netlify: First Impressions",
  "pagePath": "/2020/01/15/netlify-first-impressions/",
  "innerHTML": "<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.netlify.com/\">Netlify</a> is hot right now. It’s been hot for a while. It’s on my list of tech I pretend to know when people ask. I assume it handles static site hosting and deployment.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/2020/netlify-logo.png\" alt=\"Netlify logo\"></p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://jamstack.org/\">JAMstack</a> is a popular/confusing term covering static sites and the new tech surrounding them. I’ve long adhered to such a philosophy for <a href=\"/2014/07/09/how-i-built-a-static-site-generator/\">personal projects</a> but stuck to WordPress-like solutions for client work. The necessity of a <abbr title=\"Content Management System\">CMS</abbr> being the main factor, but has “JAMstack” caught up?</p>\n<p>I need to catch up for sure. This week I’ve been learning Netlify.</p>\n<h2 id=\"trialing-netlify\">Trialing Netlify</h2>\n<p>I had some issues with the initial Netlify sign-up process. I had to switch browsers to get in. Not a good sign for a one-stop shop for ‘modern websites’. Maybe a temporary bug, or unresponsive server? The Twitter community came to my rescue. I was able to use Firefox eventually, after I had authenticated with GitHub.</p>\n<p>For this trial I used one of my existing <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/dbushell-react-example\">React projects</a>. It’s your everyday counting app that I over-engineered to experiment with React Hooks, Redux, and Routing.</p>\n<p>Let’s see how easy it is to ship on Netlify.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/2020/react-example-counter.png\" alt=\"React example (counter app)\"></p>\n<p>The build process for this includes:</p>\n<ol>\n<li>Webpack to bundle React code</li>\n<li>A simple<sup>†</sup> node script to pre-render three pages</li>\n</ol>\n<p class=\"p--small u-dim\"><sup>†</sup> 50 lines of code and 50 megabytes of node modules.</p>\n<p>All I needed to do after connecting Netlify to my Git repository was to configure two deployment options for the project:</p>\n<ul>\n<li>Build command: <code>npm run build</code></li>\n<li>Publish directory: <code>public</code></li>\n</ul>\n<p>Both I’d already set up to work in my local environment.</p>\n<p>No additional environment settings were required. Presumably dependencies and config in <code>packages.json</code> are used. By default Netlify automatically publishes on every commit to the master branch.</p>\n<p>The build and deploy reportedly took around 30 seconds. That’d give me 600 updates per month (on the free plan). That’s like 20 per day. I’d be happy with just one, so it’s nice to have some leeway to correct 19 spelling mistakes.</p>\n<p>For this app I could just run the build locally and commit the <code>public</code> directory for deployment. Even just drag &amp; drop the directory and avoid Git integration entirely. But that wouldn’t be much of a trial run (nor fun).</p>\n<p>The free Netlify plan allows 100GB of bandwidth. I’d be tempted to stick Cloudflare in front to soak up some of that. Even if it is a little redundant.</p>\n<p>Except for the initial troubles, Netlify works as expected and was quick too. I can see myself using it as a temporary solution. The CLI makes dev deployment even quicker. For live sites I rarely get involved in hosting and deployment so it’s hard to comment on the pricing plans. Some of the add-on prices do seem rather expensive (shrug emoji). I’ll report back if I ever test those features.</p>\n<p>Overall strong first impressions.</p>\n<p>Netlify rating: 3.75 <code>U+2B50</code> out of 5.</p>\n<h2 id=\"bonus-impressions-on-netlify-cms\">Bonus Impressions on Netlify CMS</h2>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.netlifycms.org/\">Netlify CMS</a> is a headless, platform agnostic CMS that can integrate with static site generators like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.gatsbyjs.org/\">Gatsby</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://jekyllrb.com/\">Jekyll</a>. Or in my case, a <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/dbushell/dbushell-react-example/blob/master/src/render.jsx\">ghetto render script</a>.</p>\n<p>Unsurprisingly, it’s an obvious choice for Netlify sites due to its close integration (for identity authentication in particular).</p>\n<p>The CMS is configured through a <code>config.yml</code> to define data structure and file location. Then following some authentication you’re presented with a front-end UI to edit said data.</p>\n<p>I added a couple of fields for my template:</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/2020/netlify-cms.png\" alt=\"Netlify CMS editing\"></p>\n<p>The editor experience is functional. Not much to say there. You get a lot of form fields based on your data. In the background it commits new changes to the Git repo and redeploys to Netlify. A downside to the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://jamstack.org/\">JAMstack</a> approach is that it’s a bit slow to deploy changes.</p>\n<p>I deliver a lot of WordPress sites. From an editing perspective those clients would find Netlify CMS rather lacklustre in comparison. However, the pros and cons of each platform go much deeper. I’m not even sure how I’d define “client-friendly”. Too many factors. I can imagine scenarios where I’d consider Netlify CMS.</p>\n<p>Time well spent and another tool in the belt.</p>\n<style>\n.b-post [src$=\"netlify-logo.png\"] {\n  width: 600px;\n}\n.b-post [src$=\"netlify-cms.png\"] {\n  width: 600px;\n}\n</style>\n",
  "pageExcerpt": "Netlify is hot right now. It’s been hot for a while. It’s on my list of tech I pretend to know when people ask. I assume it handles static site hosting and deployment.\n\nJAMstack is a popular/confusing term covering static sites and the new tech surrounding them. I’ve long adhered to such a philosophy for personal […]",
  "pageDesc": "The one where I stop pretending to know Netlify and learn it.",
  "pageTitle": "Netlify: First Impressions – David Bushell – Web Design (UK)"
}