{
  "dateUnix": 1282221600000,
  "dateFormatted": "Thursday 19 Aug 2010",
  "pageHeading": "Web Fonts just got interesting",
  "pagePath": "/2010/08/19/web-fonts-just-got-interesting/",
  "innerHTML": "<p>Around this time last year I was blogging about the then-new <a href=\"/2009/09/19/typekit/\">Typekit service</a> and the news of <a href=\"/2009/10/20/typotheque-offer-web-licenses/\">Typotheque</a> offering web licenses. I enquired as to when (or whether) the big font foundries would embrace the new world of web fonts. Or if they would sit back and watch the licensing nightmare unfold.</p>\n<p>Well, this month has answered a few of those questions!</p>\n<p>On August 16th <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://blog.typekit.com/2010/08/16/typekit-and-adobe/\">Adobe announce</a> they will be partnering with <strong>Typekit to offer Adobe fonts</strong> through the service. This includes the not too shabby <em>Adobe Garamond Pro</em>, the legendary <em>Myriad</em> and the always usable <em>News Gothic</em>, and <em>Trajan</em> (<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.flickr.com/groups/trajanfilmposter/\">Hollywood</a> will love that). With the portfolio size of Adobe I’m genuinely surprised they haven’t launched their own priority web font service. I imagine they’re testing the water, once the money starts rolling I predict this is exactly what they’ll do.</p>\n<p>Yesterday brought with it the announcement of  <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.webtype.com/\">WebType.com</a> - another web font service backed by <strong>Font Bureau</strong> and <strong>Ascender Corp</strong>.</p>\n<blockquote><p>Led by Font Bureau and Ascender Corp., Webtype.com introduces a new range of web fonts optimized for high quality text rendering across browsers. Webtype.com launches an innovative web font service to improve web typography.</p></blockquote>\n\n\n<p>Inspired stuff, and it packs a hefty fee. Unlike Typekit you’re not buying access to a library of fonts - you’re paying for just one. With <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://typekit.com/plans\">Typekit</a> it’s impossible to pay more than $99 a year (for full library access and unlimited font/site usage). With Webtype that won’t even buy you <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.webtype.com/font/news-gothic-regular/\">News Gothic Regular</a> on their top license “Business Plan”.</p>\n<p>Wait…didn’t Adobe just announce <em>News Gothic</em> as one of their flagship fonts on Typekit?</p>\n<p>Regardless of who is selling what, the big question is now on price. If Webtype is successful how long do you think Adobe will remain loyal to Typekit?</p>\n<p>A few months ago Google launched the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://code.google.com/apis/webfonts/\">Google Font API</a> providing a great selection of embeddable _free _fonts. Of course, if the font is free you can go ahead an embed it directly. Though using a content delivery network like Google provides can have an advantage.</p>\n<p>If free is not your flavour, you could also choose the moderately priced <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://fontdeck.com\">FontDeck</a> which has a curious selection of smaller foundries who seem quite content to band together selling yearly licenses on a per-font basis, in a similar manner to Webtype.</p>\n<p>All this variety is to be excepted with a brand new market. Time will tell which model will be most successful (I’m guessing this cheapest).</p>\n<p>The crazy thing with all these web font services is that you’re only buying access to a font for <em>one year</em>. If you don’t cough up more cash the next year they will switch it off and you’re left with _Arial _or _Georgia _as your fall-back.</p>\n<p>To be honest with the exception of possibly Typekit these pricing plans are ridiculous. With a few websites in your portfolio you’ll be paying hundreds of pounds annually. That’s ludicrous if you consider many of these font designs are in public domain. That’s why both Typekit and Webtype can offer <em>News Gothic</em> and why there are a million and one flavours of _Garamond _floating around. I’m all for paying designers a fair price, but when they <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Garamond\">died in 1561</a>…</p>\n",
  "pageExcerpt": "Around this time last year I was blogging about the then-new Typekit service and the news of Typotheque offering web licenses. I enquired as to when (or whether) the big font foundries would embrace the new world of web fonts. Or if they would sit back and watch the licensing nightmare unfold.\nWell, this month has […]",
  "pageTitle": "Web Fonts just got interesting – David Bushell – Web Design (UK)"
}