{
  "dateUnix": 1277844775000,
  "dateFormatted": "Tuesday 29 Jun 2010",
  "pageHeading": "Do you need a JavaScript library?",
  "pagePath": "/2010/06/29/do-you-need-a-javascript-library/",
  "innerHTML": "<p>Over the last few years JavaScript has gone through a renaissance.</p>\n<p>From a buggy unpredictable add-on, to a mature <em>superfast</em> piece of kit, JavaScript is an integral component to any website. To prove this I’d present libraries like <a href=\"http://jquery.com/\">jQuery</a>, <a href=\"http://www.modernizr.com/\">Modernizr</a> and <a href=\"http://raphaeljs.com/\">Raphaël</a> (to name a few of my favourites).</p>\n<p>But the question of the day is: <strong>do you actually need a JavaScript library?</strong></p>\n<p>Libraries like jQuery are incredible tools but they can add significant weight to the page. They are so far abstracted from the core javascript that makes them it’s very easy to grind the processor to death with the simplest of tasks. Of course, the benefit of ease-of-use and fast implementation can out-weight the negatives, but <strong>learning jQuery is not the same as learning JavaScript</strong>.</p>\n<p>I’ve seen and development myself many websites that have one single JavaScript feature. For such a site I’ve often chose to link in jQuery and then a plugin like <a href=\"http://nivo.dev7studios.com/\">Nivo Slider</a> – an extra 7kb. I’ve always felt this approach was lazy. When I was presented with the same task yesterday I wrote my own custom photo rotating code taking up about 10 lines (and jQuery). I felt significantly happier after building the site, I don’t like excess!</p>\n<p>There is an element of “reinventing the wheel” there, but when the wheel fits a tractor and I’m on a push bike I’m happy with that.</p>\n<p>On another site I included the Modernizr library so that I could detect the <a href=\"http://diveintohtml5.org/forms.html\">HTML5 placeholder attribute</a> and replicate it with jQuery if it didn’t exist in older browsers. When I came to build the new version of this site (dbushell.com) I wanted to do the same thing but felt guilty bloating it out with another JavaScript library. Instead of throwing Modernizr into the mix without a care I decided to dive inside and see how it actually worked. After a few minutes I reduced my code requirements to a few lines:</p>\n<p>var f = document.createElement(‘input’);\nvar placeholder = !!(‘placeholder’ in f);\nif (!placeholder) {\n<em>/<em> jQuery to replicate placeholder attribute </em>/</em>\n}</p>\n<p>Modernizr is an absolutely outstanding piece of JavaScript but it’s also a perfect example of one you’ll almost always never need in its entirety. By hacking around inside you can make huge improvements to the size and speed of your website <em>and</em> your own knowledge of JavaScript. The majority of Modernizr can be reduced down to tiny chunks for each feature (in fact version 2.0 looks like it will be a module based JS library).</p>\n<p>So next time you need a library or plugin think twice. With a little know how you can achieve the same thing with significantly less code and no excess waste.</p>\n<p class=\"medium\">Ironically it was Paul Irish (who co-created Modernizr) that gave me the idea of looking deeper at JavaScript libraries from his excellent blog post and video <a href=\"http://paulirish.com/2010/10-things-i-learned-from-the-jquery-source/\">10 Things I Learned from the jQuery Source</a>.</p>\n\n",
  "pageExcerpt": "Over the last few years JavaScript has gone through a renaissance.\nFrom a buggy unpredictable add-on, to a mature superfast piece of kit, JavaScript is an integral component to any website. To prove this I’d present libraries like jQuery, Modernizr and Raphaël (to name a few of my favourites).\nBut the question of the day is: do […]",
  "pageTitle": "Do you need a JavaScript library? – David Bushell – Web Design (UK)"
}