{
  "dateUnix": 1283417680000,
  "dateFormatted": "Thursday 2 Sep 2010",
  "pageHeading": "Do you Love Design?",
  "pagePath": "/2010/09/02/do-you-love-design/",
  "innerHTML": "<p>Before I get into the meaty part of this post I’d like to share this by <a href=\"http://kylesteed.com/2010/epic-shmepic/\">Kyle Steed</a>:</p>\n<blockquote><p>Homer’s “Iliad” and “Odyssey” are epic. Beowulf is epic. The design you saw last night on Dribbble is not epic.</p></blockquote>\n\n\n<p>Funny and true. I’m guilty of this myself, despite vowing a _very <em>long time ago never to write a blog titled </em>“30 Incredibly Awesome Epic Web Designs”_ or anything remotely similar. I only bring this up because I may need to justify myself in a few minutes…</p>\n<p>Anyway to the main feature.</p>\n<p>When I’ve not been at work, I’ve been ‘hard at work’ designing and building a brand new website called <a href=\"http://lovedsgn.com\">LoveDsgn</a>. Here’s the elevator pitch:</p>\n<blockquote><p>LoveDsgn is a new social website for designers, typographers, all kinds of creative people. It’s a platform for sharing, discussing and improving your creative output.<p></blockquote>\n\n\n<p>What makes this different from other ‘social portfolio’ websites is that LoveDsgn actively encourages constructive feedback. The focus is on typography and writing on creativity (you can showcase your articles too). A large 640x360 canvas is available to display work with each post. Ultimately the site is curated by the members and they’ll dictate the content and features to come.</p>\n<p>It’s been a real slog finding time to get LoveDsgn ready to launch but it’s here now! Thanks to the 300+ community that have helped so far. They’re the people that will make this website a great place to visit, not me.</p>\n<p>Returning to the article linked above I feel I need to justify using the word “Love”. For designers like myself and those posting on <a href=\"http://lovedsgn.com\">LoveDsgn</a> this stuff is our day job _and _our hobby. Design is not a 9-5 job. It’s impossible to do if you’re not incredibly passionate and obsessed about everything related to the subject. Therefore the word “love” is rather accurate in my opinion.</p>\n<p>As for the trendy vowel removal in “Dsgn”, well that was for brevity’s sake (and I already owned the domain). We’re also using the domain <a href=\"http://xn--dsgn-4u3b.ws/\">http://♥dsgn.ws</a> for short URLs. I think that’s pretty cool.</p>\n<p>The design that has been posted on LoveDsgn so far has been outstanding (and I feel justified to use that word too). I’m really excited about the way the community is shaping itself, so if you haven’t visited yet, check out <a href=\"http://lovedsgn.com\">lovedsgn.com</a>.</p>\n",
  "pageExcerpt": "Before I get into the meaty part of this post I’d like to share this by Kyle Steed:\nHomer’s “Iliad” and “Odyssey” are epic. Beowulf is epic. The design you saw last night on Dribbble is not epic.\n\n\nFunny and true. I’m guilty of this myself, despite vowing a _very long time ago never to write a […]",
  "pageTitle": "Do you Love Design? – David Bushell – Web Design (UK)"
}