{
  "dateUnix": 1252411962000,
  "dateFormatted": "Tuesday 8 Sep 2009",
  "pageHeading": "Verdana is so hot right now",
  "pagePath": "/2009/09/08/verdana-is-so-hot-right-now/",
  "innerHTML": "<p>Two of the “core fonts for the web” are to be updated! What impact will this have on website design?</p>\n<p>After the earthshattering announcement last month that <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.underconsideration.com/brandnew/archives/verdanagate.php\">IKEA will use Verdana</a> both on the web and <em>in print</em> (I spat coffee out reading that), today we hear that Verdana and Georgia are getting a face lift.</p>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.ascendercorp.com/pr/2009-09-08/\">Announced by The Ascender, Carter &amp; Cone and Font Bureau</a> (that’s a lot of management right there) the updates will include new weights, character sets, extensions to kerning, and OpenType features (probably fancy stuff like ligatures and hinting for rasterisation).</p>\n<p>This is really interesting. Verdana isn’t often praised for its aesthetic qualities and there’s nothing very exciting about Georgia either for that matter. If it wasn’t for the snail-like movement on the web/typography front I’m sure these fonts would be resigned to the archives long ago. The fact is Verdana was a great achievement in tackling the problems of low resolution. Nowadays computer monitors are packing a few more pixels-per-inch, but the problem still exists - so don’t pull out Garamond any time soon. For this reason I see nothing wrong with increasing the options for screen design (<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.ascendercorp.com/catalog/microsoft/clear-type-font-collection/\">Microsoft released</a> some excellent new fonts a few years back too).</p>\n<h3 id=\"a-new-problem\">A new problem?</h3>\n<p>The problem is until CSS3 and @font-face are universally implemented by all browsers and adopted by 99% of Internet users we’re still stuck with the same fonts like Verdana for web design. Progress is moving slowly. I can see all major browsers supporting @font-face in a year or two, but widespread adoption of the newest browsers will take a lot, lot longer.</p>\n<p>When Verdana &amp; Georgia 2.0 are released in 2010 we are still going to be designing with the older versions. So ideally they will be packaged as “Verdana Pro” etc. If Microsoft (or Apple) license the new fonts to replace the old versions in their latest OS releases we’re going to get even more inconsistency in text rendering on the web, albeit a minor one.</p>\n<p>The bottom line is I’m sick of using the “core fonts for the web”. So don’t let this announcement encourage you to use Verdana more often!</p>\n<p>But despite all the hate I’ve always have a soft spot for Verdana and Georgia so I’ll take these updates as a celebration of their legacy in digital typography. It seems funny to say “legacy” when I’ll be using them again but it really is time for web typography to move on. As soon as we get CSS3 and @font-face I’m going to break down in tears!</p>\n",
  "pageExcerpt": "Two of the “core fonts for the web” are to be updated! What impact will this have on website design?\nAfter the earthshattering announcement last month that IKEA will use Verdana both on the web and in print (I spat coffee out reading that), today we hear that Verdana and Georgia are getting a face lift.\nAnnounced […]",
  "pageTitle": "Verdana is so hot right now – David Bushell – Web Design (UK)"
}