{
  "pagePath": "/blog/page/38/",
  "pageHeading": "Blog (page 38)",
  "excerpts": [
    {
      "id": "graphic-design-referenced",
      "title": "Graphic Design Referenced",
      "href": "/2009/10/11/graphic-design-referenced/",
      "body": "If you’ve never heard of Bryony Gomez-Palacio and Armin Vit they run the design network Under Construction and are responsible for one of my all time favourite design blogs, Brand New. So when I heard they were releasing a new book “Graphic Design Referenced“ I knew I would be buying it immediately.\n\nGraphic Design, Referenced is a […]",
      "date": 1255273290000
    },
    {
      "id": "most-amazing-top-2",
      "title": "Most Amazing Top 2",
      "href": "/2009/10/07/most-amazing-top-2/",
      "body": "I’m subscribed to ~50-60 RSS feeds in Google Reader, most of them are design related. I also follow hundreds of design related people (and 1 meerkat) on Twitter. I like being up-to-date. I recently started the website Design Heroes so I could bookmark the best of the best. The rules for Design Heroes are decidedly […]",
      "date": 1254922134000
    },
    {
      "id": "introducing-design-heroes",
      "title": "Introducing Design Heroes",
      "href": "/2009/10/01/introducing-design-heroes/",
      "body": "Hero - he-ro [heer-oh] - noun, a man of distinguished courage or ability, admired for his brave deeds and noble qualities.\nI may be using the word loosely here - it’s certainly not just for men.\nI’ve created a new website called Design Heroes. For three reasons:\n\nI had the domain and wasn’t doing anything with it.\nI need somewhere […]",
      "date": 1254400790000
    },
    {
      "id": "its-a-ui-thing",
      "title": "It’s a UI thing",
      "href": "/2009/09/23/its-a-ui-thing/",
      "body": "If you were to stakeout my desk you will hear me shout out expletives 4 or 5 times a day. And if something has really thrown me, I’ll tweet about it.\nI am (of course) refering to bad user interface design.\nI’m an avid subscriber to the blog Adobe UI Gripes because it makes me feel slighty […]",
      "date": 1253708328000
    },
    {
      "id": "typekit",
      "title": "Playing around with Typekit",
      "href": "/2009/09/19/typekit/",
      "body": "Typekit is an innovative subscription service that gives web designers access to a large collection of embeddable fonts.\nI was lucky enough to be invited to try out Typekit which is pretty cool because it’s still “invitation only”. A subscription to Typekit gives you access to their growing font library for use on your websites. Fonts […]",
      "date": 1253383302000
    },
    {
      "id": "verdana-is-so-hot-right-now",
      "title": "Verdana is so hot right now",
      "href": "/2009/09/08/verdana-is-so-hot-right-now/",
      "body": "Two of the “core fonts for the web” are to be updated! What impact will this have on website design?\nAfter the earthshattering announcement last month that IKEA will use Verdana both on the web and in print (I spat coffee out reading that), today we hear that Verdana and Georgia are getting a face lift.\nAnnounced […]",
      "date": 1252411962000
    },
    {
      "id": "bad-design-wins-awards",
      "title": "Bad Design Wins Awards",
      "href": "/2009/09/08/bad-design-wins-awards/",
      "body": "On accountability in design, and have you ever wondered why you’ve never seen half of those adverts that win the design and advertising awards?\nThat’s because agencies create them specifically to win awards. They get run once in obscure  magazines or TV channels at 5am and they qualify as “real” advertisements. Some of them aren’t even […]",
      "date": 1252411141000
    }
  ],
  "nextPage": "/blog/page/39/",
  "prevPage": "/blog/page/37/",
  "pageTitle": "Blog (page 38) – David Bushell – Web Design (UK)"
}