{
  "pagePath": "/blog/page/9/",
  "pageHeading": "Blog (page 9)",
  "excerpts": [
    {
      "id": "introducing-tales",
      "title": "Introducing Tales",
      "href": "/2014/02/17/introducing-tales/",
      "body": "For the last few weeks I’ve been working on a little project that I’m excited to announce. That project is called Tales and it’s available today.\n\nTales is a responsive WordPress theme tailored for a beautiful reading experience. Its strength and design principle can be summed up in one word; simplicity. Visit the Tales Demo website to see […]",
      "date": 1392627469000
    },
    {
      "id": "simple-grids-with-css-multi-column-layout",
      "title": "Simple Grids with CSS Multi-Column Layout",
      "href": "/2014/02/03/simple-grids-with-css-multi-column-layout/",
      "body": "Last week I began researching CSS layout — what’s achievable with the various spec modules — and grid systems (the myriad of solutions from 960gs to Zen Grids). My notes have quickly grown to thesis-level — I do eventually plan to publish something — but for now here’s a nice example demonstrating what is sure to […]",
      "date": 1391433532000
    },
    {
      "id": "a-year-for-clients-and-side-projects",
      "title": "A Year for Clients and Side Projects",
      "href": "/2014/01/30/a-year-for-clients-and-side-projects/",
      "body": "It’s been a slow start to the year — my internet access is peaking at 15kb/s for the time being — so if you’re reading this, I’ve got through!\nWorking freelance for most of last year was very rewarding and I’m glad I made the jump. I want 2014 to be a year for both perfect […]",
      "date": 1391070071000
    },
    {
      "id": "building-for-perch-cms",
      "title": "Building for Perch CMS",
      "href": "/2014/01/10/building-for-perch-cms/",
      "body": "Perch CMS has been on my radar for a few years now and given the praise I continue to see I figured it was time to learn the ins and outs of Perch development.\n\nPerch is a very good CMS for both development ease and content editing. After spending a week with Perch I feel confident it […]",
      "date": 1389343076000
    },
    {
      "id": "thanks-for-a-great-year",
      "title": "Thanks for a Great Year!",
      "href": "/2013/12/18/thanks-for-a-great-year/",
      "body": "2013 has been a fun year, one of the most eventful of my career. Usually I like to round up with a review of my work but with several projects launching in January, I’ll hold off until then. This is a short thank you to my clients and fellow web workers who have supported me throughout […]",
      "date": 1387382150000
    },
    {
      "id": "what-is-wrong-with-this-message",
      "title": "What is wrong with this message?",
      "href": "/2013/11/14/what-is-wrong-with-this-message/",
      "body": "Nobody said microcopy was easy…\nWhile catching up with my Twitter feed I follow a link to Google+ — appears to show signs of life within the tech community — and I’m greeted with this wonderful message:\n\n“Your profile has been suspended because it impersonates someone.”\nA straight up accusation of potentially illegal acts. There’s no ambiguity, I’m […]",
      "date": 1384434839000
    },
    {
      "id": "form-label-design",
      "title": "Form Label Design",
      "href": "/2013/11/08/form-label-design/",
      "body": "Web forms are often a tedious experience. There’s a lot to be said for keeping questions to a minimum. Do I really need to enter my name across three fields, can’t you just call me “Dave”?\nTo save space and reduce visual noise it’s become quite common to repurpose HTML placeholders. But as we should all know: Placeholder […]",
      "date": 1383909303000
    }
  ],
  "nextPage": "/blog/page/10/",
  "prevPage": "/blog/page/8/",
  "pageTitle": "Blog (page 9) – David Bushell – Web Design (UK)"
}