{
  "pagePath": "/blog/page/4/",
  "pageHeading": "Blog (page 4)",
  "excerpts": [
    {
      "id": "building-a-wordpress-theme",
      "title": "Building a WordPress Theme",
      "href": "/2016/07/14/building-a-wordpress-theme/",
      "body": "I was delighted when Base Creative asked me to help build a beautifully designed website on WordPress. It’s always a joy to work with Base Creative knowing that my role is made easier by the care and attention they deliver.\n\nIn this review I’ll showcase a few of the defining techniques and challenges that made this […]",
      "date": 1468490400000
    },
    {
      "id": "new-origins",
      "title": "New Origins",
      "href": "/2016/07/12/new-origins/",
      "body": "Greetings! It’s been a while, hasn’t it? The last few months were busy for me. That’s a good thing I suppose, I certainly need to earn a living.\nThe only real downside of plentiful client work is the lack of time for my own projects. One of those, codename: “Origin”, is my personal front-end starter kit. […]",
      "date": 1468317600000
    },
    {
      "id": "css-only-responsive-tables",
      "title": "CSS only Responsive Tables",
      "href": "/2016/03/04/css-only-responsive-tables/",
      "body": "Four years ago I shared an idea to make tabular data responsive. Browser support was experimental and the workarounds were extremely hacky. I revisited the technique this week, cleaned it up, and I am pleased to say all modern browsers work perfectly.\nSee the full demo on CodePen\n\n\n\nHere’s what basic overflow looks like:\n\nAnd if you want […]",
      "date": 1457085600000
    },
    {
      "id": "be-careful-with-your-viewbox",
      "title": "Be careful with your viewBox",
      "href": "/2016/03/01/be-careful-with-your-viewbox/",
      "body": "In Sara Soueidan’s article: SVG Style Inheritance and the ‘Flash of Unstyled SVG’, Sara explains the importance of having width, height, and viewBox attributes on SVG elements. This reminded me of two issues I ran into last week building my new design.\nI have an SVG sprite for social icons:\n\n  \n  .svg-icon  { […]",
      "date": 1456826400000
    },
    {
      "id": "a-bit-of-a-new-look",
      "title": "A Bit of a New Look",
      "href": "/2016/02/29/a-bit-of-a-new-look/",
      "body": "I redesigned my website!\nThis iteration has taken longer than usual because the visual changes are much more dramatic. I’m really pleased with the results:\n\nIt’s been two years since I last updated the design. That is a record because it’s usually an annual tradition. Past updates include: 2014, 2013, 2012, and 2011. Last year I improved […]",
      "date": 1456740000000
    },
    {
      "id": "css-framework-for-partsgiant",
      "title": "CSS Framework for PartsGiant",
      "href": "/2016/01/04/css-framework-for-partsgiant/",
      "body": "PartsGiant is a soon to launch e-commerce store based in Michigan, USA.\nI was hired to build the PartsGiant front-end CSS framework and HTML templates. The work would be done in stages throughout the year. This required flexibility on my part and scalability in the codebase I developed.\nI’ve always championed the idea of maintainable, future-proof coding […]",
      "date": 1451901600000
    },
    {
      "id": "2015-in-review",
      "title": "My Year in Review",
      "href": "/2015/12/30/2015-in-review/",
      "body": "All considered, 2015 has been a good year!\nMy highlight for sure was moving into my new flat. The whole searching, buying, and decorating process took way longer than I imagined. Because of this I didn’t take on as many large projects, but I did manage to find enough freelance work to keep me going.\nJanuary\nWhat better […]",
      "date": 1451469600000
    }
  ],
  "nextPage": "/blog/page/5/",
  "prevPage": "/blog/page/3/",
  "pageTitle": "Blog (page 4) – David Bushell – Web Design (UK)"
}