{
  "pagePath": "/blog/page/4/",
  "pageHeading": "Blog (page 4)",
  "excerpts": [
    {
      "id": "react-as-a-static-site-generator",
      "title": "React as a Static Site Generator",
      "href": "/2017/02/13/react-as-a-static-site-generator/",
      "body": "Two years ago I converted my website from WordPress to a static build process. It has served me well but the final process was rather messy. Hacks and plumbing to get Metalsmith plugins working my way didn’t helped.\nTime for a new project!\nAbstract: rebuild my website using React as the template engine for a bespoke static […]",
      "date": 1486980000000
    },
    {
      "id": "resolving-javascript-promises-sequentially-without-nesting",
      "title": "Working with Promises",
      "href": "/2016/12/16/resolving-javascript-promises-sequentially-without-nesting/",
      "body": "JavaScript promises are a handy way to write asynchronous code. It’s common to have multiple promises resolve in parallel or series.\nLet’s say you have several functions that return a promise:\nfunction act1() {\n  return new Promise((resolve, reject) => {\n    // do something that might reject...\n    resolve();\n  });\n}\nIt’s easy […]",
      "date": 1481882400000
    },
    {
      "id": "my-thoughts-on-react",
      "title": "My thoughts on React",
      "href": "/2016/12/02/my-thoughts-on-react/",
      "body": "I’ve been playing with React for some time now. React is:\n\n“A JavaScript library for building user interfaces”.\n\nUnlike other libraries something about React just clicked with me. Back in October a client project came along that presented a golden opportunity to develop a web app. I decided to use React, and I now consider myself comfortable […]",
      "date": 1480672800000
    },
    {
      "id": "building-a-shopify-theme",
      "title": "Building a Shopify Theme",
      "href": "/2016/10/10/building-a-shopify-theme/",
      "body": "Shopify is an ecommerce platform that offers themeable store fronts online. I worked alongside the wonderful folks at Studio Tangerine to develop a Shopify theme. I’ve documented interesting aspects of the process below.\n\nGetting started\nIf you’re familiar with my workflow it will be no surprised that I first translated the design into static HTML &amp; CSS […]",
      "date": 1476093600000
    },
    {
      "id": "colour-accessibility",
      "title": "Colour Accessibility",
      "href": "/2016/09/01/colour-accessibility/",
      "body": "“Accessiblity” isn’t a scary word but many web folks shy away from it. Perhaps because the W3C guidelines are a little scary. The reality is website accessibility affects us all. Not just those of us who cross the threshold into a medically diagnosed condition.\n“I want to see like the colour blind” is a Chrome plugin […]",
      "date": 1472724000000
    },
    {
      "id": "building-a-wordpress-theme",
      "title": "Building a WordPress Theme",
      "href": "/2016/07/14/building-a-wordpress-theme/",
      "body": "I was delighted when Base Creative asked me to help build a beautifully designed website on WordPress. It’s always a joy to work with Base Creative knowing that my role is made easier by the care and attention they deliver.\n\nIn this review I’ll showcase a few of the defining techniques and challenges that made this […]",
      "date": 1468490400000
    },
    {
      "id": "new-origins",
      "title": "New Origins",
      "href": "/2016/07/12/new-origins/",
      "body": "Greetings! It’s been a while, hasn’t it? The last few months were busy for me. That’s a good thing I suppose, I certainly need to earn a living.\nThe only real downside of plentiful client work is the lack of time for my own projects. One of those, codename: “Origin”, is my personal front-end starter kit. […]",
      "date": 1468317600000
    }
  ],
  "nextPage": "/blog/page/5/",
  "prevPage": "/blog/page/3/",
  "pageTitle": "Blog (page 4) – David Bushell – Web Design (UK)"
}