{
  "pagePath": "/blog/page/17/",
  "pageHeading": "Blog (page 17)",
  "excerpts": [
    {
      "id": "the-restriction-of-type",
      "title": "The Restriction of Type",
      "href": "/2012/05/26/the-restriction-of-type/",
      "body": "Responsive website design is incredibly difficult to get right. It’s often said that designing for content is the key to success.\nIn the screenshots below you can see the websites of Elliot Jay Stocks, Jeffrey Zeldman, and Information Architects, all of which have had a redesign/realign this year with content as their priority and thus typography […]",
      "date": 1338023028000
    },
    {
      "id": "javascript-bookmarklets",
      "title": "JavaScript Bookmarklets",
      "href": "/2012/05/22/javascript-bookmarklets/",
      "body": "I love a good JavaScript bookmarklet.\nThey’re fun to play with and a great way to hack around on a live website with new code without affecting anyone else’s experience. They can also become part of your service; think Readability’s ‘Read Now’ or Pinterest’s ‘Pin it!’.\nA bookmarklet begins with the following shell:\njavascript:(function(){\n    // […]",
      "date": 1337674216000
    },
    {
      "id": "pageshift-removing-the-refresh",
      "title": "Pageshift",
      "href": "/2012/05/15/pageshift-removing-the-refresh/",
      "body": "It’s 2012, why are we still seeing websites assemble like Optimus Prime?\nIn January I wrote Web Design: 2012 and Beyond to highlight points of interest for the coming year. On interactivity I asked, “Is the page reload a thing of the past?”. ‘Web apps’ are all the rage, and while we shouldn’t be trying to […]",
      "date": 1337119848000
    },
    {
      "id": "were-hiring",
      "title": "We’re Hiring!",
      "href": "/2012/05/15/were-hiring/",
      "body": "\nWe’re hiring at Browser. If you like making stuff for the Web you’ll fit right in. The roles that need filling are a Junior Digital Designer/Developer (1 year’s experience needed) and an Intern Digital Designer (no experience, but lots of skills and ambition).\nHit the website for more info and contact details.\nRecruitment agencies, try: +44 (0) […]",
      "date": 1337065744000
    },
    {
      "id": "paydirt-youre-doing-it-wrong",
      "title": "Paydirt: You’re Doing It Wrong",
      "href": "/2012/05/08/paydirt-youre-doing-it-wrong/",
      "body": "We don’t spend hours debugging obscure IE bugs…\n\n\nNeither do I, yet my websites work just fine in Internet Explorer.\nJust over a month after the last “we’re dropping IE support” publicity stunt, another tech start-up has successfully hit pay dirt with the exact same bullshit (read: actively blocking IE).\nI realise that by sharing this link bait […]",
      "date": 1336511221000
    },
    {
      "id": "smashing-book-3",
      "title": "Smashing Book #3",
      "href": "/2012/05/07/smashing-book-3/",
      "body": "As an occasional writer for Smashing Magazine — that’s a disclaimer (and an honour!) — I’ve had the pleasure of reading the latest publication, Smashing Book #3 - Redesign The Web.\nHere’s my honest opinion on why this book is worth buying:\nOn Business\nBook #3 opens with wise words from Paul Boag on the reality of web […]",
      "date": 1336398706000
    },
    {
      "id": "hacking-it-right",
      "title": "Hacking it Right",
      "href": "/2012/05/03/hacking-it-right/",
      "body": "Developing with open web standards that are to be interpreted by literally hundreds of variations in device and browser can be tricky, but the biggest problem is often not the browser interpreting the code, but the developer writing it. Many so called “bugs” are the product of bad code and wrong expectations; don’t blame the […]",
      "date": 1336082878000
    }
  ],
  "nextPage": "/blog/page/18/",
  "prevPage": "/blog/page/16/",
  "pageTitle": "Blog (page 17) – David Bushell – Web Design (UK)"
}