{
  "dateUnix": 1287079537000,
  "dateFormatted": "Thursday 14 Oct 2010",
  "pageHeading": "Design is not doomed",
  "pagePath": "/2010/10/14/design-is-not-doomed/",
  "innerHTML": "<p>I’ve been suspiciously silent on this blog lately.</p>\n<p>Not sure what’s wrong with me! I’m still blogging daily at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://designheroes.co.uk\">designheroes.co.uk</a>. That’s where I post all my inspiration, interests and opinions on the latest design news &amp; events. I’ve also been rapidly developing <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://lovedsgn.com\">LoveDsgn</a> which has gone from a small to monumentally massive project in the space of a few months!</p>\n<p>Before you get bored rigid of this drivelling diary entry I guess I should introduce the topic of today’s post. It’s something along the lines of – <em>“how to stay motivated, find time for everything and avoid burning out”</em> – catchy, I know. I’ll think of something more sensational for the twitter status.</p>\n<p>I live my life by doing things in order of importance. At the moment that would be:</p>\n<ul>\n<li>My personal well being and lifestyle.</li>\n<li>My job.</li>\n<li>My projects outside of work.</li>\n<li>Latest Mad Men episode.</li>\n</ul>\n<p>Family and friends fall into #1 by the way. If I’m too tired I don’t move down the list until I’m refreshed. If you follow this ground breaking philosophy then rinse and repeat daily / weekly / monthly and enjoy it! Don’t do something just because you think you should. Life is too short for that shit.</p>\n<p>If you’re getting stressed, demotivated, bored, upset, complacent, dull, angry or just bewilderingly lost, you’ve probably got your list in the wrong order.</p>\n<p>But where’s the fun in that, eh?</p>\n<p>They do say a certain amount of emotion is healthy. So here are a few design related things that make me angry:</p>\n<ul>\n<li>Designers instantly dismissing big brand re-designs with no thought.</li>\n<li>Whiny comments about how said dismissers having no right to dismiss in the first place.</li>\n<li>Meta-analytical articles overshadowing the first two perspectives from a seemingly god like stance providing counter-arguments and logical fallacies to cover any resulting comments thereafter.</li>\n</ul>\n<p>But my ultimate brain boiling discussion topic is the countless doomsday predictions about the end of the “design community”. I can only assume I’m in a different community than those people.</p>\n<p>That being said, if I read the lines “at least we’re talking about this now”, or “it’s been good to start a conversation”, or “great to see how passionate our customers are” in response to something that’s been critically slammed and humiliated, I’ll scream. Just admit that you got it wrong! No one has ever saved face with a condescending canned cliché.</p>\n<p>And <em>“all publicity is good publicity?”</em> come on, do you <strong>really </strong>believe that?</p>\n<p>Micro-rant over.</p>\n<p>Wow, that wasn’t the point of this post at all. Talk about hypocritical. So much can be read into commentary that you could reasonably assume I’m about to explode right now. In reality I’m rather indifferent, or maybe at most a tad curious about those things. I’d much rather busy myself enjoying what’s important to me.</p>\n<p>I’m struggling for a point here… I suppose negative thoughts are natural but don’t let it consume your life. Whenever you stop designing and start ranting everyone else is moving onwards.</p>\n",
  "pageExcerpt": "I’ve been suspiciously silent on this blog lately.\nNot sure what’s wrong with me! I’m still blogging daily at designheroes.co.uk. That’s where I post all my inspiration, interests and opinions on the latest design news &amp; events. I’ve also been rapidly developing LoveDsgn which has gone from a small to monumentally massive project in the space […]",
  "pageTitle": "Design is not doomed – David Bushell – Web Design (UK)"
}