{
  "pageHeading": "Your Website",
  "pagePath": "/working-with-clients/",
  "innerHTML": "<p class=\"p--large\">Are you looking to get a new website of the ground, or revitalise an existing one?</p>\n<p>I’ve worked successfully with many businesses. From large national organisations to small individually run start-ups. Here’s how I can help you:</p>\n<ul>\n<li>I’ll assist in writing your brief and identifying what you need</li>\n<li>We’ll discuss viable solutions based on your budget and requirements</li>\n<li>My workflow will adapt to fit your availability and expertise</li>\n</ul>\n<blockquote>\n<p>David quickly immersed himself within the workings of our industry, and created a plan that concisely reflected [our] needs.</p>\n<p><cite>Jon Home &ndash; Director &ndash; Asset Management &ndash; <a href=\"/2013/08/09/responsive-design-for-kings-transfer/\">King’s Transfer Van Lines Inc.</a></cite></p>\n</blockquote>\n<p>Every project is unique. Rather than offering a set package my approach to design ensures we’re creating a website that works for your business:</p>\n<ul>\n<li>My design process is heavily feedback-driven</li>\n<li>You’ll receive regular updates not big surprises that require “sign off”</li>\n<li>We’ll test and iterate ideas in the web browser and on devices</li>\n</ul>\n<blockquote>\n<p>David was able to display sound reasoning and rationale for the decisions and advice provided to us, with solid industry best practice knowledge.</p>\n<p><cite>Chris King &ndash; ASE Consulting</cite></p>\n</blockquote>\n<p>Learn more about my <a href=\"/responsive-design/\"><strong>web design process</strong></a>.</p>\n<p>And if you’re unsure about the technical stuff I’ll help with web hosting and domains to ensure your website gets up and running smoothly.</p>\n<div class=\"b-boxed b-boxed--dark u-dark\">\n  <h3>Get a free quote&hellip;</h3>\n  <p>Interested in working with me? <a href=\"/contact/\">Send me an email</a> with your requirements and I’ll happily provide a free quote and let you know my availability.</p>\n  <a href=\"/contact/\" class=\"e-button e-button--bg1\">Get in Touch</a>\n</div>\n",
  "pageTitle": "Your Website – David Bushell – Web Design (UK)"
}