{
  "dateUnix": 1317855405000,
  "dateFormatted": "Wednesday 5 Oct 2011",
  "pageHeading": "Beyond superficial with CSS3",
  "pagePath": "/2011/10/05/beyond-superficial-with-css3/",
  "innerHTML": "<p>Last week I wrote <a href=\"http://dbushell.com/2011/10/01/building-for-future-design/\">Building for Future Design</a> — the notion: to advance web design we must build on solid foundations. Never forget accessibility.</p>\n<p><em>Six Revisions</em> published the very timely article <a href=\"http://sixrevisions.com/css/using-css3-appropriately/#comment-129212\">Are You Using CSS3 Appropriately?</a> by <em>Delwin Campbell</em> this week in which he reaches similar conclusions to me; usability, <em>accessibility</em> and user experience are our main objectives.</p>\n<p>It’s a very good article, but I do disagree with some of Campbell’s sentiments. He suggests that many CSS3 features are purely “superficial”:</p>\n<blockquote><p>In terms of design principles and visual presentation best practices, nothing has been altered by CSS3, even when we’ve been given fancy transitions, transforms and typography effects to play with. These are all superficial tools in web design, and we’ve had these things even before CSS3. […] From the user’s perspective — which is always the most important viewpoint — these new cosmetic CSS3 properties matter even less.</p></blockquote>\n\n\n<p>I don’t like that thinking. Popular <em>usage</em> has been superficial to-date but there needs to be a clear distinction between how CSS3 is being used now — yes, mostly cosmetic — and how it could be used in the near future. What has held us back is lack of browser support and poor rendering &amp; performance (limiting us to simple eye candy). The same can be said for pre-CSS3 techniques like JavaScript animations.</p>\n<h2 id=\"and-what-s-beyond-\">And what’s beyond?</h2>\n<p>Where can CSS3 take us beyond superficial sprinkles? I don’t have all the answers, but I do believe the future of web design will be hugely influenced by what we can innovate with CSS3 (and friends). Second only to the <strong>devices</strong> that support these web standards.</p>\n<p>I’d point to the recently launched <a href=\"http://www.apple.com/iphone/\">Apple iPhone 4S website</a> as a tantalising example of where our future could lead us (you’ll have to <a href=\"http://www.apple.com/iphone/\">visit</a> and click through the slideshow). Nothing more than a very advanced image slideshow I’m sure you’ll agree and — if you can get past the fact that I (a designer) have chosen Apple as an example — that sort of design ships products and delights users. It is a very _small _but definitely not _superficial _step into a new standard of design.</p>\n<p><a href=\"http://www.apple.com/iphone/\"><img src=\"/images/2011/10/appleiphone4s.png\" alt=\"Apple iPhone 4S website (as of 5th October 2011)\"></a>\n<em>Apple’s iPhone 4S website with a CSS3 transform slideshow.</em></p>\n<p>Now don’t get me wrong, I’m well aware that Apple’s website is far from perfect but I think its an effort worth applauding. My point is that we shouldn’t be so quick to dismiss new technologies that cannot be fully utilised and haven’t been fully explored.</p>\n<p>As <a href=\"http://sixrevisions.com/css/using-css3-appropriately/#comment-129212\">Campbell</a> rightly points out we should be “using CSS3 appropriately”, but I wouldn’t be so quick to accept the status quo as a benchmark for acceptable practice.</p>\n<p>Design evolves and the future of web design lies within web standards. Let’s see what we can do.</p>\n",
  "pageExcerpt": "Last week I wrote Building for Future Design — the notion: to advance web design we must build on solid foundations. Never forget accessibility.\nSix Revisions published the very timely article Are You Using CSS3 Appropriately? by Delwin Campbell this week in which he reaches similar conclusions to me; usability, accessibility and user experience are our […]",
  "pageTitle": "Beyond superficial with CSS3 – David Bushell – Web Design (UK)"
}