{
  "dateUnix": 1244573426000,
  "dateFormatted": "Tuesday 9 Jun 2009",
  "pageHeading": "Waterstones Space Opera",
  "pagePath": "/2009/06/09/waterstones-space-opera/",
  "innerHTML": "<p>Waterstones book display - some very eye catching book designs.</p>\n<p>London Underground has decided to <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/england/london/8090608.stm\">strike today for 48 hours</a> which has slightly inconvenienced my journey to and from work. Rather than getting terribly angry about the whole situation I’m going to take it as a challenge to see more of London (probably from a bus window).</p>\n<p>Today fairly unplanned I stopped by Waterstones at Canary Wharf to pick up 3 for 2 and some points on my loyalty card. The points seemed to have been hit worse than the pound in the “current economic climate” but enjoyably I did see this great book display (pictured below).</p>\n<p>Space Opera is a series of classic Sci-Fi books republished with designs from a D&amp;AD student competition. These are completely different to my entries but are very nice indeed. The black &amp; white style will stand out very well when they’re on the shelf and it creates an eye catching old/new appearance. I’m slightly glad now that I didn’t win the competition because my wallet would certainly be a whole lot lighter tonight.</p>\n<p><a href=\"/showcase/space-opera/\">See my Space Opera books »</a></p>\n<p><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/blog/waterstones-spaceopera.jpg\" alt=\"Space Opera book display at Waterstones\"></p>\n",
  "pageExcerpt": "Waterstones book display - some very eye catching book designs.\nLondon Underground has decided to strike today for 48 hours which has slightly inconvenienced my journey to and from work. Rather than getting terribly angry about the whole situation I’m going to take it as a challenge to see more of London (probably from a bus […]",
  "pageTitle": "Waterstones Space Opera – David Bushell – Web Design (UK)"
}