{
  "dateUnix": 1515664800000,
  "dateFormatted": "Thursday 11 Jan 2018",
  "pageHeading": "Hello Twenty Eighteen",
  "pagePath": "/2018/01/11/hello-2018/",
  "innerHTML": "<p>In 2018 I’ll be celebrating 10 years as a professional.</p>\n<p>I graduated in 2008. I hopped on a train to London and spent five years with two agencies. In 2013 I dusted off my return ticket and headed back up North. I’ve been freelancing ever since. My first office was the window end of my parent’s dining table. Now I’m in the spare room of my own apartment.</p>\n<p>I don’t make resolutions. If something needs doing it gets done. If not, it didn’t matter. But as it is January, I may as well add a little fanfare to my latest life hack. In an effort to spend less time sat on my backside…</p>\n<p class=\"b-post__image\"><img src=\"/images/blog/2018/newdesk.jpg\" alt=\"my new standing desk\"></p>\n\n<p>…a standing desk!</p>\n<p>I am, of course, sat down writing this, but it’s nice to have the option, you know?</p>\n<p>Over the decade – decade! a third of my life!! – my job has shifted from mostly design to almost exclusively front-end development. While I do enjoy the “why not React JS?” lifestyle, it has left me with less opportunity to show off in my portfolio. I still flex my design muscle on most projects but it’d be nice to start from scratch. I have a few ideas if the right client doesn’t say hello.</p>\n<p>This blog has suffered lately:</p>\n<p><p class=\"b-post__image\">\n  <span id=\"blogchart\" style=\"display: block; width:100%; min-height: 300px\"></span>\n</p></p>\n<script src=\"https://www.gstatic.com/charts/loader.js\"></script>\n<script src=\"/images/blog/2018/blogchart.js\"></script>\n\n<p>The chart above shows a steep drop-off in content after I left full-time employment. I attribute that to the lack of office banter. The web was my life and I’d often burn the midnight oil writing on the latest hot topic. Much of it was total rubbish but the occasional gem did earn me a large Twitter following.</p>\n<p>Nowadays, the computer switches off around 5–6pm and I’m much healthier for it. However, if I do one thing this year, and this is not a resolution I swear, I’ll blog more during office hours. Active engagement through writing has been my secret to staying relevant.</p>\n<p>As for work, I have contracts keeping me busy but I’m never not interested in new clients. That’s a double negative, I am interested. I guess I need to work on my sales pitch… anyway, <a href=\"/contact\">email me!</a></p>\n",
  "pageExcerpt": "In 2018 I’ll be celebrating 10 years as a professional.\nI graduated in 2008. I hopped on a train to London and spent five years with two agencies. In 2013 I dusted off my return ticket and headed back up North. I’ve been freelancing ever since. My first office was the window end of my parent’s […]",
  "pageDesc": "Celebrating 10 years as a \"professional\" and certainly not making new year resolutions.",
  "pageTitle": "Hello Twenty Eighteen – David Bushell – Web Design (UK)"
}