{
  "dateUnix": 1361217588000,
  "dateFormatted": "Monday 18 Feb 2013",
  "pageHeading": "CAPTCHAs: Just Say No",
  "pagePath": "/2013/02/18/captchas-just-say-no/",
  "innerHTML": "<p>A couple of years ago I wrote <a href=\"http://coding.smashingmagazine.com/2011/03/04/in-search-of-the-perfect-captcha/\">In Search Of The Perfect CAPTCHA</a> for Smashing Magazine. It was always a wild goose chase (but I knew that).</p>\n<p>I still get asked regularly how to deal with spam. It isn’t easy.</p>\n<p>I keep seeing new solutions pop up touted as an alterative to CAPTCHAs. Here’s the deal: replacing character recognition with other kinds of human tests — like pin the tail on the donkey — <strong>that’s still a CAPTCHA!</strong></p>\n<p class=\"b-post__image\"><img src=\"/images/2013/02/CAPTCHA.png\" alt=\"CAPTCHA\"></p>\n\n<p>Is this an experience you really want to force upon your users? It’s actually <em>worse</em> in my opinion. At least the likes of <a href=\"http://en.wikipedia.org/wiki/ReCAPTCHA\">reCAPCHA</a> have been ingrained into our psyche (even if they’re often illegible). Some stupid Flash game is just that; stupid. It looks terrible. It looks like an advertisement. It’s tacky. It’s still a lock you’re forcing your users to tediously pick.</p>\n<p class=\"b-post__image\"><img src=\"/images/2013/02/STILL-A-CAPTCHA.png\" alt=\"Still a CAPTCHA\"></p>\n\n<p>And guess what? <strong>It’s still a CAPTCHA!</strong></p>\n<p><em>“Completely Automated Public Turing test to tell Computers and Humans Apart”</em>. It doesn’t matter how you dress up your test. I get it. Spam is the bane of the webmaster’s life, but the solution isn’t to make it the customers problem. CAPTCHAs are the equivalent of TSA agents harassing innocent people at the US border. (I also enjoy <a href=\"http://boagworld.com/usability/dealing-with-spam/\">Paul Boag’s analogy</a>.)</p>\n<p>More to the point, CAPTCHAs aren’t even an entire solution to spam. It costs a matter of dollars to employ real humans in developing nations to submit thousands of forms.</p>\n<h2 id=\"what-is-the-answer-\">What is the answer?</h2>\n<p>If there was a silver bullet we wouldn’t have the nonsense above. Ideally your system should track and detect automated or fraudulent behaviour. The reality is that not even Twitter, Facebook, or Google can do this 100% effectively. Big banking institutions can’t either. If the incentive is high enough, people will find a way to cheat the system.</p>\n<p>Developers can implement invisible “honey pots” and time checks to detect automated spam invisibly. For open comment forms I can’t recommend <a href=\"http://akismet.com/\">Akismet</a> enough. I route my email through Google Mail. It strips almost all spam.</p>\n<p>Other techniques may include email or text message verification. There are so many spam targets online you just needs to be harder to crack than the average website. You may consider 3rd party authenticated login that is more sophisticated than what you can develop, e.g. social login, OpenID, BrowserID — perhaps not ideal experiences themselves but still better than another CAPTCHA.</p>\n<p>At the end of you day you’ll have to deal with spam and unwanted activity. That’s the price of running a website.</p>\n<p>Make things difficult for the bad guys, not 99% of honest users.</p>\n",
  "pageExcerpt": "A couple of years ago I wrote In Search Of The Perfect CAPTCHA for Smashing Magazine. It was always a wild goose chase (but I knew that).\nI still get asked regularly how to deal with spam. It isn’t easy.\nI keep seeing new solutions pop up touted as an alterative to CAPTCHAs. Here’s the deal: replacing […]",
  "pageTitle": "CAPTCHAs: Just Say No – David Bushell – Web Design (UK)"
}