{
  "dateUnix": 1377785694000,
  "dateFormatted": "Thursday 29 Aug 2013",
  "pageHeading": "Reacting to the Resize",
  "pagePath": "/2013/08/29/reacting-to-the-resize/",
  "innerHTML": "<p>I’m building a client’s website design that is more aware of the viewport than usual. Page headers — think large typography with a background image — cover 100% of the initial view. So too does the navigation; five items presented overlaying the entire screen.</p>\n<h2 id=\"first-but-not-final\">First but not final</h2>\n<p>When a page loads the first render — at whatever size the browser viewport happens to be — is not necessarily the final view the user will interact with. Consider the following:</p>\n<ul>\n<li>The user changes the orientation of their device.</li>\n<li>The user decides to expand their desktop browser fullscreen.</li>\n<li>The user initiates split-screen apps (e.g. Windows 8 — great point <a href=\"https://twitter.com/jack_l_smith/status/372787437317390336\">@jack_l_smith</a>)</li>\n</ul>\n<p>But let’s be less imaginative. <strong>Sometimes users do drag resize handles.</strong></p>\n<p>90% of the time — if you’ll pardon the made up statistic — a responsive website design naturally adapts as desired. That’s kind of the whole idea. Media queries are written to make the website responsive but sometimes CSS is not enough.</p>\n<h2 id=\"a-little-help\">A little help</h2>\n<p>To address my client’s design ideas I’d prefer to use <a href=\"http://www.w3.org/TR/css3-values/#viewport-relative-lengths\">viewport percentage units</a> in CSS. Unfortunately <a href=\"http://caniuse.com/#feat=viewport-units\">browser support</a> and an <a href=\"http://thatemil.com/blog/2013/06/13/viewport-relative-unit-strangeness-in-ios-6/\">iOS bug</a> mean JavaScript is required to react to the resize. It’s possible to listen for a window resize event and then detect the viewport size (see my <a href=\"https://gist.github.com/dbushell/6369330\">example gist</a>). Media queries can also be tested in javaScript with <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/window.matchMedia\">matchMedia</a> if we’re <a href=\"http://adactio.com/journal/5429/\">conditionally loading</a>. For flexible font sizing <a href=\"http://fittextjs.com/\">FitText</a> is great example. <em>Ideally</em> visual changes should be done with CSS alone but that’s not always possible today.</p>\n<h2 id=\"between-states\">Between states</h2>\n<p>Browsers will repaint the page as fast as possible when resized. Is there ever a scenario where it would be beneficial to add a transitional effect here? I’ve often seen this idea mocked as if only web developers resize their browser. Obviously not true. But then this:</p>\n<pre><code class=\"language-css\">* { transition: all 500ms ease; }\n</code></pre>\n<p>_is_ pretty stupid. All that does it fight against the browsers attempt to render the page. It thrashes the internal layout calculations meaning we’re unlikely to stay above 30 FPS required for a smooth transition. Ultimately pointless. With JavaScript — and <em>a lot</em> thereof — this can be controlled, see <a href=\"http://isotope.metafizzy.co/\">Isotope</a> for example, but is a resize transition really worth the effort? Not in my opinion. However, the idea shouldn’t be a developer taboo. There is substance here regardless of implementation practicality.</p>\n<p>So I guess my point is:</p>\n<ul>\n<li>Users do resize under many circumstances.</li>\n<li>JavaScript may be required to aid CSS and this requires listening for resize events.</li>\n<li>Transitional effects have future potential and should not be dismissed so quickly.</li>\n</ul>\n<p><strong>Happy resizing!</strong></p>\n<p><em>P.S. don’t be afraid to resize like crazy to test media queries and layout changes. Nothing wrong with that. Just don’t forget device testing to experience real interaction and performance.</em>\n  *[FPS]: frames per second</p>\n",
  "pageExcerpt": "I’m building a client’s website design that is more aware of the viewport than usual. Page headers — think large typography with a background image — cover 100% of the initial view. So too does the navigation; five items presented overlaying the entire screen.\nFirst but not final\nWhen a page loads the first render — at […]",
  "pageTitle": "Reacting to the Resize – David Bushell – Web Design (UK)"
}