{
  "dateUnix": 1447322400000,
  "dateFormatted": "Thursday 12 Nov 2015",
  "pageHeading": "Tales WordPress theme is now free!",
  "pagePath": "/2015/11/12/tales-wordpress-theme-now-free/",
  "innerHTML": "<p><a href=\"/2014/02/17/introducing-tales/\">Tales is a WordPress theme</a> I developed early last year to show that responsive design and legacy browser support are not mutually exclusive.</p>\n<p class=\"b-post__image\"><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://themes.dbushell.com/tales/\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2014/02/tales-preview-large.png\" alt=\"Tales WordPress theme preview\"></a></p>\n\n<p>For the few months that I sold Tales it provided a small but welcome side income (considering my lack of advertising). Today I’m happy to announce that Tales is now <strong>free to download</strong> and use under the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://themes.dbushell.com/tales/license/\">MIT license</a>.</p>\n<h2 id=\"why-free-why-now-\">Why free, why now?</h2>\n<p>I sold Tales until October 2014 when the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://twitter.com/search?q=%23vatmoss\">#VATMOSS</a> EU tax changes threatened to kill small business selling digital goods. Or at least, that seemed to be the sentiment and it certainly looked painful for me. Rather than dealing with it I simply stopped selling Tales.</p>\n<p>I haven’t been keeping up to date with the whole EU VAT thing but I did notice one of my selling platforms — <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://blog.gumroad.com/post/110080508463/vat\">Gumroad</a> — now takes the burden. So I could start flogging again, but a year on, I feel it’s now appropriate to give away the theme for free without offending the handful of lovely buyers who supported my project.</p>\n<p>I don’t expect many people to use Tales in production but it might suit as a simple example of a sellable theme if you’re looking to get into that kind of development.</p>\n<h2 id=\"download-tales\">Download Tales</h2>\n<p><strong><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://themes.dbushell.com/tales/\">Visit the Tales website to see a demo and download the theme.</a></strong></p>\n<p>I can’t provide free support but the site linked above has plenty of documentation for authors and developers.</p>\n",
  "pageExcerpt": "Tales is a WordPress theme I developed early last year to show that responsive design and legacy browser support are not mutually exclusive.\n\n\nFor the few months that I sold Tales it provided a small but welcome side income (considering my lack of advertising). Today I’m happy to announce that Tales is now free to download […]",
  "pageTitle": "Tales WordPress theme is now free! – David Bushell – Web Design (UK)"
}