{
  "dateUnix": 1306588863000,
  "dateFormatted": "Saturday 28 May 2011",
  "pageHeading": "Simplicity in UI - IA Writer for Mac",
  "pagePath": "/2011/05/28/simplicity-in-ui-design-ia-writer-for-mac/",
  "innerHTML": "<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.informationarchitects.jp/en/ia-writer-for-mac/\">IA Writer for Mac</a> looks like the sort of product I’d download immediately, and I did!</p>\n<p>It has all the designer’s preferred aesthetics. It’s minimalist, typography focused and beautifully <strong>simple</strong>.</p>\n<p>Designers often get a lot of heat for their style-orientated tastes but in reality most of us understand how important user interface design is; it’s far more than a taste for visual treats.</p>\n<p>The iPhone is not a success because designers are Apple fan-boys, it’s a success because millions of normal people just <em>get it</em>. There are great examples in modern app design where something complex is stripped back to its basic function. This concept has revolutionised website design, where mobile devices have dictated new thinking; content and function.</p>\n<p><strong>IA Writer for Mac</strong> takes this idea to the extreme. It’s certainly not mass-market software, it’s an experimentation into focus and simplicity. The results are remarkable.</p>\n<p><a href=\"/images/2011/05/iawriter.jpg\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/05/iawriter.jpg\" alt=\"IA Writer for Mac\"></a></p>\n<blockquote><p>A better tool doesn’t make a better craftsman, but a good tool makes working a pleasure. iA Writer for Mac is a digital writing tool that makes sure that all your thoughts go into the text instead of the program. iA Writer has no preferences. It is how it is. It works like it works.</p></blockquote>\n\n\n<p>“Focus Mode” (Command+D) is perfect. It focuses you on a single sentence emphasising the importance to <em>write on</em>, read later. A common and much used writing technique that works for most people.</p>\n<p>As for the “no mouse” philosophy, well, that’s a hard idea for me to get used to (the mouse can be used, by the way). After some typing it’s quiet apparent you <em>don’t need</em> the mouse for word processing. Obviously, really. Microsoft Word has given us some strange ideas. Thinking about it, I have no idea what all those buttons, menus and “ribbons” are in Word.</p>\n<p>Keyboard shortcuts are something I’ll have to get use to. Call me ignorant (I’m happy to admit I’m not a power user) but I hate keyboard shortcuts. Aside from the classics like Ctrl+C and Ctrl+P I never use them. After using <strong>IA Writer</strong> for a while though, you don’t actually <em>need</em> them. Since I’ll be using this for the foreseeable future I will take the opportunity to learn <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://daringfireball.net/projects/markdown/syntax\">Markdown</a>. The <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://wordpress.org/extend/plugins/markdown-on-save/\">Markdown WordPress plugin</a> by Mark Jaquith works great. This is a perfect example of additional functionality that never gets in the way. It’s non-existent if you choose not to use it.</p>\n<p>Should all software be like <strong>IA Writer</strong>? Can it? I think so. When designing interfaces we should explore this philosophy. <strong>Antoine de Saint Exupéry</strong> said it best:</p>\n<blockquote><p>It seems that perfection is attained not when there is nothing more to add, but when there is nothing more to remove.</p></blockquote>\n\n\n<p>These ideas are not new but it’s too easy to lose focus with so much demand from elsewhere. You have to remain focused from the users perspective. What is the main goal they want to achieve?</p>\n<p>Figure that out and do it in the most simple, beautiful and accessible way possible.</p>\n",
  "pageExcerpt": "IA Writer for Mac looks like the sort of product I’d download immediately, and I did!\nIt has all the designer’s preferred aesthetics. It’s minimalist, typography focused and beautifully simple.\nDesigners often get a lot of heat for their style-orientated tastes but in reality most of us understand how important user interface design is; it’s far more […]",
  "pageTitle": "Simplicity in UI - IA Writer for Mac – David Bushell – Web Design (UK)"
}