{
  "dateUnix": 1277725107000,
  "dateFormatted": "Monday 28 Jun 2010",
  "pageHeading": "Finding the right style",
  "pagePath": "/2010/06/28/finding-the-right-style/",
  "innerHTML": "<p>At <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.basecreative.eu\">Base Creative</a> we’re doing a series of blog posts and video blogs (“vlogs” - I’m not sure that’ll catch on) about our website design strategy. That’s the process we go through with our clients and especially the initial meetings. In my latest post I discuss a specific technique we use in the strategy meeting:</p>\n<blockquote>\n<p>One way which we achieve [design communication] is before the strategy meeting we’ll spend time finding websites with a range of styles and themes. These could reflect a particular design aesthetic or include a specific element that may work well on our client’s website. Everyone finds it difficult to discuss design without any visual cues, even designers. This website slideshow has proven to work very well as a web design discussion point.</p>\n</blockquote>\n<p>Read the rest of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.basecreative.eu/news/david-bushell/2010/06/28/finding-the-right-style/\">“Finding the right style”</a> on the Base Creative blog.</p>\n<p>Presenting various websites with different styles is a very common technique among design agencies. For the reasons stated in the article above (namely visualising communication) it’s incredibly useful, especially for clients. Obviously the final website we <em>actually</em> design will not be a copy of the ones we present but there are inevitably some ideas that can be drawn from them. Ultimately the presentation is there to give the client something visual to discuss from. It’s a way to qualify “design words” - when they say “corporate” do they mean what <em>I see</em> as corporate?</p>\n<p>I’d be interested to know how other agencies go about discussing website design ideas with their clients. Leave a comment below!</p>\n",
  "pageExcerpt": "At Base Creative we’re doing a series of blog posts and video blogs (“vlogs” - I’m not sure that’ll catch on) about our website design strategy. That’s the process we go through with our clients and especially the initial meetings. In my latest post I discuss a specific technique we use in the strategy meeting:\n\nOne way which […]",
  "pageTitle": "Finding the right style – David Bushell – Web Design (UK)"
}