{
  "dateUnix": 1303157548000,
  "dateFormatted": "Monday 18 Apr 2011",
  "pageHeading": "Simplicity and Sexy Buttons",
  "pagePath": "/2011/04/18/simplicity-and-sexy-buttons-in-web-design/",
  "innerHTML": "<p>I’ve <a href=\"/2011/03/28/three-months-in/\">mentioned</a> <a href=\"/2011/01/16/reflecting-on-aesthetics/\">simplicity</a> a few times before but I thought I’d expand on this concept within web design as it’s such a fundamental part of my process.</p>\n<h3 id=\"simplicity-in-aesthetics\">Simplicity in Aesthetics</h3>\n<p>Although aesthetics are perhaps the least important aspect of website design they are initially the most noticeable, at least for demonstration purposes.</p>\n<p>Let’s consider four submit buttons:</p>\n<p><a href=\"/images/2011/04/buttons.png\"><p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2011/04/buttons.png\" alt=\"Four Submit Buttons (text, minimal, simple, complex)\"></p>\n</a></p>\n<p><strong>The first</strong> is too basic. It fails to achieve its purpose; it’s unrecognisable from a normal hyperlink and therefore does not differentiate between <em>navigation</em>, and <em>action</em>.</p>\n<p><strong>The second</strong> is a minimalist approach. There’s just enough to identify its functionality (with the double line underneath giving a visual depth).</p>\n<p><strong>The third</strong> represents what I call <em>simplicity</em>. It’s the Goldilocks button (just right). It does its job with a restrained artistic allowance for a house-style.</p>\n<p><strong>The fourth</strong> is too complex. It’s over-stylised and contains many superfluous features that distract from its purpose. It will likely compete for undeserved attention.</p>\n<p>Using this isolated element it’s possible to somewhat describe my design preference, but as any good designer knows, there is a hierarchy of content &amp; visuals that all rely on one another. We can’t take a purely <em>minimalist</em> approach because that would remove necessary brand styles. Neither can we focus too much on fine detail &amp; decoration while ignoring the overall effect it has on experience.</p>\n<p>Making something complex like a website look simple requires a <em>very</em> fine balance.</p>\n<p>This doesn’t mean button number four will never exist in my designs, but if it does, it will be a very considered and late amendment to add emphasis and attraction where needed.</p>\n<h3 id=\"simplicity-in-user-experience\">Simplicity in User Experience</h3>\n<p>I work on navigation layout and content structure first, where size and positioning dictates everything. I then build up a consistent visual language for elements to fine tune the balance (this is where said buttons make an appearance).</p>\n<p>Doing this requires frequent checking of the original strategy discussed with the client. The site’s purpose and target audience. There’s no surprise that one of the reoccurring requirements from clients is <strong>simplicity</strong>. It’s something <em>every</em> client asks me for.</p>\n<p>“Simple” is a scary word.</p>\n<p>In a certain context it implies a lack of intelligence and therefore in design it could mean lack of refinement, thought, and possibly skill. But that’s nonsense. “Simple” is (simply) a reaction to too many experiences with complex and confusing design that dominates the web; design for designs sake; design for other designers, and industry awards.</p>\n<p>What clients are asking for (without knowing) is that we do not indulge ourselves and stay focused. That’s difficult to do, but it doesn’t mean we can’t design a damn sexy button. I’m still trying to figure out what perfection means in regards to website design but I know simplicity is in the answer.</p>\n",
  "pageExcerpt": "I’ve mentioned simplicity a few times before but I thought I’d expand on this concept within web design as it’s such a fundamental part of my process.\nSimplicity in Aesthetics\nAlthough aesthetics are perhaps the least important aspect of website design they are initially the most noticeable, at least for demonstration purposes.\nLet’s consider four submit buttons:\n\n\nThe first […]",
  "pageTitle": "Simplicity and Sexy Buttons – David Bushell – Web Design (UK)"
}