{
  "dateUnix": 1423057945000,
  "dateFormatted": "Wednesday 4 Feb 2015",
  "pageHeading": "I don’t do Angular, is that OK?",
  "pagePath": "/2015/02/04/i-dont-do-angular-is-that-ok/",
  "innerHTML": "<p>I’ve never been one to care for job titles. One or two words can’t adequately explain the extent of our roles. I try to avoid giving myself a strict title on this website.</p>\n<p>On my homepage:</p>\n<blockquote>\n<p>“I design, build &amp; write all things web”</p>\n</blockquote>\n<p>Then I list:</p>\n<ul>\n<li><a href=\"/responsive-design/\">Responsive Design</a></li>\n<li><a href=\"/front-end-development/\">Front-end Development</a></li>\n<li><a href=\"/process-and-strategy/\">Process &amp; Strategy</a></li>\n</ul>\n<p>These pages are a delicate balance of an intelligent, thoughtful, and succinct description of my ‘craft’, and some SEO bingo because that’s an unfortunate reality. In my sidebar-slash-footer: <em>“I freelance for small businesses, start-ups, individuals, and fellow web agencies.”</em> — i.e. pretty much anyone willing to pay me.</p>\n<p>I try to emphasis web design first because it’s what I enjoy most. Though really, design &amp; build are part of the same package. Figuring out clean and sometimes clever CSS for a responsive layout is a lot of fun.</p>\n<p>I’m very competent with JavaScript. I know the language / syntax. I’m well versed in the DOM. I like to write JavaScript if it adds a level of interactivity that enhances the “experience” (or even improves performance).</p>\n<p>All of this, and more, is what I think of when I read “Front-end Developer”.</p>\n<p>Nowadays the definition is significantly different for others.</p>\n<p>With the rise in popularity of <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://angularjs.org/\">Angular</a> and all the other JavaScript MVC frameworks, back-end logic has moved into the browser. Calling this kind of development “front-end” is technically correct <sup>(<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.youtube.com/watch?v=hou0lU8WMgo\">the best kind</a>)</sup>. It is <em>front-end</em>. But it’s so very different from what I do. The skill set required seems to have more in common with a back-end programmer.</p>\n<p>Sure, I’ve dabbled, and trepidations aside, I even think I might like where these frameworks are going (Jeremy Keith has recently <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://adactio.com/journal/8245\">summed up the concerns</a>). But after some pondering it struct me, <strong>do I want to be doing this work?</strong> It’s not what I’m best at. I don’t really enjoy it.</p>\n<p>Is that simply because I haven’t taken the time to learn this stuff to a professional level? I’ve spent a <a href=\"/2013/04/25/ember-data-and-mongodb/\">good amount of time</a> playing with these technologies. I understand the concepts, certainly enough to consider, and doubt, whether I can realistically stretch my range of services so broadly.</p>\n<p>It shouldn’t be an expectation that a front-end developer can program applications just because the language is now JavaScript. I don’t think it is, at least not yet. My frustration stems from the growing number of enquiries I receive, and opportunities I seek out, looking for a front-end developer to build a website, only to discover in follow-up discussion that the entire thing is Angular.</p>\n<p>I want to be content knowing there are some roles I don’t need to fulfil, regardless of job title definitions. But I can’t help feeling in limbo right now. I don’t want to limit myself either. It’s OK that I don’t do Angular, but maybe one day I will.</p>\n",
  "pageExcerpt": "I’ve never been one to care for job titles. One or two words can’t adequately explain the extent of our roles. I try to avoid giving myself a strict title on this website.\nOn my homepage:\n\n“I design, build &amp; write all things web”\n\nThen I list:\n\nResponsive Design\nFront-end Development\nProcess &amp; Strategy\n\nThese pages are a delicate balance of an […]",
  "pageTitle": "I don’t do Angular, is that OK? – David Bushell – Web Design (UK)"
}