{
  "dateUnix": 1365157578000,
  "dateFormatted": "Friday 5 Apr 2013",
  "pageHeading": "The Flat Build (2)",
  "pagePath": "/2013/04/05/the-flat-build-2/",
  "innerHTML": "<p>My article <a href=\"/2013/03/18/the-flat-build/\">The Flat Build</a> was a slow burner but it has picked up steam recently and for the first time in like, forever, I’m building a pre-designed* website without having design influence. This has proven to be a good opportunity to refine and expand upon my flat build workflow (again).</p>\n<p>I’m aware I’m reinventing more than a few wheels here. This project has always been about starting from the ground up and questioning every choice.</p>\n<p class=\"p--small u-dim\">* Yeah, I’m a big advocate for agile “decide in the browser” web design/dev, but I have to admit that a beautifully maintained PSD deliverable still feels like Christmas.</p>\n<h2 id=\"boilerplate\">Boilerplate</h2>\n<p>I’ve always maintained a personal set of HTML &amp; CSS files to use as a starting point for any build. Mostly good practices, general preferences, and stuff I forget like the favicon.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2013/04/iconslateapp.png\" alt=\"Icon Slate favicon app\"></p>\n<p>This practice has never actually helped me <em>remember</em> the favicon — you have to love boilerplate deployment — but after catching up with <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://css-tricks.com/video-screencasts/122-the-state-of-favicons/\">Chris Coyier’s screencast</a> I have a new found love. I’m currently writing the favicon-first manifesto…</p>\n<h2 id=\"repository\">Repository</h2>\n<p>I use Git as source control for everything. This includes my boilerplate which I can evolve and fork for new projects. Starting a new build requires these steps:</p>\n<ol>\n<li>Initialise a new Git repo</li>\n<li>Merge in my boilerplate code</li>\n<li>Run <code>npm install</code> to pull in dependencies (basically <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://gruntjs.com/\">Grunt</a> + tasks)</li>\n</ol>\n<p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.sublimetext.com/2\">Sublime Text 2</a> and <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.iterm2.com/\">iTerm</a> (with<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/robbyrussell/oh-my-zsh\"> oh-my-zsh</a>) are my apps of choice for code management.</p>\n<p class=\"b-post__image\"><img src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" data-lazy=\"false\" data-src=\"/images/2013/04/sublimeproject.png\" alt=\"Sublime and iTerm\"></p>\n<p class=\"p--small u-dim\">And yes, I work on the master branch and name my devices after monkeys.</p>\n<p>As you can see my project directory structure looks like this:</p>\n<ul>\n<li><code>build/</code></li>\n<li><code>src/</code></li>\n<li><code>tasks/</code></li>\n<li><code>templates/</code></li>\n<li><code>Gruntfile.js</code></li>\n<li><code>package.json</code></li>\n<li><code>README.md</code></li>\n</ul>\n<p>The <code>build</code> directory is generated by Grunt and never committed to Git. It contains the final static website with no outside dependencies. I can view it in the browser, archive and email to a client, toss on a server, or just delete and rebuild it entirely for a laugh (that novelty wears off).</p>\n<p>The <code>src</code> directory contains the actual editable source and original assets; Sass, JavaScript, SVG, web fonts etc. The <code>templates</code> directory contains HTML (I should probably move this into <code>src</code> for consistency). My <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://gist.github.com/dbushell/5317948\">HTML Grunt task</a> — new and improved* — lets me separate HTML includes and reference relative assets or paths. All without server-side scripting.</p>\n<p class=\"p--small u-dim\">* use at your own risk.</p>\n<p>The basic principle here is to keep a <strong>single source</strong> for all working assets. If that isn’t the final output — e.g. Sass or un-minified JavaScript — the output should get compiled automatically. Similarly, I don’t want to manually maintain PNG fallbacks for vector graphics if they can be built from source. The whole set up is complex but the act of building is simplified.</p>\n<p>The complete set of build tasks can be quite slow so I need to build individual components as and when they are modified.</p>\n<h2 id=\"who-watches-the-watchmen\">Who watches the watchmen?</h2>\n<p>I’ve been using <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://compass-style.org/\">Compass</a> for a long time to generate CSS. With pre-processors you get a nice command line programme to watch for changes and automatically generate plain CSS output. This alleviates the burden that an extra step adds.</p>\n<p>With my new practice of separation between source and build I need a more powerful watcher. <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://github.com/gruntjs/grunt-contrib-watch\">Grunt watch</a> comes to the rescue. For each requirement I instruct it to watch a set of files and then perform a specific task. HTML is edited? Rebuild it. CSS changes? Recompile it. SVGs are modified? Optimise and create raster fallbacks (OK, <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://twitter.com/dbushell/status/318733510674350081/\">I haven’t perfected that yet</a>).</p>\n<p>Whenever I’m working on a project I just run <code>grunt watch</code> and let it go.</p>\n<h2 id=\"next-step\">Next step</h2>\n<p>Like I said, none of this is particular ground breaking but I’m learning a huge amount by starting from scratch. I could jump straight into an existing solution like <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://yeoman.io/\">Yeoman</a> but I’d never really understand the “why” behind the process. My quest is <a href=\"/2013/03/12/automation/\">automation</a> and I’m already making life easier. Even with the less than optimal set of tasks I’ve hacked together.</p>\n<p>I’ve written a lot about <strong>facilitating</strong> the build process but not the actual practice of writing HTML, CSS, and JavaScript itself. The most time consuming thing of all. I’ll follow up on that soon, for now read my <a href=\"/2013/01/01/five-tips-for-responsive-builds/\">5 Tips for Responsive Builds</a> and be sure to read Dave Rupert’s excellent article on <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://daverupert.com/2013/04/responsive-deliverables/\">Responsive Deliverables</a>.</p>\n",
  "pageExcerpt": "My article The Flat Build was a slow burner but it has picked up steam recently and for the first time in like, forever, I’m building a pre-designed* website without having design influence. This has proven to be a good opportunity to refine and expand upon my flat build workflow (again).\nI’m aware I’m reinventing more than […]",
  "pageTitle": "The Flat Build (2) – David Bushell – Web Design (UK)"
}