{
  "dateUnix": 1305480240000,
  "dateFormatted": "Sunday 15 May 2011",
  "pageHeading": "Attending FOWD 2011",
  "pagePath": "/2011/05/15/attending-fowd-2011/",
  "innerHTML": "<p>Only two days before this year’s <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://futureofwebdesign.com/london-2011/\">Future of Web Design</a>! I’m excited, thanks to the fine folks at <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://www.smashingmagazine.com\">Smashing Magazine</a> I’ll be attending both seminar days. Say hello!</p>\n<p>I’m not a fan of the two track structure as I’ll have to miss some talks live (though I’ll be able to catch them online later). I’m going to skip talks about visual design and web standards — I know, but it’s my day job!</p>\n<p>I’ll learn more in related areas like accessibility and content. So “<em>Demystifying Accessibility”</em> by <strong>Iain Hamilton</strong>, <em>“Intrigue Me: Writing Compelling, Credible Content”</em> by <strong>Stephanie Hay</strong> and <em>“Copywriting is Design”</em> by <strong>John McGarvey</strong> are top of my list. Hopefully these talks will come at a good time, as I’m making strong progress as a good practice, good content advocate! Of course, the talks on iOS &amp; app design will also be a guilty pleasure. The line between app and website design is getting very thin.</p>\n<p>If you see me say hello! I’ll be wearing an ever so trendy <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"http://html5shirt.com\">HTML5 T-shirt</a> (under a white shirt). And since I live around the corner, I’ll be in the pub later.</p>\n",
  "pageExcerpt": "Only two days before this year’s Future of Web Design! I’m excited, thanks to the fine folks at Smashing Magazine I’ll be attending both seminar days. Say hello!\nI’m not a fan of the two track structure as I’ll have to miss some talks live (though I’ll be able to catch them online later). I’m going to skip […]",
  "pageTitle": "Attending FOWD 2011 – David Bushell – Web Design (UK)"
}